#pragma once

#include "declarations.h"
#include "structs.h"

namespace fb
{
    ////////////////////////////////////////
// ClassId:   00226
// RuntimeId: 00487
// TypeInfo:  0x023C6FA0
#ifndef _EntityBusPeer_
#define _EntityBusPeer_
    class EntityBusPeer
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 226;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C6FA0;
        }
        char _0x0000[4];
    };//Size=0x0004
#endif

    ////////////////////////////////////////
    // ClassId:   00399
    // RuntimeId: 00485
    // TypeInfo:  0x023C6F50
#ifndef _Entity_
#define _Entity_
    class Entity : public EntityBusPeer
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 399;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C6F50;
        }
        char _0x0004[8];
    };//Size=0x000C
#endif

    ////////////////////////////////////////
    // ClassId:   00802
    // RuntimeId: 00005
    // TypeInfo:  0x023C23D0
#ifndef _DataContainer_
#define _DataContainer_
#pragma pack(push, 4)
    class DataContainer
    {
    public:
        static __inline DataContainer* DefaultInstance()
        {
            return (DataContainer*)0xF87E6CD8;
        }
        static __inline unsigned int ClassId()
        {
            return 802;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C23D0;
        }
        char _0x0000[8];
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00805
    // RuntimeId: 06491
    // TypeInfo:  0x02407480
#ifndef _EmitterComponentData_
#define _EmitterComponentData_
#pragma pack(push, 4)
    class EmitterComponentData : public DataContainer
    {
    public:
        static __inline EmitterComponentData* DefaultInstance()
        {
            return (EmitterComponentData*)0xF87E6E98;
        }
        static __inline unsigned int ClassId()
        {
            return 805;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407480;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00806
    // RuntimeId: 06495
    // TypeInfo:  0x024074D8
#ifndef _EvaluatorData_
#define _EvaluatorData_
#pragma pack(push, 4)
    class EvaluatorData : public EmitterComponentData
    {
    public:
        static __inline EvaluatorData* DefaultInstance()
        {
            return (EvaluatorData*)0xF87E6EB8;
        }
        static __inline unsigned int ClassId()
        {
            return 806;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024074D8;
        }
        EmitterParameter m_EmitterParameter; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00810
    // RuntimeId: 06523
    // TypeInfo:  0x02407708
#ifndef _SphereEvaluatorData_
#define _SphereEvaluatorData_
#pragma pack(push, 16)
    class SphereEvaluatorData : public EvaluatorData
    {
    public:
        static __inline SphereEvaluatorData* DefaultInstance()
        {
            return (SphereEvaluatorData*)0xF87E7000;
        }
        static __inline unsigned int ClassId()
        {
            return 810;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407708;
        }
        char _0x000C[4];
        Vec3 m_Scale; //0x0010
        Vec3 m_Pivot; //0x0020
        float m_Radius; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00811
    // RuntimeId: 06521
    // TypeInfo:  0x024076DC
#ifndef _BoxEvaluatorData_
#define _BoxEvaluatorData_
#pragma pack(push, 16)
    class BoxEvaluatorData : public EvaluatorData
    {
    public:
        static __inline BoxEvaluatorData* DefaultInstance()
        {
            return (BoxEvaluatorData*)0xF881E910;
        }
        static __inline unsigned int ClassId()
        {
            return 811;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024076DC;
        }
        char _0x000C[4];
        Vec3 m_Dimensions; //0x0010
        Vec3 m_Pivot; //0x0020
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00812
    // RuntimeId: 06519
    // TypeInfo:  0x024076B0
#ifndef _RandomXYZEvaluatorData_
#define _RandomXYZEvaluatorData_
#pragma pack(push, 4)
    class RandomXYZEvaluatorData : public EvaluatorData
    {
    public:
        static __inline RandomXYZEvaluatorData* DefaultInstance()
        {
            return (RandomXYZEvaluatorData*)0xF87E7068;
        }
        static __inline unsigned int ClassId()
        {
            return 812;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024076B0;
        }
        float m_MaxX; //0x000C
        float m_MinX; //0x0010
        float m_MaxY; //0x0014
        float m_MinY; //0x0018
        float m_MaxZ; //0x001C
        float m_MinZ; //0x0020
    };//Size=0x0024
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00813
    // RuntimeId: 06517
    // TypeInfo:  0x02407684
#ifndef _RandomEvaluatorData_
#define _RandomEvaluatorData_
#pragma pack(push, 4)
    class RandomEvaluatorData : public EvaluatorData
    {
    public:
        static __inline RandomEvaluatorData* DefaultInstance()
        {
            return (RandomEvaluatorData*)0xF87E70A0;
        }
        static __inline unsigned int ClassId()
        {
            return 813;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407684;
        }
        float m_Max; //0x000C
        float m_Min; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00814
    // RuntimeId: 06515
    // TypeInfo:  0x02407658
#ifndef _RotateVectorData_
#define _RotateVectorData_
#pragma pack(push, 4)
    class RotateVectorData : public EvaluatorData
    {
    public:
        static __inline RotateVectorData* DefaultInstance()
        {
            return (RotateVectorData*)0xF881E968;
        }
        static __inline unsigned int ClassId()
        {
            return 814;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407658;
        }
        float m_Angle; //0x000C
        bool m_RotateWithinPlane; //0x0010
        bool m_InputAffectsPhi; //0x0011
        char _0x0012[2];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00815
    // RuntimeId: 06513
    // TypeInfo:  0x0240762C
#ifndef _SampleTextureData_
#define _SampleTextureData_
#pragma pack(push, 16)
    class SampleTextureData : public EvaluatorData
    {
    public:
        static __inline SampleTextureData* DefaultInstance()
        {
            return (SampleTextureData*)0xF881E990;
        }
        static __inline unsigned int ClassId()
        {
            return 815;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240762C;
        }
        Vec2 m_TextureDimensions; //0x000C
        char _0x0014[12];
        Vec3 m_ColorIntensityMax; //0x0020
        Vec3 m_ColorIntensityMin; //0x0030
        Array<Vec4> m_GradientData; //0x0040
        float m_TextureOriginU; //0x0044
        float m_TextureOriginV; //0x0048
        char _0x004C[4];
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00816
    // RuntimeId: 06511
    // TypeInfo:  0x02407600
#ifndef _PolynomialOperatorData_
#define _PolynomialOperatorData_
#pragma pack(push, 16)
    class PolynomialOperatorData : public EvaluatorData
    {
    public:
        static __inline PolynomialOperatorData* DefaultInstance()
        {
            return (PolynomialOperatorData*)0xF881EA10;
        }
        static __inline unsigned int ClassId()
        {
            return 816;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407600;
        }
        char _0x000C[4];
        PolynomialTempData m_FirstOperand; //0x0010
        PolynomialTempData m_SecondOperand; //0x0030
        PolynomialOperation m_Operation; //0x0050
        float m_MinClampResult; //0x0054
        float m_MaxClampResult; //0x0058
        char _0x005C[4];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00817
    // RuntimeId: 06505
    // TypeInfo:  0x024075B4
#ifndef _PolynomialData_
#define _PolynomialData_
#pragma pack(push, 16)
    class PolynomialData : public EvaluatorData
    {
    public:
        static __inline PolynomialData* DefaultInstance()
        {
            return (PolynomialData*)0xF881EAB0;
        }
        static __inline unsigned int ClassId()
        {
            return 817;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024075B4;
        }
        char _0x000C[4];
        Vec4 m_Coefficients; //0x0010
        float m_ScaleValue; //0x0020
        float m_MinClamp; //0x0024
        float m_MaxClamp; //0x0028
        char _0x002C[4];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00803
    // RuntimeId: 06503
    // TypeInfo:  0x02407588
#ifndef _EmitterSystemSettings_
#define _EmitterSystemSettings_
#pragma pack(push, 4)
    class EmitterSystemSettings : public DataContainer
    {
    public:
        static __inline EmitterSystemSettings* DefaultInstance()
        {
            return (EmitterSystemSettings*)0xF87E6CF8;
        }
        static __inline unsigned int ClassId()
        {
            return 803;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407588;
        }
        unsigned __int32 m_MeshDrawCountLimit; //0x0008
        float m_TimeScale; //0x000C
        float m_GlobalResetStartTimeInterval; //0x0010
        float m_QuadHalfResSlice2ThresholdLow; //0x0014
        float m_QuadHalfResSlice2ThresholdHigh; //0x0018
        float m_QuadHalfResSlice1ThresholdLow; //0x001C
        float m_QuadHalfResSlice1ThresholdHigh; //0x0020
        __int32 m_DebugOverdrawCount; //0x0024
        unsigned __int32 m_DrawStats; //0x0028
        float m_MeshStreamingPriorityMultiplier; //0x002C
        float m_QuadZOcclusionBias; //0x0030
        unsigned __int32 m_DrawBoundingBoxes; //0x0034
        float m_MinScreenArea; //0x0038
        float m_QuadNearFadeDistance; //0x003C
        __int32 m_QuadTechnique; //0x0040
        float m_MeshCullingDistance; //0x0044
        bool m_EnableFixedTimeStep; //0x0048
        bool m_ZBufferCullEnable; //0x0049
        bool m_QuadEnableOverdrawRendering; //0x004A
        bool m_QuadColorShaderCostsEnable; //0x004B
        bool m_DrawProjectedBoxes; //0x004C
        bool m_QuadSimpleRenderingEnable; //0x004D
        bool m_EnableJobs; //0x004E
        bool m_EnableRendering; //0x004F
        bool m_QuadHalfResEnable; //0x0050
        bool m_QuadEnableRendering; //0x0051
        bool m_EnableFixedDelta; //0x0052
        bool m_QuadClipScaleEnable; //0x0053
        bool m_QuadNiceRenderingEnable; //0x0054
        bool m_QuadGroupsJoinAll; //0x0055
        bool m_QuadGroupsJoinNone; //0x0056
        bool m_QuadGroupsJoinNiceAndSimple; //0x0057
        bool m_QuadEnableOpaque; //0x0058
        bool m_QuadVertexShadowsEnable; //0x0059
        bool m_QuadPointLightsEnable; //0x005A
        bool m_QuadSpotLightsEnable; //0x005B
        bool m_QuadEnableSorting; //0x005C
        bool m_MeshRenderingEnable; //0x005D
        bool m_MeshDrawTransforms; //0x005E
        bool m_MeshDrawBoundingBoxes; //0x005F
        bool m_MeshShadowEnable; //0x0060
        bool m_QuadEnableWireframe; //0x0061
        bool m_Enable; //0x0062
        bool m_QuadEnableZOcclusion; //0x0063
        bool m_MeshDrawCullStats; //0x0064
        char _0x0065[3];
    };//Size=0x0068
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01534
    // RuntimeId: 00104
    // TypeInfo:  0x023C2D44
#ifndef _GameDataContainer_
#define _GameDataContainer_
#pragma pack(push, 4)
    class GameDataContainer : public DataContainer
    {
    public:
        static __inline GameDataContainer* DefaultInstance()
        {
            return (GameDataContainer*)0xF882A8A8;
        }
        static __inline unsigned int ClassId()
        {
            return 1534;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C2D44;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02019
    // RuntimeId: 00086
    // TypeInfo:  0x023C2C44
#ifndef _Asset_
#define _Asset_
#pragma pack(push, 4)
    class Asset : public DataContainer
    {
    public:
        static __inline Asset* DefaultInstance()
        {
            return (Asset*)0xF883D498;
        }
        static __inline unsigned int ClassId()
        {
            return 2019;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C2C44;
        }
        char* m_Name; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00804
    // RuntimeId: 06497
    // TypeInfo:  0x02407504
#ifndef _EmitterTemplateData_
#define _EmitterTemplateData_
#pragma pack(push, 16)
    class EmitterTemplateData : public DataContainer
    {
    public:
        static __inline EmitterTemplateData* DefaultInstance()
        {
            return (EmitterTemplateData*)0xF87E6D90;
        }
        static __inline unsigned int ClassId()
        {
            return 804;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407504;
        }
        char _0x0008[8];
        Vec4 m_PointLightIntensity; //0x0010
        Vec3 m_PointLightPivot; //0x0020
        Vec3 m_PointLightColor; //0x0030
        unsigned __int32 m_MaxCount; //0x0040
        char* m_Name; //0x0044
        float m_TimeScale; //0x0048
        unsigned __int32 m_LifetimeFrameCount; //0x004C
        float m_Lifetime; //0x0050
        ProcessorData* m_RootProcessor; //0x0054
        float m_VisibleAfterDistance; //0x0058
        Array<float> m_ZOcclusionLookup; //0x005C
        EmittableType m_EmittableType; //0x0060
        MeshAsset* m_Mesh; //0x0064
        float m_DistanceScaleNearValue; //0x0068
        float m_PointLightRadius; //0x006C
        float m_VertexPixelLightingBlendFactor; //0x0070
        float m_GlobalLocalNormalBlendFactor; //0x0074
        float m_SoftParticlesFadeDistanceMultiplier; //0x0078
        float m_LightWrapAroundFactor; //0x007C
        float m_LightMultiplier; //0x0080
        float m_DistanceScaleFarValue; //0x0084
        float m_PointLightRandomIntensityMin; //0x0088
        float m_MeshCullingDistance; //0x008C
        float m_PointLightRandomIntensityMax; //0x0090
        float m_MaxSpawnDistance; //0x0094
        float m_MinScreenArea; //0x0098
        float m_DistanceScaleLength; //0x009C
        float m_PointLightMaxClamp; //0x00A0
        float m_ParticleCullingFactor; //0x00A4
        float m_PointLightMinClamp; //0x00A8
        bool m_FollowSpawnSource; //0x00AC
        bool m_RepeatParticleSpawning; //0x00AD
        bool m_Emissive; //0x00AE
        bool m_ExclusionVolumeCullEnable; //0x00AF
        bool m_TransparencySunShadowEnable; //0x00B0
        bool m_ForceFullRes; //0x00B1
        bool m_LocalSpace; //0x00B2
        bool m_Opaque; //0x00B3
        bool m_ActAsPointLight; //0x00B4
        bool m_KillParticlesWithEmitter; //0x00B5
        bool m_ForceNiceSorting; //0x00B6
        char _0x00B7[9];
    };//Size=0x00C0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00807
    // RuntimeId: 06529
    // TypeInfo:  0x0240778C
#ifndef _PolynomialColorInterpData_
#define _PolynomialColorInterpData_
#pragma pack(push, 16)
    class PolynomialColorInterpData : public EvaluatorData
    {
    public:
        static __inline PolynomialColorInterpData* DefaultInstance()
        {
            return (PolynomialColorInterpData*)0xF87E6EF0;
        }
        static __inline unsigned int ClassId()
        {
            return 807;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240778C;
        }
        char _0x000C[4];
        Vec3 m_Color0; //0x0010
        Vec3 m_Color1; //0x0020
        Vec4 m_Coefficients; //0x0030
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00818
    // RuntimeId: 06493
    // TypeInfo:  0x024074AC
#ifndef _ProcessorData_
#define _ProcessorData_
#pragma pack(push, 16)
    class ProcessorData : public EmitterComponentData
    {
    public:
        static __inline ProcessorData* DefaultInstance()
        {
            return (ProcessorData*)0xF881EB20;
        }
        static __inline unsigned int ClassId()
        {
            return 818;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024074AC;
        }
        char _0x0008[8];
        Vec4 m_DefaultValues; //0x0010
        ProcessorData* m_NextProcessor; //0x0020
        EmitterComponentData* m_Pre; //0x0024
        EmittableField m_EvaluatorInput; //0x0028
        bool m_Enable; //0x002C
        char _0x002D[3];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00808
    // RuntimeId: 06527
    // TypeInfo:  0x02407760
#ifndef _ConstantEvaluatorData_
#define _ConstantEvaluatorData_
#pragma pack(push, 4)
    class ConstantEvaluatorData : public EvaluatorData
    {
    public:
        static __inline ConstantEvaluatorData* DefaultInstance()
        {
            return (ConstantEvaluatorData*)0xF87E6F58;
        }
        static __inline unsigned int ClassId()
        {
            return 808;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407760;
        }
        float m_Scale; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02020
    // RuntimeId: 06479
    // TypeInfo:  0x02407404
#ifndef _EmitterSystemAsset_
#define _EmitterSystemAsset_
#pragma pack(push, 4)
    class EmitterSystemAsset : public Asset
    {
    public:
        static __inline EmitterSystemAsset* DefaultInstance()
        {
            return (EmitterSystemAsset*)0xF883D4B8;
        }
        static __inline unsigned int ClassId()
        {
            return 2020;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407404;
        }
        Array<EmitterTextureAtlasInfo> m_TextureInfos; //0x000C
        TextureAsset* m_BaseAtlasTexture; //0x0010
        TextureAsset* m_NormalAtlasTexture; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01540
    // RuntimeId: 00200
    // TypeInfo:  0x023C4F88
#ifndef _GameObjectData_
#define _GameObjectData_
#pragma pack(push, 4)
    class GameObjectData : public GameDataContainer
    {
    public:
        static __inline GameObjectData* DefaultInstance()
        {
            return (GameObjectData*)0xF882ACE0;
        }
        static __inline unsigned int ClassId()
        {
            return 1540;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C4F88;
        }
        unsigned __int16 m_IndexInBlueprint; //0x0008
        __int8 m_IsEventConnectionTarget; //0x000A
        __int8 m_IsPropertyConnectionTarget; //0x000B
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02021
    // RuntimeId: 06475
    // TypeInfo:  0x024073AC
#ifndef _EmitterAsset_
#define _EmitterAsset_
#pragma pack(push, 4)
    class EmitterAsset : public Asset
    {
    public:
        static __inline EmitterAsset* DefaultInstance()
        {
            return (EmitterAsset*)0xF883D4E8;
        }
        static __inline unsigned int ClassId()
        {
            return 2021;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024073AC;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00819
    // RuntimeId: 06471
    // TypeInfo:  0x02407370
#ifndef _UpdateLinearVelocityData_
#define _UpdateLinearVelocityData_
#pragma pack(push, 16)
    class UpdateLinearVelocityData : public ProcessorData
    {
    public:
        static __inline UpdateLinearVelocityData* DefaultInstance()
        {
            return (UpdateLinearVelocityData*)0xF881EB90;
        }
        static __inline unsigned int ClassId()
        {
            return 819;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407370;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00820
    // RuntimeId: 06469
    // TypeInfo:  0x02407344
#ifndef _UpdateOrientationData_
#define _UpdateOrientationData_
#pragma pack(push, 16)
    class UpdateOrientationData : public ProcessorData
    {
    public:
        static __inline UpdateOrientationData* DefaultInstance()
        {
            return (UpdateOrientationData*)0xF881EC00;
        }
        static __inline unsigned int ClassId()
        {
            return 820;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407344;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00821
    // RuntimeId: 06467
    // TypeInfo:  0x02407318
#ifndef _UpdateClipScaleData_
#define _UpdateClipScaleData_
#pragma pack(push, 16)
    class UpdateClipScaleData : public ProcessorData
    {
    public:
        static __inline UpdateClipScaleData* DefaultInstance()
        {
            return (UpdateClipScaleData*)0xF881EC70;
        }
        static __inline unsigned int ClassId()
        {
            return 821;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407318;
        }
        Array<__int16> m_Lookup; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00822
    // RuntimeId: 06465
    // TypeInfo:  0x024072EC
#ifndef _UpdateCameraProximityData_
#define _UpdateCameraProximityData_
#pragma pack(push, 16)
    class UpdateCameraProximityData : public ProcessorData
    {
    public:
        static __inline UpdateCameraProximityData* DefaultInstance()
        {
            return (UpdateCameraProximityData*)0xF881ECF0;
        }
        static __inline unsigned int ClassId()
        {
            return 822;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024072EC;
        }
        Vec3 m_Size; //0x0030
        float m_ForwardOffset; //0x0040
        char _0x0044[12];
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00823
    // RuntimeId: 06463
    // TypeInfo:  0x024072C0
#ifndef _UpdateAlphaLevelScaleData_
#define _UpdateAlphaLevelScaleData_
#pragma pack(push, 16)
    class UpdateAlphaLevelScaleData : public ProcessorData
    {
    public:
        static __inline UpdateAlphaLevelScaleData* DefaultInstance()
        {
            return (UpdateAlphaLevelScaleData*)0xF881ED80;
        }
        static __inline unsigned int ClassId()
        {
            return 823;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024072C0;
        }
        float m_Exponent; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00824
    // RuntimeId: 06461
    // TypeInfo:  0x02407294
#ifndef _UpdateAlphaLevelMaxData_
#define _UpdateAlphaLevelMaxData_
#pragma pack(push, 16)
    class UpdateAlphaLevelMaxData : public ProcessorData
    {
    public:
        static __inline UpdateAlphaLevelMaxData* DefaultInstance()
        {
            return (UpdateAlphaLevelMaxData*)0xF881EE00;
        }
        static __inline unsigned int ClassId()
        {
            return 824;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407294;
        }
        float m_MaxLevel; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00825
    // RuntimeId: 06459
    // TypeInfo:  0x02407268
#ifndef _UpdateAlphaLevelMinData_
#define _UpdateAlphaLevelMinData_
#pragma pack(push, 16)
    class UpdateAlphaLevelMinData : public ProcessorData
    {
    public:
        static __inline UpdateAlphaLevelMinData* DefaultInstance()
        {
            return (UpdateAlphaLevelMinData*)0xF881EE80;
        }
        static __inline unsigned int ClassId()
        {
            return 825;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407268;
        }
        float m_MinLevel; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00826
    // RuntimeId: 06457
    // TypeInfo:  0x0240723C
#ifndef _UpdateTransparencyData_
#define _UpdateTransparencyData_
#pragma pack(push, 16)
    class UpdateTransparencyData : public ProcessorData
    {
    public:
        static __inline UpdateTransparencyData* DefaultInstance()
        {
            return (UpdateTransparencyData*)0xF881EF00;
        }
        static __inline unsigned int ClassId()
        {
            return 826;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240723C;
        }
        float m_CullThreshold; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00827
    // RuntimeId: 06455
    // TypeInfo:  0x02407210
#ifndef _UpdateColorData_
#define _UpdateColorData_
#pragma pack(push, 16)
    class UpdateColorData : public ProcessorData
    {
    public:
        static __inline UpdateColorData* DefaultInstance()
        {
            return (UpdateColorData*)0xF881EF80;
        }
        static __inline unsigned int ClassId()
        {
            return 827;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407210;
        }
        Vec3 m_Color; //0x0030
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00828
    // RuntimeId: 06453
    // TypeInfo:  0x024071E4
#ifndef _UpdateSizeZData_
#define _UpdateSizeZData_
#pragma pack(push, 16)
    class UpdateSizeZData : public ProcessorData
    {
    public:
        static __inline UpdateSizeZData* DefaultInstance()
        {
            return (UpdateSizeZData*)0xF881F000;
        }
        static __inline unsigned int ClassId()
        {
            return 828;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024071E4;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00829
    // RuntimeId: 06451
    // TypeInfo:  0x024071B8
#ifndef _UpdateSizeYData_
#define _UpdateSizeYData_
#pragma pack(push, 16)
    class UpdateSizeYData : public ProcessorData
    {
    public:
        static __inline UpdateSizeYData* DefaultInstance()
        {
            return (UpdateSizeYData*)0xF881F070;
        }
        static __inline unsigned int ClassId()
        {
            return 829;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024071B8;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00830
    // RuntimeId: 06449
    // TypeInfo:  0x0240718C
#ifndef _UpdateSizeXData_
#define _UpdateSizeXData_
#pragma pack(push, 16)
    class UpdateSizeXData : public ProcessorData
    {
    public:
        static __inline UpdateSizeXData* DefaultInstance()
        {
            return (UpdateSizeXData*)0xF881F0E0;
        }
        static __inline unsigned int ClassId()
        {
            return 830;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240718C;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00831
    // RuntimeId: 06447
    // TypeInfo:  0x02407160
#ifndef _UpdateSizeData_
#define _UpdateSizeData_
#pragma pack(push, 16)
    class UpdateSizeData : public ProcessorData
    {
    public:
        static __inline UpdateSizeData* DefaultInstance()
        {
            return (UpdateSizeData*)0xF881F150;
        }
        static __inline unsigned int ClassId()
        {
            return 831;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407160;
        }
        Vec2 m_Pivot; //0x0030
        char _0x0038[8];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00832
    // RuntimeId: 06445
    // TypeInfo:  0x02407134
#ifndef _UpdateRotationData_
#define _UpdateRotationData_
#pragma pack(push, 16)
    class UpdateRotationData : public ProcessorData
    {
    public:
        static __inline UpdateRotationData* DefaultInstance()
        {
            return (UpdateRotationData*)0xF881F1D0;
        }
        static __inline unsigned int ClassId()
        {
            return 832;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407134;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00833
    // RuntimeId: 06443
    // TypeInfo:  0x02407108
#ifndef _UpdateTextureCoordsData_
#define _UpdateTextureCoordsData_
#pragma pack(push, 16)
    class UpdateTextureCoordsData : public ProcessorData
    {
    public:
        static __inline UpdateTextureCoordsData* DefaultInstance()
        {
            return (UpdateTextureCoordsData*)0xF881F240;
        }
        static __inline unsigned int ClassId()
        {
            return 833;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407108;
        }
        EmitterTextureInfo m_TextureInfo1; //0x0030
        float m_TextureBlendValue; //0x0044
        char _0x0048[8];
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00834
    // RuntimeId: 06439
    // TypeInfo:  0x024070CC
#ifndef _EmitterData_
#define _EmitterData_
#pragma pack(push, 16)
    class EmitterData : public ProcessorData
    {
    public:
        static __inline EmitterData* DefaultInstance()
        {
            return (EmitterData*)0xF881F2D0;
        }
        static __inline unsigned int ClassId()
        {
            return 834;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024070CC;
        }
        Array<EmitterDocument*> m_EmitterAssets; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00835
    // RuntimeId: 06437
    // TypeInfo:  0x024070A0
#ifndef _TurbulanceData_
#define _TurbulanceData_
#pragma pack(push, 16)
    class TurbulanceData : public ProcessorData
    {
    public:
        static __inline TurbulanceData* DefaultInstance()
        {
            return (TurbulanceData*)0xF881F350;
        }
        static __inline unsigned int ClassId()
        {
            return 835;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024070A0;
        }
        float m_Intensity; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00836
    // RuntimeId: 06435
    // TypeInfo:  0x02407074
#ifndef _AirResistanceData_
#define _AirResistanceData_
#pragma pack(push, 16)
    class AirResistanceData : public ProcessorData
    {
    public:
        static __inline AirResistanceData* DefaultInstance()
        {
            return (AirResistanceData*)0xF881F3D0;
        }
        static __inline unsigned int ClassId()
        {
            return 836;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407074;
        }
        float m_DragFactor; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00837
    // RuntimeId: 06433
    // TypeInfo:  0x02407048
#ifndef _LocalForceData_
#define _LocalForceData_
#pragma pack(push, 16)
    class LocalForceData : public ProcessorData
    {
    public:
        static __inline LocalForceData* DefaultInstance()
        {
            return (LocalForceData*)0xF881F450;
        }
        static __inline unsigned int ClassId()
        {
            return 837;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02407048;
        }
        Vec3 m_LocalForce; //0x0030
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00838
    // RuntimeId: 06431
    // TypeInfo:  0x0240701C
#ifndef _GravityData_
#define _GravityData_
#pragma pack(push, 16)
    class GravityData : public ProcessorData
    {
    public:
        static __inline GravityData* DefaultInstance()
        {
            return (GravityData*)0xF881F4D0;
        }
        static __inline unsigned int ClassId()
        {
            return 838;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240701C;
        }
        float m_Gravity; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00839
    // RuntimeId: 06429
    // TypeInfo:  0x02406FF0
#ifndef _UpdateAgeData_
#define _UpdateAgeData_
#pragma pack(push, 16)
    class UpdateAgeData : public ProcessorData
    {
    public:
        static __inline UpdateAgeData* DefaultInstance()
        {
            return (UpdateAgeData*)0xF881F550;
        }
        static __inline unsigned int ClassId()
        {
            return 839;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406FF0;
        }
        float m_Lifetime; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00840
    // RuntimeId: 06427
    // TypeInfo:  0x02406FC4
#ifndef _SpawnRotationSpeedData_
#define _SpawnRotationSpeedData_
#pragma pack(push, 16)
    class SpawnRotationSpeedData : public ProcessorData
    {
    public:
        static __inline SpawnRotationSpeedData* DefaultInstance()
        {
            return (SpawnRotationSpeedData*)0xF881F5D0;
        }
        static __inline unsigned int ClassId()
        {
            return 840;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406FC4;
        }
        float m_RotationSpeed; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00841
    // RuntimeId: 06425
    // TypeInfo:  0x02406F98
#ifndef _SpawnOrientationData_
#define _SpawnOrientationData_
#pragma pack(push, 16)
    class SpawnOrientationData : public ProcessorData
    {
    public:
        static __inline SpawnOrientationData* DefaultInstance()
        {
            return (SpawnOrientationData*)0xF881F650;
        }
        static __inline unsigned int ClassId()
        {
            return 841;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406F98;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00842
    // RuntimeId: 06423
    // TypeInfo:  0x02406F6C
#ifndef _SpawnRotationData_
#define _SpawnRotationData_
#pragma pack(push, 16)
    class SpawnRotationData : public ProcessorData
    {
    public:
        static __inline SpawnRotationData* DefaultInstance()
        {
            return (SpawnRotationData*)0xF881F6C0;
        }
        static __inline unsigned int ClassId()
        {
            return 842;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406F6C;
        }
        float m_Rotation; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00843
    // RuntimeId: 06421
    // TypeInfo:  0x02406F40
#ifndef _SpawnAnimationFrameData_
#define _SpawnAnimationFrameData_
#pragma pack(push, 16)
    class SpawnAnimationFrameData : public ProcessorData
    {
    public:
        static __inline SpawnAnimationFrameData* DefaultInstance()
        {
            return (SpawnAnimationFrameData*)0xF881F740;
        }
        static __inline unsigned int ClassId()
        {
            return 843;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406F40;
        }
        unsigned __int32 m_AnimationFrame; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00844
    // RuntimeId: 06419
    // TypeInfo:  0x02406F14
#ifndef _SpawnAnimationData_
#define _SpawnAnimationData_
#pragma pack(push, 16)
    class SpawnAnimationData : public ProcessorData
    {
    public:
        static __inline SpawnAnimationData* DefaultInstance()
        {
            return (SpawnAnimationData*)0xF881F7C0;
        }
        static __inline unsigned int ClassId()
        {
            return 844;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406F14;
        }
        float m_AnimationSpeed; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00845
    // RuntimeId: 06417
    // TypeInfo:  0x02406EE8
#ifndef _SpawnPositionData_
#define _SpawnPositionData_
#pragma pack(push, 16)
    class SpawnPositionData : public ProcessorData
    {
    public:
        static __inline SpawnPositionData* DefaultInstance()
        {
            return (SpawnPositionData*)0xF881F840;
        }
        static __inline unsigned int ClassId()
        {
            return 845;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406EE8;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00846
    // RuntimeId: 06415
    // TypeInfo:  0x02406EBC
#ifndef _SpawnSizeData_
#define _SpawnSizeData_
#pragma pack(push, 16)
    class SpawnSizeData : public ProcessorData
    {
    public:
        static __inline SpawnSizeData* DefaultInstance()
        {
            return (SpawnSizeData*)0xF881F8B0;
        }
        static __inline unsigned int ClassId()
        {
            return 846;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406EBC;
        }
        float m_Size; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00847
    // RuntimeId: 06413
    // TypeInfo:  0x02406E90
#ifndef _SpawnSpeedData_
#define _SpawnSpeedData_
#pragma pack(push, 16)
    class SpawnSpeedData : public ProcessorData
    {
    public:
        static __inline SpawnSpeedData* DefaultInstance()
        {
            return (SpawnSpeedData*)0xF881F930;
        }
        static __inline unsigned int ClassId()
        {
            return 847;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406E90;
        }
        float m_Speed; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00848
    // RuntimeId: 06411
    // TypeInfo:  0x02406E64
#ifndef _SpawnDirectionData_
#define _SpawnDirectionData_
#pragma pack(push, 16)
    class SpawnDirectionData : public ProcessorData
    {
    public:
        static __inline SpawnDirectionData* DefaultInstance()
        {
            return (SpawnDirectionData*)0xF881F9B0;
        }
        static __inline unsigned int ClassId()
        {
            return 848;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406E64;
        }
        float m_DirectionFromEmitterOrigin; //0x0030
        bool m_InheritSpeedAndDirectionFromEmitter; //0x0034
        char _0x0035[11];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00849
    // RuntimeId: 06409
    // TypeInfo:  0x02406E38
#ifndef _SpawnRateData_
#define _SpawnRateData_
#pragma pack(push, 16)
    class SpawnRateData : public ProcessorData
    {
    public:
        static __inline SpawnRateData* DefaultInstance()
        {
            return (SpawnRateData*)0xF881FA30;
        }
        static __inline unsigned int ClassId()
        {
            return 849;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406E38;
        }
        float m_SpawnRate; //0x0030
        float m_TrailSegmentLength; //0x0034
        bool m_DistributeOverTime; //0x0038
        bool m_DistributeOverDistance; //0x0039
        char _0x003A[6];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00850
    // RuntimeId: 06407
    // TypeInfo:  0x02406E0C
#ifndef _BaseEmitterData_
#define _BaseEmitterData_
#pragma pack(push, 16)
    class BaseEmitterData : public ProcessorData
    {
    public:
        static __inline BaseEmitterData* DefaultInstance()
        {
            return (BaseEmitterData*)0xF881FAB0;
        }
        static __inline unsigned int ClassId()
        {
            return 850;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406E0C;
        }
        EmitterDocument* m_EmitterAsset; //0x0030
        char _0x0034[12];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00851
    // RuntimeId: 06405
    // TypeInfo:  0x0240627C
#ifndef _WorldRenderSettings_
#define _WorldRenderSettings_
#pragma pack(push, 16)
    class WorldRenderSettings : public DataContainer
    {
    public:
        static __inline WorldRenderSettings* DefaultInstance()
        {
            return (WorldRenderSettings*)0xF881FB30;
        }
        static __inline unsigned int ClassId()
        {
            return 851;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240627C;
        }
        char _0x0008[8];
        Vec3 m_DynamicEnvmapDefaultPosition; //0x0010
        Vec3 m_SubSurfaceColor; //0x0020
        float m_ViewportScale; //0x0030
        float m_ShadowMinScreenArea; //0x0034
        float m_ShadowViewportScale; //0x0038
        unsigned __int32 m_FxaaQuality; //0x003C
        float m_CullScreenAreaScale; //0x0040
        float m_PlanarReflectionCullFOV; //0x0044
        unsigned __int32 m_GenericEntityMaxVisibleEntityCount; //0x0048
        float m_ShadowmapSizeZScale; //0x004C
        unsigned __int32 m_ShadowmapResolution; //0x0050
        unsigned __int32 m_ShadowmapQuality; //0x0054
        float m_ShadowmapPoissonFilterScale; //0x0058
        unsigned __int32 m_ShadowmapSliceCount; //0x005C
        float m_ShadowmapSliceSchemeWeight; //0x0060
        float m_ShadowmapFirstSliceScale; //0x0064
        float m_ShadowmapViewDistance; //0x0068
        unsigned __int32 m_PlanarReflectionWidth; //0x006C
        float m_ShadowmapExtrusionLength; //0x0070
        float m_ShadowmapMinScreenArea; //0x0074
        float m_TempPlanarReflectionY; //0x0078
        float m_SubSurfaceRolloffKeyLight; //0x007C
        __int32 m_FxaaForceVendor; //0x0080
        unsigned __int32 m_PlanarReflectionHeight; //0x0084
        float m_LightIntensityScale; //0x0088
        float m_LightLodSpecularFadeAreaEnd; //0x008C
        float m_ShadowmapMinFov; //0x0090
        float m_LightLodSpecularFadeAreaStart; //0x0094
        float m_LightLodRadiusFactor; //0x0098
        float m_LightForceIntensity; //0x009C
        float m_LightLodFadeArea; //0x00A0
        float m_LightLodMinArea; //0x00A4
        __int32 m_DrawDebugDynamicEnvmapMipLevel; //0x00A8
        unsigned __int32 m_MaxDecalVolumeCount; //0x00AC
        float m_MotionBlurScale; //0x00B0
        float m_MotionBlurMax; //0x00B4
        float m_MotionBlurNoiseScale; //0x00B8
        unsigned __int32 m_MotionBlurQuality; //0x00BC
        unsigned __int32 m_MaxSpotLightShadowCount; //0x00C0
        MipmapFilterMode m_DynamicEnvmapFilterMode; //0x00C4
        unsigned __int32 m_MotionBlurMaxSampleCount; //0x00C8
        unsigned __int32 m_MotionBlurFrameAverageCount; //0x00CC
        float m_MotionBlurMaxFrameTime; //0x00D0
        float m_ForceMotionBlurDepthCutoff; //0x00D4
        float m_ForceMotionBlurCutoffGradientScale; //0x00D8
        unsigned __int32 m_MultisampleCount; //0x00DC
        float m_MultisampleThreshold; //0x00E0
        unsigned __int32 m_MaxPointLightCount; //0x00E4
        unsigned __int32 m_ReflectionEnvmapSize; //0x00E8
        float m_SpotLightNearPlane; //0x00EC
        float m_SpotLightShadowmapPoissonFilterScale; //0x00F0
        __int32 m_OnlyShadowmapSlice; //0x00F4
        WorldViewMode m_ViewMode; //0x00F8
        unsigned __int32 m_SpotLightShadowmapResolution; //0x00FC
        QualityLevel m_SpotLightShadomapLevel; //0x0100
        unsigned __int32 m_SpotLightShadowmapQuality; //0x0104
        __int32 m_OnlyLightTileY; //0x0108
        __int32 m_OnlyLightTileX; //0x010C
        float m_XenonHdrColorScale; //0x0110
        float m_XenonHdrColorScaleFactor; //0x0114
        unsigned __int32 m_Ps3LightTileJobMaxFbTileCount; //0x0118
        __int32 m_OnlyLightTileIndex; //0x011C
        unsigned __int32 m_Ps3LightTileJobCount; //0x0120
        unsigned __int32 m_Ps3LightTileJobPriority; //0x0124
        unsigned __int32 m_XenonLightTileMaxLineLightCount; //0x0128
        unsigned __int32 m_XenonLightTileMaxSpotLightCount; //0x012C
        unsigned __int32 m_XenonLightTileConstantBufferSize; //0x0130
        unsigned __int32 m_XenonLightTileMaxPointLightCount; //0x0134
        unsigned __int32 m_MaxDestructionVolumeCount; //0x0138
        float m_DynamicEnvmapFilterWidth; //0x013C
        float m_LightTileMinArea; //0x0140
        unsigned __int32 m_DynamicEnvmapResolution; //0x0144
        ShaderGBufferLayout m_GBufferLayout; //0x0148
        __int32 m_DrawDebugSkyEnvmapMipLevel; //0x014C
        float m_DecalVolumeScale; //0x0150
        unsigned __int32 m_LightOverdrawMaxLayerCount; //0x0154
        float m_LightRadiusScale; //0x0158
        float m_LightAttenuationThreshold; //0x015C
        unsigned __int32 m_Ps3LightTileMethod; //0x0160
        float m_Ps3LightTileJobYieldGranularity; //0x0164
        unsigned __int32 m_OutdoorLightTileBatchCount; //0x0168
        unsigned __int32 m_XenonDrawDebugLightTileGridMode; //0x016C
        float m_LightStencilMinArea; //0x0170
        unsigned __int32 m_MaxSpotLightCount; //0x0174
        MipmapFilterMode m_SkyEnvmapFilterMode; //0x0178
        float m_SkyEnvmapFilterWidth; //0x017C
        unsigned __int32 m_GBufferTestCount; //0x0180
        unsigned __int32 m_SkyEnvmapResolution; //0x0184
        unsigned __int32 m_SkyEnvmapSidesPerFrameCount; //0x0188
        float m_SubSurfaceRolloffLocalLight; //0x018C
        __int32 m_OnlyTileIndex; //0x0190
        bool m_OccluderMeshZPrepassEnable; //0x0194
        bool m_OccluderMeshZPrepassDebugEnable; //0x0195
        bool m_WireframeEnable; //0x0196
        bool m_HalfResEnable; //0x0197
        bool m_HalfResLensFlaresEnable; //0x0198
        bool m_ZPassEnable; //0x0199
        bool m_ForegroundEnable; //0x019A
        bool m_TiledHalfResCompositeEnable; //0x019B
        bool m_ForegroundZPassEnable; //0x019C
        bool m_DrawDebugVelocityBuffer; //0x019D
        bool m_ForegroundDepthClearEnable; //0x019E
        bool m_ForegroundAsMainEnable; //0x019F
        bool m_CustomEnvmapEnable; //0x01A0
        bool m_SkyEnvmapEnable; //0x01A1
        bool m_DrawDebugVisibleEntityTypes; //0x01A2
        bool m_DrawDebugHalfResEnvironment; //0x01A3
        bool m_DrawSolidBoundingBoxes; //0x01A4
        bool m_BilateralHalfResCompositeEnable; //0x01A5
        bool m_ForegroundTransparentEnable; //0x01A6
        bool m_TiledHalfResStencilOccludersEnable; //0x01A7
        bool m_SkyEnvmapUpdateEnable; //0x01A8
        bool m_SkyEnvmapForceUpdateEnable; //0x01A9
        bool m_SkyEnvmapUse8BitTexture; //0x01AA
        bool m_DynamicEnvmapEnable; //0x01AB
        bool m_ScreenEffectEnable; //0x01AC
        bool m_DrawDebugZBufferEnable; //0x01AD
        bool m_MotionBlurStencilPassEnable; //0x01AE
        bool m_FinalPostEnable; //0x01AF
        bool m_DrawDebugQuarterShadowmaps; //0x01B0
        bool m_DrawDebugSkyEnvmap; //0x01B1
        bool m_DxShadowmap16BitEnable; //0x01B2
        bool m_DrawDebugTransShadowmap; //0x01B3
        bool m_DrawDebugSpotLightShadowmaps; //0x01B4
        bool m_DrawShadowFrustums; //0x01B5
        bool m_DrawDebugShadowmaps; //0x01B6
        bool m_SkyEnable; //0x01B7
        bool m_DrawBoundingSpheres; //0x01B8
        bool m_DrawFrustums; //0x01B9
        bool m_StaticEnvmapEnable; //0x01BA
        bool m_SkyFogEnable; //0x01BB
        bool m_DrawLineBoundingBoxes; //0x01BC
        bool m_DrawDebugDestructionVolumes; //0x01BD
        bool m_LensFlaresEnable; //0x01BE
        bool m_DrawDebugLensFlareOccluders; //0x01BF
        bool m_DrawDebugLensFlares; //0x01C0
        bool m_LensFlareOcclusionEnable; //0x01C1
        bool m_DrawDebugWorldOcclusions; //0x01C2
        bool m_CloudShadowEnable; //0x01C3
        bool m_OverrideDynamicAO; //0x01C4
        bool m_DrawDebugDynamicAO; //0x01C5
        bool m_EmissiveEnable; //0x01C6
        bool m_UnlitEnable; //0x01C7
        bool m_SkyEnvmapMipmapGenEnable; //0x01C8
        bool m_DrawLightSources; //0x01C9
        bool m_GBufferClearEnable; //0x01CA
        bool m_DxGBufferLight16BitEnable; //0x01CB
        bool m_DxGBufferNormal16BitEnable; //0x01CC
        bool m_GBufferAlphaTestSimpleEnable; //0x01CD
        bool m_SpecularLightingEnable; //0x01CE
        bool m_SkinLightingEnable; //0x01CF
        bool m_TranslucencyLightingEnable; //0x01D0
        bool m_DynamicEnvmapLightingEnable; //0x01D1
        bool m_OutdoorLightEnable; //0x01D2
        bool m_PointLightsEnable; //0x01D3
        bool m_LineLightsEnable; //0x01D4
        bool m_ConeLightsEnable; //0x01D5
        bool m_SpotLightsEnable; //0x01D6
        bool m_LightProbesEnable; //0x01D7
        bool m_LightStencilMethodEnable; //0x01D8
        bool m_LightVolumeMethodEnable; //0x01D9
        bool m_LightVolumeDepthTestEnable; //0x01DA
        bool m_OutputGammaCorrectionEnable; //0x01DB
        bool m_DrawDebugMultisampleClassify; //0x01DC
        bool m_OutdoorKeyLightEnable; //0x01DD
        bool m_OutdoorSkyLightEnable; //0x01DE
        bool m_OutdoorLightSpecularEnable; //0x01DF
        bool m_OutdoorLightTilingEnable; //0x01E0
        bool m_OutdoorLightTileRenderEnable; //0x01E1
        bool m_OutdoorLightTileBlendEnable; //0x01E2
        bool m_OutdoorLightTileSimpleShaderEnable; //0x01E3
        bool m_Ps3TiledHalfTargetEnable; //0x01E4
        bool m_XenonOutdoorLightTilingEnable; //0x01E5
        bool m_XenonPointLightsTilingEnable; //0x01E6
        bool m_XenonSpotLightsTilingEnable; //0x01E7
        bool m_XenonLineLightsTilingEnable; //0x01E8
        bool m_XenonAsyncLightJobsEnable; //0x01E9
        bool m_XenonLightTileDownsampleSpecularCheckEnable; //0x01EA
        bool m_XenonLightTileCpuPointLightCullingEnable; //0x01EB
        bool m_Ps3TiledSSAOTargetsEnable; //0x01EC
        bool m_Ps3SCullEnable; //0x01ED
        bool m_Ps3ColorCompressionEnable; //0x01EE
        bool m_Enable; //0x01EF
        bool m_Ps3TilingEnable; //0x01F0
        bool m_Ps3DepthBoundsLightCullingEnable; //0x01F1
        bool m_Ps3ZCullEnable; //0x01F2
        bool m_ConsoleRenderTargetPoolSharingEnable; //0x01F3
        bool m_XenonFloatDepthBufferEnable; //0x01F4
        bool m_Ps3LightTileJobYieldEnable; //0x01F5
        bool m_Ps3HdrClearEnable; //0x01F6
        bool m_XenonFastHdrEnable; //0x01F7
        bool m_ShadowmapViewDistanceScaleEnable; //0x01F8
        bool m_Ps3RenderTargetPoolGBufferOffsetEnable; //0x01F9
        bool m_HdrEnable; //0x01FA
        bool m_SpotLightShadowmapEnable; //0x01FB
        bool m_SimpleShadowmapsEnable; //0x01FC
        bool m_DrawTransparent; //0x01FD
        bool m_DrawTransparentDecal; //0x01FE
        bool m_ShadowmapFixedDepthEnable; //0x01FF
        bool m_DrawDebugDynamicEnvmap; //0x0200
        bool m_MotionBlurGeometryPassEnable; //0x0201
        bool m_DxLinearDepth32BitFormatEnable; //0x0202
        bool m_DynamicEnvmapMipmapGenEnable; //0x0203
        bool m_MotionBlurEnable; //0x0204
        bool m_ColoredShadowmapSlicesEnable; //0x0205
        bool m_DxDeferredCsPathEnable; //0x0206
        bool m_DrawDebugGBuffer; //0x0207
        bool m_DrawDebugLightSources; //0x0208
        bool m_DrawDebugLightShadowSources; //0x0209
        bool m_DrawDebugLightStats; //0x020A
        bool m_DrawDebugLightTiles; //0x020B
        bool m_DrawDebugLightTileVolumes; //0x020C
        bool m_DrawDebugLightTileFbGrid; //0x020D
        bool m_DrawDebugLightTileGrid; //0x020E
        bool m_DrawDebugLightTileSources; //0x020F
        bool m_ApplyShadowmapsEnable; //0x0210
        bool m_GenerateShadowmapsEnable; //0x0211
        bool m_DxSpotLightShadowmap16BitEnable; //0x0212
        bool m_Ps3Shadowmap16BitEnable; //0x0213
        bool m_Ps3SpotLightShadowmap16BitEnable; //0x0214
        bool m_GenericEntityRendererEnable; //0x0215
        bool m_SetupJobEnable; //0x0216
        bool m_ShadowmapAccumBilinearEnable; //0x0217
        bool m_LightWidthEnable; //0x0218
        bool m_LightIntensityNormalizationEnable; //0x0219
        bool m_LightCullEnable; //0x021A
        bool m_LightDepthCullEnable; //0x021B
        bool m_LightNormalCullEnable; //0x021C
        bool m_LightConeCullEnable; //0x021D
        bool m_LightTileOverlayEnable; //0x021E
        bool m_Ps3ShadowmapTilingEnable; //0x021F
        bool m_LightAttenuationThresholdEnable; //0x0220
        bool m_SkyVisibilityEnvmapScalingEnable; //0x0221
        bool m_ZBufferShadowTestEnable; //0x0222
        bool m_ShadowmapsEnable; //0x0223
        bool m_ShadowmapAccumEnable; //0x0224
        bool m_ShadowmapCullVolumeEnable; //0x0225
        bool m_OpaqueSortBySolutionEnable; //0x0226
        bool m_MainOpaqueZPassEnable; //0x0227
        bool m_DrawDebugDecalVolumes; //0x0228
        bool m_PlanarReflectionEnable; //0x0229
        bool m_TransparencyShadowmapsEnable; //0x022A
        bool m_DynamicCullDrawOccludedBoxesEnable; //0x022B
        bool m_PlanarReflectionBlur; //0x022C
        bool m_DrawDebugPlanarReflectionCullFrustum; //0x022D
        bool m_FreezePlanarReflectionCullFrustum; //0x022E
        bool m_PlanarReflectionDebugCullMode; //0x022F
        bool m_ShadowmapFixedMovementEnable; //0x0230
        bool m_DecalVolumeEnable; //0x0231
        bool m_DrawDebugPlanarReflection; //0x0232
        bool m_FxaaEnable; //0x0233
        bool m_DynamicCullSpuJobEnable; //0x0234
        bool m_DynamicCullZBufferTestEnable; //0x0235
        bool m_ViewFxEnable; //0x0236
        char _0x0237[9];
    };//Size=0x0240
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00852
    // RuntimeId: 06399
    // TypeInfo:  0x02406230
#ifndef _VisualEnvironmentSettings_
#define _VisualEnvironmentSettings_
#pragma pack(push, 4)
    class VisualEnvironmentSettings : public DataContainer
    {
    public:
        static __inline VisualEnvironmentSettings* DefaultInstance()
        {
            return (VisualEnvironmentSettings*)0xF881FD98;
        }
        static __inline unsigned int ClassId()
        {
            return 852;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406230;
        }
        float m_SunRotationX; //0x0008
        float m_SunRotationY; //0x000C
        bool m_DrawStats; //0x0010
        char _0x0011[3];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00853
    // RuntimeId: 06397
    // TypeInfo:  0x02406204
#ifndef _SunFlareEffectState_
#define _SunFlareEffectState_
#pragma pack(push, 16)
    class SunFlareEffectState : public DataContainer
    {
    public:
        static __inline SunFlareEffectState* DefaultInstance()
        {
            return (SunFlareEffectState*)0xF881FDC0;
        }
        static __inline unsigned int ClassId()
        {
            return 853;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406204;
        }
        char _0x0008[8];
        Vec4 m_Element5AlphaScreenPosCurve; //0x0010
        Vec4 m_Element5AlphaOccluderCurve; //0x0020
        Vec4 m_Element2SizeScreenPosCurve; //0x0030
        Vec4 m_Element5SizeScreenPosCurve; //0x0040
        Vec4 m_Element2AlphaOccluderCurve; //0x0050
        Vec4 m_Element2AlphaScreenPosCurve; //0x0060
        Vec2 m_Element1Size; //0x0070
        char _0x0078[8];
        Vec4 m_Element1SizeOccluderCurve; //0x0080
        Vec4 m_Element1SizeScreenPosCurve; //0x0090
        Vec4 m_Element1AlphaOccluderCurve; //0x00A0
        Vec4 m_Element1AlphaScreenPosCurve; //0x00B0
        Vec4 m_Element5SizeOccluderCurve; //0x00C0
        Vec4 m_Element4SizeScreenPosCurve; //0x00D0
        Vec2 m_Element3Size; //0x00E0
        Vec2 m_Element2Size; //0x00E8
        Vec4 m_Element2SizeOccluderCurve; //0x00F0
        Vec4 m_Element4AlphaScreenPosCurve; //0x0100
        Vec4 m_Element3SizeOccluderCurve; //0x0110
        Vec2 m_Element4Size; //0x0120
        Vec2 m_Element5Size; //0x0128
        Vec4 m_Element3SizeScreenPosCurve; //0x0130
        Vec4 m_Element3AlphaOccluderCurve; //0x0140
        Vec4 m_Element4SizeOccluderCurve; //0x0150
        Vec4 m_Element3AlphaScreenPosCurve; //0x0160
        Vec4 m_Element4AlphaOccluderCurve; //0x0170
        SurfaceShaderBaseAsset* m_Element3Shader; //0x0180
        SurfaceShaderBaseAsset* m_Element2Shader; //0x0184
        float m_OccluderSize; //0x0188
        SurfaceShaderBaseAsset* m_Element4Shader; //0x018C
        float m_Element4RayDistance; //0x0190
        SurfaceShaderBaseAsset* m_Element1Shader; //0x0194
        float m_Element2RayDistance; //0x0198
        float m_Element1RayDistance; //0x019C
        float m_Element5RayDistance; //0x01A0
        float m_Element3RayDistance; //0x01A4
        SurfaceShaderBaseAsset* m_Element5Shader; //0x01A8
        bool m_Element5Enable; //0x01AC
        bool m_Element4Enable; //0x01AD
        bool m_Element3Enable; //0x01AE
        bool m_Element2Enable; //0x01AF
        bool m_Element1Enable; //0x01B0
        bool m_DebugDrawOccluder; //0x01B1
        bool m_Enable; //0x01B2
        char _0x01B3[13];
    };//Size=0x01C0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00854
    // RuntimeId: 06395
    // TypeInfo:  0x024061D8
#ifndef _SkyEffectState_
#define _SkyEffectState_
#pragma pack(push, 16)
    class SkyEffectState : public DataContainer
    {
    public:
        static __inline SkyEffectState* DefaultInstance()
        {
            return (SkyEffectState*)0xF881FFB0;
        }
        static __inline unsigned int ClassId()
        {
            return 854;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024061D8;
        }
        char _0x0008[8];
        Vec3 m_CloudLayerSunColor; //0x0010
        float m_PanoramicTileFactor; //0x0020
        float m_SunSize; //0x0024
        float m_SkyGradientScale; //0x0028
        float m_SunScale; //0x002C
        float m_PanoramicUVMinX; //0x0030
        TextureAsset* m_SkyGradientTexture; //0x0034
        float m_PanoramicUVMinY; //0x0038
        float m_PanoramicUVMaxY; //0x003C
        float m_PanoramicUVMaxX; //0x0040
        float m_PanoramicRotation; //0x0044
        TextureAsset* m_PanoramicTexture; //0x0048
        TextureAsset* m_PanoramicAlphaTexture; //0x004C
        float m_WindDirection; //0x0050
        TextureAsset* m_CloudLayerMaskTexture; //0x0054
        char _0x0058[8];
        SkyCloudLayer m_CloudLayer1; //0x0060
        SkyCloudLayer m_CloudLayer2; //0x00A0
        TextureAsset* m_StaticEnvmapTexture; //0x00E0
        bool m_Enable; //0x00E4
        char _0x00E5[11];
    };//Size=0x00F0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00855
    // RuntimeId: 06391
    // TypeInfo:  0x0240619C
#ifndef _FogEffectState_
#define _FogEffectState_
#pragma pack(push, 16)
    class FogEffectState : public DataContainer
    {
    public:
        static __inline FogEffectState* DefaultInstance()
        {
            return (FogEffectState*)0xF88200E0;
        }
        static __inline unsigned int ClassId()
        {
            return 855;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240619C;
        }
        char _0x0008[8];
        Vec4 m_FogColorCurve; //0x0010
        Vec4 m_Curve; //0x0020
        Vec3 m_FogColor; //0x0030
        float m_Start; //0x0040
        float m_End; //0x0044
        float m_FogColorStart; //0x0048
        float m_FogColorEnd; //0x004C
        float m_HeightFogVisibilityRange; //0x0050
        float m_TransparencyFadeStart; //0x0054
        float m_TransparencyFadeEnd; //0x0058
        float m_TransparencyFadeClamp; //0x005C
        float m_HeightFogDepth; //0x0060
        float m_HeightFogFollowCamera; //0x0064
        float m_HeightFogAltitude; //0x0068
        bool m_HeightFogEnable; //0x006C
        bool m_Enable; //0x006D
        char _0x006E[2];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00856
    // RuntimeId: 06389
    // TypeInfo:  0x02406170
#ifndef _OutdoorLightEffectState_
#define _OutdoorLightEffectState_
#pragma pack(push, 16)
    class OutdoorLightEffectState : public DataContainer
    {
    public:
        static __inline OutdoorLightEffectState* DefaultInstance()
        {
            return (OutdoorLightEffectState*)0xF8820190;
        }
        static __inline unsigned int ClassId()
        {
            return 856;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406170;
        }
        char _0x0008[8];
        Vec3 m_SkyColor; //0x0010
        Vec3 m_GroundColor; //0x0020
        Vec3 m_SunColor; //0x0030
        Vec2 m_CloudShadowSpeed; //0x0040
        float m_SunRotationX; //0x0048
        float m_SunRotationY; //0x004C
        float m_SkyLightAngleFactor; //0x0050
        float m_SunShadowHeightScale; //0x0054
        TextureAsset* m_CloudShadowTexture; //0x0058
        float m_CloudShadowSize; //0x005C
        float m_CloudShadowExponent; //0x0060
        float m_CloudShadowCoverage; //0x0064
        bool m_CloudShadowEnable; //0x0068
        bool m_Enable; //0x0069
        char _0x006A[6];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01577
    // RuntimeId: 00214
    // TypeInfo:  0x023C5084
#ifndef _ComponentData_
#define _ComponentData_
#pragma pack(push, 16)
    class ComponentData : public GameObjectData
    {
    public:
        static __inline ComponentData* DefaultInstance()
        {
            return (ComponentData*)0xF882C120;
        }
        static __inline unsigned int ClassId()
        {
            return 1577;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C5084;
        }
        char _0x000C[4];
        LinearTransform m_Transform; //0x0010
        Array<GameObjectData*> m_Components; //0x0050
        bool m_Excluded; //0x0054
        char _0x0055[11];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01579
    // RuntimeId: 06385
    // TypeInfo:  0x02406118
#ifndef _CharacterLightingComponentData_
#define _CharacterLightingComponentData_
#pragma pack(push, 16)
    class CharacterLightingComponentData : public ComponentData
    {
    public:
        static __inline CharacterLightingComponentData* DefaultInstance()
        {
            return (CharacterLightingComponentData*)0xF882C270;
        }
        static __inline unsigned int ClassId()
        {
            return 1579;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406118;
        }
        Vec3 m_BottomLight; //0x0060
        Vec3 m_TopLight; //0x0070
        CharacterLightingMode m_CharacterLightingMode; //0x0080
        float m_CameraUpRotation; //0x0084
        float m_TopLightDirY; //0x0088
        float m_BlendFactor; //0x008C
        float m_TopLightDirX; //0x0090
        bool m_LockToCameraDirection; //0x0094
        bool m_FirstPersonEnable; //0x0095
        bool m_CharacterLightEnable; //0x0096
        char _0x0097[9];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01580
    // RuntimeId: 06381
    // TypeInfo:  0x024060DC
#ifndef _DamageEffectComponentData_
#define _DamageEffectComponentData_
#pragma pack(push, 16)
    class DamageEffectComponentData : public ComponentData
    {
    public:
        static __inline DamageEffectComponentData* DefaultInstance()
        {
            return (DamageEffectComponentData*)0xF882C350;
        }
        static __inline unsigned int ClassId()
        {
            return 1580;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024060DC;
        }
        Vec4 m_RightDamage; //0x0060
        Vec4 m_TopDamage; //0x0070
        Vec4 m_LeftDamage; //0x0080
        Vec4 m_BottomDamage; //0x0090
        float m_OuterFrameOpacity; //0x00A0
        float m_InnerFrameOpacity; //0x00A4
        float m_FrameWidth; //0x00A8
        SurfaceShaderBaseAsset* m_Shader; //0x00AC
        float m_StartCriticalEffectHealthThreshold; //0x00B0
        float m_EndCriticalEffectHealthThreshold; //0x00B4
        float m_MinDamagePercentageThreshold; //0x00B8
        float m_FallofTime; //0x00BC
        float m_MaxOpacityDamagePercentage; //0x00C0
        Realm m_Realm; //0x00C4
        bool m_DebugDamage; //0x00C8
        char _0x00C9[7];
    };//Size=0x00D0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01581
    // RuntimeId: 06379
    // TypeInfo:  0x024060B0
#ifndef _ScreenEffectComponentData_
#define _ScreenEffectComponentData_
#pragma pack(push, 16)
    class ScreenEffectComponentData : public ComponentData
    {
    public:
        static __inline ScreenEffectComponentData* DefaultInstance()
        {
            return (ScreenEffectComponentData*)0xF882C460;
        }
        static __inline unsigned int ClassId()
        {
            return 1581;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024060B0;
        }
        Vec4 m_ScreenEffectParams; //0x0060
        ScreenEffectFrameType m_FrameType; //0x0070
        SurfaceShaderBaseAsset* m_Shader; //0x0074
        float m_FrameWidth; //0x0078
        float m_OuterFrameOpacity; //0x007C
        float m_InnerFrameOpacity; //0x0080
        float m_Angle; //0x0084
        Realm m_Realm; //0x0088
        char _0x008C[4];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01582
    // RuntimeId: 06375
    // TypeInfo:  0x02406074
#ifndef _CameraParamsComponentData_
#define _CameraParamsComponentData_
#pragma pack(push, 16)
    class CameraParamsComponentData : public ComponentData
    {
    public:
        static __inline CameraParamsComponentData* DefaultInstance()
        {
            return (CameraParamsComponentData*)0xF882C530;
        }
        static __inline unsigned int ClassId()
        {
            return 1582;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406074;
        }
        float m_ViewDistance; //0x0060
        float m_NearPlane; //0x0064
        float m_SunShadowmapViewDistance; //0x0068
        char _0x006C[4];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01583
    // RuntimeId: 06373
    // TypeInfo:  0x02406048
#ifndef _ShaderParamsComponentData_
#define _ShaderParamsComponentData_
#pragma pack(push, 16)
    class ShaderParamsComponentData : public ComponentData
    {
    public:
        static __inline ShaderParamsComponentData* DefaultInstance()
        {
            return (ShaderParamsComponentData*)0xF882C5E0;
        }
        static __inline unsigned int ClassId()
        {
            return 1583;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02406048;
        }
        Vec4 m_Value; //0x0060
        char* m_ParameterName; //0x0070
        char _0x0074[12];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01584
    // RuntimeId: 06371
    // TypeInfo:  0x0240601C
#ifndef _EnlightenComponentData_
#define _EnlightenComponentData_
#pragma pack(push, 16)
    class EnlightenComponentData : public ComponentData
    {
    public:
        static __inline EnlightenComponentData* DefaultInstance()
        {
            return (EnlightenComponentData*)0xF882C6A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1584;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240601C;
        }
        Vec3 m_SkyBoxSkyColor; //0x0060
        Vec3 m_SkyBoxBackLightColor; //0x0070
        Vec3 m_SkyBoxGroundColor; //0x0080
        Vec3 m_TerrainColor; //0x0090
        Vec3 m_SkyBoxSunLightColor; //0x00A0
        float m_BounceScale; //0x00B0
        float m_CullDistance; //0x00B4
        float m_SunScale; //0x00B8
        Realm m_Realm; //0x00BC
        float m_SkyBoxBackLightRotationY; //0x00C0
        float m_SkyBoxSunLightColorSize; //0x00C4
        float m_SkyBoxBackLightColorSize; //0x00C8
        float m_SkyBoxBackLightRotationX; //0x00CC
        bool m_SkyBoxEnable; //0x00D0
        bool m_Enable; //0x00D1
        char _0x00D2[14];
    };//Size=0x00E0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01585
    // RuntimeId: 06369
    // TypeInfo:  0x02405FF0
#ifndef _DynamicAOComponentData_
#define _DynamicAOComponentData_
#pragma pack(push, 16)
    class DynamicAOComponentData : public ComponentData
    {
    public:
        static __inline DynamicAOComponentData* DefaultInstance()
        {
            return (DynamicAOComponentData*)0xF882C7C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1585;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405FF0;
        }
        Realm m_Realm; //0x0060
        float m_SsaoMaxDistanceOuter; //0x0064
        float m_SsaoFade; //0x0068
        float m_SsaoRadius; //0x006C
        float m_SsaoMaxDistanceInner; //0x0070
        float m_HbaoRadius; //0x0074
        float m_HbaoAttenuation; //0x0078
        float m_HbaoAngleBias; //0x007C
        float m_HbaoPowerExponent; //0x0080
        float m_HbaoContrast; //0x0084
        float m_HbaoMaxFootprintRadius; //0x0088
        bool m_Enable; //0x008C
        char _0x008D[3];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01586
    // RuntimeId: 06367
    // TypeInfo:  0x02405FC4
#ifndef _SunFlareComponentData_
#define _SunFlareComponentData_
#pragma pack(push, 16)
    class SunFlareComponentData : public ComponentData
    {
    public:
        static __inline SunFlareComponentData* DefaultInstance()
        {
            return (SunFlareComponentData*)0xF882C890;
        }
        static __inline unsigned int ClassId()
        {
            return 1586;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405FC4;
        }
        Vec4 m_Element5AlphaScreenPosCurve; //0x0060
        Vec4 m_Element5AlphaOccluderCurve; //0x0070
        Vec4 m_Element5SizeScreenPosCurve; //0x0080
        Vec4 m_Element2SizeOccluderCurve; //0x0090
        Vec4 m_Element5SizeOccluderCurve; //0x00A0
        Vec4 m_Element2AlphaOccluderCurve; //0x00B0
        Vec4 m_Element2AlphaScreenPosCurve; //0x00C0
        Vec2 m_Element1Size; //0x00D0
        char _0x00D8[8];
        Vec4 m_Element1SizeOccluderCurve; //0x00E0
        Vec4 m_Element1SizeScreenPosCurve; //0x00F0
        Vec4 m_Element1AlphaOccluderCurve; //0x0100
        Vec4 m_Element1AlphaScreenPosCurve; //0x0110
        Vec2 m_Element5Size; //0x0120
        char _0x0128[8];
        Vec4 m_Element4SizeOccluderCurve; //0x0130
        Vec2 m_Element3Size; //0x0140
        Vec2 m_Element2Size; //0x0148
        Vec4 m_Element4AlphaScreenPosCurve; //0x0150
        Vec4 m_Element2SizeScreenPosCurve; //0x0160
        Vec4 m_Element4SizeScreenPosCurve; //0x0170
        Vec2 m_Element4Size; //0x0180
        char _0x0188[8];
        Vec4 m_Element3AlphaScreenPosCurve; //0x0190
        Vec4 m_Element4AlphaOccluderCurve; //0x01A0
        Vec4 m_Element3SizeOccluderCurve; //0x01B0
        Vec4 m_Element3SizeScreenPosCurve; //0x01C0
        Vec4 m_Element3AlphaOccluderCurve; //0x01D0
        SurfaceShaderBaseAsset* m_Element1Shader; //0x01E0
        float m_OccluderSize; //0x01E4
        SurfaceShaderBaseAsset* m_Element2Shader; //0x01E8
        float m_Element3RayDistance; //0x01EC
        SurfaceShaderBaseAsset* m_Element4Shader; //0x01F0
        float m_Element4RayDistance; //0x01F4
        float m_Element2RayDistance; //0x01F8
        float m_Element1RayDistance; //0x01FC
        float m_Element5RayDistance; //0x0200
        SurfaceShaderBaseAsset* m_Element3Shader; //0x0204
        Realm m_Realm; //0x0208
        SurfaceShaderBaseAsset* m_Element5Shader; //0x020C
        bool m_Element5Enable; //0x0210
        bool m_Element3Enable; //0x0211
        bool m_Element2Enable; //0x0212
        bool m_Element1Enable; //0x0213
        bool m_DebugDrawOccluder; //0x0214
        bool m_Enable; //0x0215
        bool m_Element4Enable; //0x0216
        char _0x0217[9];
    };//Size=0x0220
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01587
    // RuntimeId: 06365
    // TypeInfo:  0x02405F98
#ifndef _WindComponentData_
#define _WindComponentData_
#pragma pack(push, 16)
    class WindComponentData : public ComponentData
    {
    public:
        static __inline WindComponentData* DefaultInstance()
        {
            return (WindComponentData*)0xF882CAF0;
        }
        static __inline unsigned int ClassId()
        {
            return 1587;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405F98;
        }
        Realm m_Realm; //0x0060
        float m_WindDirection; //0x0064
        float m_WindStrength; //0x0068
        char _0x006C[4];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01588
    // RuntimeId: 06363
    // TypeInfo:  0x02405F6C
#ifndef _DynamicEnvmapComponentData_
#define _DynamicEnvmapComponentData_
#pragma pack(push, 16)
    class DynamicEnvmapComponentData : public ComponentData
    {
    public:
        static __inline DynamicEnvmapComponentData* DefaultInstance()
        {
            return (DynamicEnvmapComponentData*)0xF882CBA0;
        }
        static __inline unsigned int ClassId()
        {
            return 1588;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405F6C;
        }
        Vec3 m_KeyColorEnvmap; //0x0060
        Vec3 m_GroundColorEnvmap; //0x0070
        Vec3 m_SkyColorEnvmap; //0x0080
        bool m_Enable; //0x0090
        char _0x0091[15];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01589
    // RuntimeId: 06361
    // TypeInfo:  0x02405F40
#ifndef _PlanarReflectionComponentData_
#define _PlanarReflectionComponentData_
#pragma pack(push, 16)
    class PlanarReflectionComponentData : public ComponentData
    {
    public:
        static __inline PlanarReflectionComponentData* DefaultInstance()
        {
            return (PlanarReflectionComponentData*)0xF882CC80;
        }
        static __inline unsigned int ClassId()
        {
            return 1589;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405F40;
        }
        BlurFilter m_VerticalBlurFilter; //0x0060
        float m_HorizontalDeviation; //0x0064
        float m_GroundHeight; //0x0068
        float m_VerticalDeviation; //0x006C
        BlurFilter m_HorizontalBlurFilter; //0x0070
        bool m_SkyRenderEnable; //0x0074
        bool m_Enable; //0x0075
        char _0x0076[10];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01590
    // RuntimeId: 06359
    // TypeInfo:  0x02405F14
#ifndef _SkyComponentData_
#define _SkyComponentData_
#pragma pack(push, 16)
    class SkyComponentData : public ComponentData
    {
    public:
        static __inline SkyComponentData* DefaultInstance()
        {
            return (SkyComponentData*)0xF882CD40;
        }
        static __inline unsigned int ClassId()
        {
            return 1590;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405F14;
        }
        Vec3 m_CloudLayerSunColor; //0x0060
        Vec3 m_CloudLayer2Color; //0x0070
        Vec3 m_CloudLayer1Color; //0x0080
        TextureAsset* m_SkyGradientTexture; //0x0090
        float m_SunSize; //0x0094
        float m_BrightnessScale; //0x0098
        float m_SunScale; //0x009C
        float m_PanoramicUVMaxX; //0x00A0
        float m_PanoramicUVMinY; //0x00A4
        float m_PanoramicUVMaxY; //0x00A8
        Realm m_Realm; //0x00AC
        float m_PanoramicUVMinX; //0x00B0
        TextureAsset* m_PanoramicTexture; //0x00B4
        TextureAsset* m_PanoramicAlphaTexture; //0x00B8
        float m_PanoramicTileFactor; //0x00BC
        TextureAsset* m_CloudLayerMaskTexture; //0x00C0
        float m_CloudLayer1Altitude; //0x00C4
        float m_CloudLayer1TileFactor; //0x00C8
        float m_CloudLayer1Rotation; //0x00CC
        float m_CloudLayer1Speed; //0x00D0
        float m_CloudLayer1SunLightIntensity; //0x00D4
        float m_PanoramicRotation; //0x00D8
        float m_CloudLayer1AmbientLightIntensity; //0x00DC
        float m_CloudLayer1SunLightPower; //0x00E0
        float m_CloudLayer1AlphaMul; //0x00E4
        TextureAsset* m_CloudLayer1Texture; //0x00E8
        float m_CloudLayer2Altitude; //0x00EC
        float m_CloudLayer2TileFactor; //0x00F0
        float m_CloudLayer2Rotation; //0x00F4
        float m_CloudLayer2Speed; //0x00F8
        float m_CloudLayer2SunLightIntensity; //0x00FC
        float m_CloudLayer2SunLightPower; //0x0100
        float m_CloudLayer2AmbientLightIntensity; //0x0104
        float m_StaticEnvmapScale; //0x0108
        float m_CloudLayer2AlphaMul; //0x010C
        TextureAsset* m_CloudLayer2Texture; //0x0110
        TextureAsset* m_StaticEnvmapTexture; //0x0114
        float m_SkyVisibilityExponent; //0x0118
        float m_SkyEnvmap8BitTexScale; //0x011C
        TextureAsset* m_CustomEnvmapTexture; //0x0120
        float m_CustomEnvmapScale; //0x0124
        float m_CustomEnvmapAmbient; //0x0128
        bool m_Enable; //0x012C
        char _0x012D[3];
    };//Size=0x0130
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01591
    // RuntimeId: 06357
    // TypeInfo:  0x02405EE8
#ifndef _FogComponentData_
#define _FogComponentData_
#pragma pack(push, 16)
    class FogComponentData : public ComponentData
    {
    public:
        static __inline FogComponentData* DefaultInstance()
        {
            return (FogComponentData*)0xF882CEB0;
        }
        static __inline unsigned int ClassId()
        {
            return 1591;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405EE8;
        }
        Vec4 m_Curve; //0x0060
        Vec4 m_FogColorCurve; //0x0070
        Vec3 m_FogColor; //0x0080
        float m_FogColorStart; //0x0090
        float m_FogDistanceMultiplier; //0x0094
        Realm m_Realm; //0x0098
        float m_End; //0x009C
        float m_TransparencyFadeStart; //0x00A0
        float m_Start; //0x00A4
        float m_TransparencyFadeEnd; //0x00A8
        float m_FogColorEnd; //0x00AC
        float m_TransparencyFadeClamp; //0x00B0
        float m_HeightFogVisibilityRange; //0x00B4
        float m_HeightFogAltitude; //0x00B8
        float m_HeightFogDepth; //0x00BC
        float m_HeightFogFollowCamera; //0x00C0
        bool m_FogGradientEnable; //0x00C4
        bool m_Enable; //0x00C5
        bool m_HeightFogEnable; //0x00C6
        bool m_FogColorEnable; //0x00C7
        char _0x00C8[8];
    };//Size=0x00D0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01592
    // RuntimeId: 06355
    // TypeInfo:  0x02405EBC
#ifndef _OutdoorLightComponentData_
#define _OutdoorLightComponentData_
#pragma pack(push, 16)
    class OutdoorLightComponentData : public ComponentData
    {
    public:
        static __inline OutdoorLightComponentData* DefaultInstance()
        {
            return (OutdoorLightComponentData*)0xF882CFC0;
        }
        static __inline unsigned int ClassId()
        {
            return 1592;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405EBC;
        }
        Vec3 m_SunColor; //0x0060
        Vec2 m_CloudShadowSpeed; //0x0070
        char _0x0078[8];
        Vec3 m_SkyColor; //0x0080
        Vec3 m_GroundColor; //0x0090
        float m_SunRotationY; //0x00A0
        float m_SunRotationX; //0x00A4
        Realm m_Realm; //0x00A8
        float m_SkyLightAngleFactor; //0x00AC
        float m_SunSpecularScale; //0x00B0
        float m_SkyEnvmapShadowScale; //0x00B4
        float m_SunShadowHeightScale; //0x00B8
        float m_CloudShadowCoverage; //0x00BC
        TextureAsset* m_CloudShadowTexture; //0x00C0
        float m_TranslucencyDistortion; //0x00C4
        float m_CloudShadowSize; //0x00C8
        float m_TranslucencyAmbient; //0x00CC
        float m_CloudShadowExponent; //0x00D0
        float m_TranslucencyScale; //0x00D4
        float m_TranslucencyPower; //0x00D8
        bool m_Enable; //0x00DC
        bool m_CloudShadowEnable; //0x00DD
        char _0x00DE[2];
    };//Size=0x00E0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00857
    // RuntimeId: 06353
    // TypeInfo:  0x02405E90
#ifndef _OcclusionSettings_
#define _OcclusionSettings_
#pragma pack(push, 4)
    class OcclusionSettings : public DataContainer
    {
    public:
        static __inline OcclusionSettings* DefaultInstance()
        {
            return (OcclusionSettings*)0xF8820228;
        }
        static __inline unsigned int ClassId()
        {
            return 857;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405E90;
        }
        bool m_Enable; //0x0008
        bool m_DrawZbuffer; //0x0009
        bool m_DrawBinaryBuffer; //0x000A
        char _0x000B[1];
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01695
    // RuntimeId: 00206
    // TypeInfo:  0x023C4FD4
#ifndef _EntityData_
#define _EntityData_
#pragma pack(push, 4)
    class EntityData : public GameObjectData
    {
    public:
        static __inline EntityData* DefaultInstance()
        {
            return (EntityData*)0xF8832378;
        }
        static __inline unsigned int ClassId()
        {
            return 1695;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C4FD4;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01856
    // RuntimeId: 00208
    // TypeInfo:  0x023C5000
#ifndef _SpatialEntityData_
#define _SpatialEntityData_
#pragma pack(push, 16)
    class SpatialEntityData : public EntityData
    {
    public:
        static __inline SpatialEntityData* DefaultInstance()
        {
            return (SpatialEntityData*)0xF8835020;
        }
        static __inline unsigned int ClassId()
        {
            return 1856;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C5000;
        }
        char _0x000C[4];
        LinearTransform m_Transform; //0x0010
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01859
    // RuntimeId: 06347
    // TypeInfo:  0x02405E0C
#ifndef _CompositeMeshEntityData_
#define _CompositeMeshEntityData_
#pragma pack(push, 16)
    class CompositeMeshEntityData : public SpatialEntityData
    {
    public:
        static __inline CompositeMeshEntityData* DefaultInstance()
        {
            return (CompositeMeshEntityData*)0xF88351E0;
        }
        static __inline unsigned int ClassId()
        {
            return 1859;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405E0C;
        }
        CompositeMeshAsset* m_Mesh; //0x0050
        char _0x0054[12];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01860
    // RuntimeId: 06345
    // TypeInfo:  0x02405DE0
#ifndef _RigidMeshEntityData_
#define _RigidMeshEntityData_
#pragma pack(push, 16)
    class RigidMeshEntityData : public SpatialEntityData
    {
    public:
        static __inline RigidMeshEntityData* DefaultInstance()
        {
            return (RigidMeshEntityData*)0xF8835280;
        }
        static __inline unsigned int ClassId()
        {
            return 1860;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405DE0;
        }
        RigidMeshAsset* m_Mesh; //0x0050
        char _0x0054[12];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01861
    // RuntimeId: 06343
    // TypeInfo:  0x02405DB4
#ifndef _LightProbeVolumeData_
#define _LightProbeVolumeData_
#pragma pack(push, 16)
    class LightProbeVolumeData : public SpatialEntityData
    {
    public:
        static __inline LightProbeVolumeData* DefaultInstance()
        {
            return (LightProbeVolumeData*)0xF8835320;
        }
        static __inline unsigned int ClassId()
        {
            return 1861;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405DB4;
        }
        unsigned __int32 m_Xres; //0x0050
        unsigned __int32 m_Yres; //0x0054
        unsigned __int32 m_Zres; //0x0058
        float m_BlendDistance; //0x005C
        __int32 m_Priority; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01862
    // RuntimeId: 06337
    // TypeInfo:  0x02405D30
#ifndef _LocalLightEntityData_
#define _LocalLightEntityData_
#pragma pack(push, 16)
    class LocalLightEntityData : public SpatialEntityData
    {
    public:
        static __inline LocalLightEntityData* DefaultInstance()
        {
            return (LocalLightEntityData*)0xF88353D0;
        }
        static __inline unsigned int ClassId()
        {
            return 1862;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405D30;
        }
        Vec3 m_Color; //0x0050
        Vec3 m_ParticleColorScale; //0x0060
        Vec3 m_EnlightenColorScale; //0x0070
        float m_Radius; //0x0080
        float m_Intensity; //0x0084
        float m_AttenuationOffset; //0x0088
        EnlightenColorMode m_EnlightenColorMode; //0x008C
        bool m_EnlightenEnable; //0x0090
        bool m_Visible; //0x0091
        bool m_SpecularEnable; //0x0092
        char _0x0093[13];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01864
    // RuntimeId: 06339
    // TypeInfo:  0x02405D5C
#ifndef _PointLightEntityData_
#define _PointLightEntityData_
#pragma pack(push, 16)
    class PointLightEntityData : public LocalLightEntityData
    {
    public:
        static __inline PointLightEntityData* DefaultInstance()
        {
            return (PointLightEntityData*)0xF88355C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1864;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405D5C;
        }
        float m_Width; //0x00A0
        float m_TranslucencyAmbient; //0x00A4
        float m_TranslucencyScale; //0x00A8
        unsigned __int32 m_TranslucencyPower; //0x00AC
        float m_TranslucencyDistortion; //0x00B0
        char _0x00B4[12];
    };//Size=0x00C0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01863
    // RuntimeId: 06341
    // TypeInfo:  0x02405D88
#ifndef _SpotLightEntityData_
#define _SpotLightEntityData_
#pragma pack(push, 16)
    class SpotLightEntityData : public LocalLightEntityData
    {
    public:
        static __inline SpotLightEntityData* DefaultInstance()
        {
            return (SpotLightEntityData*)0xF88354B0;
        }
        static __inline unsigned int ClassId()
        {
            return 1863;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405D88;
        }
        SpotLightShape m_Shape; //0x00A0
        float m_ConeInnerAngle; //0x00A4
        float m_ConeOuterAngle; //0x00A8
        float m_FrustumFov; //0x00AC
        float m_FrustumAspect; //0x00B0
        float m_OrthoWidth; //0x00B4
        float m_OrthoHeight; //0x00B8
        TextureAsset* m_Texture; //0x00BC
        QualityLevel m_CastShadowsMinLevel; //0x00C0
        bool m_CastShadowsEnable; //0x00C4
        char _0x00C5[11];
    };//Size=0x00D0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01865
    // RuntimeId: 06333
    // TypeInfo:  0x02405CF4
#ifndef _LensFlareEntityData_
#define _LensFlareEntityData_
#pragma pack(push, 16)
    class LensFlareEntityData : public SpatialEntityData
    {
    public:
        static __inline LensFlareEntityData* DefaultInstance()
        {
            return (LensFlareEntityData*)0xF88356C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1865;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405CF4;
        }
        Array<LensFlareElement> m_Elements; //0x0050
        float m_OccluderSize; //0x0054
        bool m_Visible; //0x0058
        bool m_HalfRes; //0x0059
        bool m_DebugDrawOccluder; //0x005A
        char _0x005B[5];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01866
    // RuntimeId: 06329
    // TypeInfo:  0x02405CB8
#ifndef _GroundHeightEntityData_
#define _GroundHeightEntityData_
#pragma pack(push, 16)
    class GroundHeightEntityData : public SpatialEntityData
    {
    public:
        static __inline GroundHeightEntityData* DefaultInstance()
        {
            return (GroundHeightEntityData*)0xF8835760;
        }
        static __inline unsigned int ClassId()
        {
            return 1866;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405CB8;
        }
        GroundHeightData m_Data; //0x0050
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01696
    // RuntimeId: 06321
    // TypeInfo:  0x02405C24
#ifndef _EnlightenEntityData_
#define _EnlightenEntityData_
#pragma pack(push, 4)
    class EnlightenEntityData : public EntityData
    {
    public:
        static __inline EnlightenEntityData* DefaultInstance()
        {
            return (EnlightenEntityData*)0xF8832398;
        }
        static __inline unsigned int ClassId()
        {
            return 1696;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405C24;
        }
        __int32 m_Priority; //0x000C
        Realm m_Realm; //0x0010
        bool m_Enable; //0x0014
        char _0x0015[3];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01698
    // RuntimeId: 06323
    // TypeInfo:  0x02405C50
#ifndef _DynamicEnlightenEntityData_
#define _DynamicEnlightenEntityData_
#pragma pack(push, 4)
    class DynamicEnlightenEntityData : public EnlightenEntityData
    {
    public:
        static __inline DynamicEnlightenEntityData* DefaultInstance()
        {
            return (DynamicEnlightenEntityData*)0xF8832400;
        }
        static __inline unsigned int ClassId()
        {
            return 1698;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405C50;
        }
        EnlightenDataAsset* m_EnlightenData; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01697
    // RuntimeId: 06325
    // TypeInfo:  0x02405C7C
#ifndef _StaticEnlightenEntityData_
#define _StaticEnlightenEntityData_
#pragma pack(push, 4)
    class StaticEnlightenEntityData : public EnlightenEntityData
    {
    public:
        static __inline StaticEnlightenEntityData* DefaultInstance()
        {
            return (StaticEnlightenEntityData*)0xF88323C8;
        }
        static __inline unsigned int ClassId()
        {
            return 1697;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405C7C;
        }
        StaticEnlightenData* m_EnlightenData; //0x0018
        EnlightenDataAsset* m_DynamicEnlightenData; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01699
    // RuntimeId: 06319
    // TypeInfo:  0x02405BF8
#ifndef _RadiosityEntityData_
#define _RadiosityEntityData_
#pragma pack(push, 4)
    class RadiosityEntityData : public EntityData
    {
    public:
        static __inline RadiosityEntityData* DefaultInstance()
        {
            return (RadiosityEntityData*)0xF8832430;
        }
        static __inline unsigned int ClassId()
        {
            return 1699;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405BF8;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01867
    // RuntimeId: 06313
    // TypeInfo:  0x02405B74
#ifndef _RenderVolumeEntityData_
#define _RenderVolumeEntityData_
#pragma pack(push, 16)
    class RenderVolumeEntityData : public SpatialEntityData
    {
    public:
        static __inline RenderVolumeEntityData* DefaultInstance()
        {
            return (RenderVolumeEntityData*)0xF8835800;
        }
        static __inline unsigned int ClassId()
        {
            return 1867;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405B74;
        }
        Vec4 m_UserMasks; //0x0050
        SurfaceShaderInstanceDataStruct m_Shader; //0x0060
        RenderVolumeTransformType m_TransformType; //0x0074
        bool m_Enabled; //0x0078
        char _0x0079[7];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01869
    // RuntimeId: 06315
    // TypeInfo:  0x02405BA0
#ifndef _DecalVolumeEntityData_
#define _DecalVolumeEntityData_
#pragma pack(push, 16)
    class DecalVolumeEntityData : public RenderVolumeEntityData
    {
    public:
        static __inline DecalVolumeEntityData* DefaultInstance()
        {
            return (DecalVolumeEntityData*)0xF8835980;
        }
        static __inline unsigned int ClassId()
        {
            return 1869;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405BA0;
        }
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01868
    // RuntimeId: 06317
    // TypeInfo:  0x02405BCC
#ifndef _MaskVolumeEntityData_
#define _MaskVolumeEntityData_
#pragma pack(push, 16)
    class MaskVolumeEntityData : public RenderVolumeEntityData
    {
    public:
        static __inline MaskVolumeEntityData* DefaultInstance()
        {
            return (MaskVolumeEntityData*)0xF88358C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1868;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405BCC;
        }
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01700
    // RuntimeId: 06311
    // TypeInfo:  0x02405B48
#ifndef _EnvmapEntityData_
#define _EnvmapEntityData_
#pragma pack(push, 4)
    class EnvmapEntityData : public EntityData
    {
    public:
        static __inline EnvmapEntityData* DefaultInstance()
        {
            return (EnvmapEntityData*)0xF8832450;
        }
        static __inline unsigned int ClassId()
        {
            return 1700;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405B48;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01870
    // RuntimeId: 06307
    // TypeInfo:  0x02405B0C
#ifndef _OccluderVolumeEntityData_
#define _OccluderVolumeEntityData_
#pragma pack(push, 16)
    class OccluderVolumeEntityData : public SpatialEntityData
    {
    public:
        static __inline OccluderVolumeEntityData* DefaultInstance()
        {
            return (OccluderVolumeEntityData*)0xF8835A40;
        }
        static __inline unsigned int ClassId()
        {
            return 1870;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405B0C;
        }
        bool m_OccluderHighPriority; //0x0050
        char _0x0051[15];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00858
    // RuntimeId: 06305
    // TypeInfo:  0x02405AE0
#ifndef _EnlightenState_
#define _EnlightenState_
#pragma pack(push, 16)
    class EnlightenState : public DataContainer
    {
    public:
        static __inline EnlightenState* DefaultInstance()
        {
            return (EnlightenState*)0xF8820260;
        }
        static __inline unsigned int ClassId()
        {
            return 858;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405AE0;
        }
        char _0x0008[8];
        Vec3 m_SkyBoxGroundColor; //0x0010
        Vec3 m_SkyBoxSunLightColor; //0x0020
        Vec3 m_SkyBoxBackLightColor; //0x0030
        Vec3 m_SkyBoxSkyColor; //0x0040
        float m_SunScale; //0x0050
        float m_OutputScale; //0x0054
        float m_BounceScale; //0x0058
        float m_SkyBoxSunLightColorSize; //0x005C
        float m_SkyBoxBackLightRotationY; //0x0060
        float m_SkyBoxBackLightColorSize; //0x0064
        float m_SkyBoxBackLightRotationX; //0x0068
        bool m_SkyBoxEnable; //0x006C
        char _0x006D[3];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02023
    // RuntimeId: 06303
    // TypeInfo:  0x02405AB4
#ifndef _EnlightenRuntimeConfig_
#define _EnlightenRuntimeConfig_
#pragma pack(push, 4)
    class EnlightenRuntimeConfig : public Asset
    {
    public:
        static __inline EnlightenRuntimeConfig* DefaultInstance()
        {
            return (EnlightenRuntimeConfig*)0xF883D530;
        }
        static __inline unsigned int ClassId()
        {
            return 2023;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405AB4;
        }
        unsigned __int32 m_JobCount; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02444
    // RuntimeId: 00066
    // TypeInfo:  0x023C2760
#ifndef _SystemSettings_
#define _SystemSettings_
#pragma pack(push, 4)
    class SystemSettings : public DataContainer
    {
    public:
        static __inline SystemSettings* DefaultInstance()
        {
            return (SystemSettings*)0xF8843700;
        }
        static __inline unsigned int ClassId()
        {
            return 2444;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C2760;
        }
        char* m_Name; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00859
    // RuntimeId: 06299
    // TypeInfo:  0x02405A5C
#ifndef _DestructionVolumeData_
#define _DestructionVolumeData_
#pragma pack(push, 16)
    class DestructionVolumeData : public DataContainer
    {
    public:
        static __inline DestructionVolumeData* DefaultInstance()
        {
            return (DestructionVolumeData*)0xF8820310;
        }
        static __inline unsigned int ClassId()
        {
            return 859;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405A5C;
        }
        char _0x0008[8];
        AxisAlignedBox m_BoundingBox; //0x0010
        DestructionVolumeAsset* m_Asset; //0x0030
        Array<Vec4> m_Impacts; //0x0034
        Array<unsigned __int32> m_PartToImpactIndices; //0x0038
        char _0x003C[4];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02024
    // RuntimeId: 06297
    // TypeInfo:  0x02405A30
#ifndef _DestructionVolumeAsset_
#define _DestructionVolumeAsset_
#pragma pack(push, 4)
    class DestructionVolumeAsset : public Asset
    {
    public:
        static __inline DestructionVolumeAsset* DefaultInstance()
        {
            return (DestructionVolumeAsset*)0xF883D558;
        }
        static __inline unsigned int ClassId()
        {
            return 2024;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02405A30;
        }
        TextureAsset* m_DiffuseAtlas; //0x000C
        TextureAsset* m_NormalmapAtlas; //0x0010
        float m_AtlasTextureScale; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00860
    // RuntimeId: 06291
    // TypeInfo:  0x024059E4
#ifndef _CreateDestructionVolumeParams_
#define _CreateDestructionVolumeParams_
#pragma pack(push, 4)
    class CreateDestructionVolumeParams : public DataContainer
    {
    public:
        static __inline CreateDestructionVolumeParams* DefaultInstance()
        {
            return (CreateDestructionVolumeParams*)0xF8820378;
        }
        static __inline unsigned int ClassId()
        {
            return 860;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024059E4;
        }
        char* m_AssetName; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00400
    // RuntimeId: 06289
    // TypeInfo:  0x02404F20
#ifndef _StaticEnlightenEntity_
#define _StaticEnlightenEntity_
    class StaticEnlightenEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 400;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404F20;
        }
        char _0x000C[40];
    };//Size=0x0034
#endif

    ////////////////////////////////////////
    // ClassId:   00611
    // RuntimeId: 00134
    // TypeInfo:  0x023C4A70
#ifndef _SpatialEntity_
#define _SpatialEntity_
    class SpatialEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 611;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C4A70;
        }
        char _0x000C[4];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00613
    // RuntimeId: 06285
    // TypeInfo:  0x02404E80
#ifndef _LocalLightEntity_
#define _LocalLightEntity_
    class LocalLightEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 613;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404E80;
        }
        char _0x0010[144];
    };//Size=0x00A0
#endif

    ////////////////////////////////////////
    // ClassId:   00615
    // RuntimeId: 06286
    // TypeInfo:  0x02404EA8
#ifndef _PointLightEntity_
#define _PointLightEntity_
    class PointLightEntity : public LocalLightEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 615;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404EA8;
        }
    };//Size=0x00A0
#endif

    ////////////////////////////////////////
    // ClassId:   00614
    // RuntimeId: 06287
    // TypeInfo:  0x02404ED0
#ifndef _SpotLightEntity_
#define _SpotLightEntity_
    class SpotLightEntity : public LocalLightEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 614;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404ED0;
        }
        char _0x00A0[16];
    };//Size=0x00B0
#endif

    ////////////////////////////////////////
    // ClassId:   00616
    // RuntimeId: 06284
    // TypeInfo:  0x02404E58
#ifndef _OccluderVolumeEntity_
#define _OccluderVolumeEntity_
    class OccluderVolumeEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 616;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404E58;
        }
        char _0x0010[12];
    };//Size=0x001C
#endif

    ////////////////////////////////////////
    // ClassId:   00617
    // RuntimeId: 06283
    // TypeInfo:  0x02404E30
#ifndef _OccluderMeshEntity_
#define _OccluderMeshEntity_
    class OccluderMeshEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 617;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404E30;
        }
        char _0x0010[20];
    };//Size=0x0024
#endif

    ////////////////////////////////////////
    // ClassId:   00618
    // RuntimeId: 06282
    // TypeInfo:  0x02404E08
#ifndef _MeshProxyEntity_
#define _MeshProxyEntity_
    class MeshProxyEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 618;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404E08;
        }
        char _0x0010[128];
    };//Size=0x0090
#endif

    ////////////////////////////////////////
    // ClassId:   00401
    // RuntimeId: 06279
    // TypeInfo:  0x02404D90
#ifndef _RenderVolumeEntity_
#define _RenderVolumeEntity_
    class RenderVolumeEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 401;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404D90;
        }
        char _0x000C[100];
    };//Size=0x0070
#endif

    ////////////////////////////////////////
    // ClassId:   00403
    // RuntimeId: 06280
    // TypeInfo:  0x02404DB8
#ifndef _DecalVolumeEntity_
#define _DecalVolumeEntity_
    class DecalVolumeEntity : public RenderVolumeEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 403;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404DB8;
        }
    };//Size=0x0070
#endif

    ////////////////////////////////////////
    // ClassId:   00402
    // RuntimeId: 06281
    // TypeInfo:  0x02404DE0
#ifndef _MaskVolumeEntity_
#define _MaskVolumeEntity_
    class MaskVolumeEntity : public RenderVolumeEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 402;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404DE0;
        }
    };//Size=0x0070
#endif

    ////////////////////////////////////////
    // ClassId:   00404
    // RuntimeId: 06278
    // TypeInfo:  0x02404D68
#ifndef _LensFlareEntity_
#define _LensFlareEntity_
    class LensFlareEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 404;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404D68;
        }
        char _0x000C[132];
    };//Size=0x0090
#endif

    ////////////////////////////////////////
    // ClassId:   00405
    // RuntimeId: 06277
    // TypeInfo:  0x02404D40
#ifndef _GroundHeightEntity_
#define _GroundHeightEntity_
    class GroundHeightEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 405;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404D40;
        }
        char _0x000C[8228];
    };//Size=0x2030
#endif

    ////////////////////////////////////////
    // ClassId:   00406
    // RuntimeId: 06276
    // TypeInfo:  0x02404D18
#ifndef _EnvmapEntity_
#define _EnvmapEntity_
    class EnvmapEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 406;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404D18;
        }
        char _0x000C[52];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   00407
    // RuntimeId: 06275
    // TypeInfo:  0x02404CF0
#ifndef _DynamicEnlightenEntity_
#define _DynamicEnlightenEntity_
    class DynamicEnlightenEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 407;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404CF0;
        }
        char _0x000C[68];
    };//Size=0x0050
#endif

    ////////////////////////////////////////
    // ClassId:   00619
    // RuntimeId: 06274
    // TypeInfo:  0x02404CC8
#ifndef _CompositeMeshEntity_
#define _CompositeMeshEntity_
    class CompositeMeshEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 619;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404CC8;
        }
        char _0x0010[112];
    };//Size=0x0080
#endif

    ////////////////////////////////////////
    // ClassId:   00001
    // RuntimeId: 06273
    // TypeInfo:  0x02404CA0
#ifndef _EnlightenSystem_
#define _EnlightenSystem_
    class EnlightenSystem
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404CA0;
        }
        char _0x0000[240];
    };//Size=0x00F0
#endif

    ////////////////////////////////////////
    // ClassId:   00002
    // RuntimeId: 06272
    // TypeInfo:  0x02404C78
#ifndef _EnlightenProbeSet_
#define _EnlightenProbeSet_
    class EnlightenProbeSet
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 2;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404C78;
        }
        char _0x0000[60];
    };//Size=0x003C
#endif

    ////////////////////////////////////////
    // ClassId:   00003
    // RuntimeId: 06271
    // TypeInfo:  0x02404C50
#ifndef _StaticEnlightenDatabase_
#define _StaticEnlightenDatabase_
    class StaticEnlightenDatabase
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 3;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404C50;
        }
        char _0x0000[36];
    };//Size=0x0024
#endif

    ////////////////////////////////////////
    // ClassId:   00004
    // RuntimeId: 06270
    // TypeInfo:  0x02404C28
#ifndef _EnlightenShaderDatabase_
#define _EnlightenShaderDatabase_
    class EnlightenShaderDatabase
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 4;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404C28;
        }
        char _0x0000[28];
    };//Size=0x001C
#endif

    ////////////////////////////////////////
    // ClassId:   00005
    // RuntimeId: 06269
    // TypeInfo:  0x02404C00
#ifndef _EnlightenDatabase_
#define _EnlightenDatabase_
    class EnlightenDatabase
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 5;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404C00;
        }
        char _0x0000[200];
    };//Size=0x00C8
#endif

    ////////////////////////////////////////
    // ClassId:   00006
    // RuntimeId: 06268
    // TypeInfo:  0x0240498C
#ifndef _OccluderMesh_
#define _OccluderMesh_
    class OccluderMesh
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 6;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240498C;
        }
        char _0x0000[20];
    };//Size=0x0014
#endif

    ////////////////////////////////////////
    // ClassId:   02025
    // RuntimeId: 06267
    // TypeInfo:  0x02404944
#ifndef _PathfindingObjectCategoryAsset_
#define _PathfindingObjectCategoryAsset_
#pragma pack(push, 4)
    class PathfindingObjectCategoryAsset : public Asset
    {
    public:
        static __inline PathfindingObjectCategoryAsset* DefaultInstance()
        {
            return (PathfindingObjectCategoryAsset*)0xF883D588;
        }
        static __inline unsigned int ClassId()
        {
            return 2025;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404944;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00007
    // RuntimeId: 06264
    // TypeInfo:  0x024048C4
#ifndef _ISwfMovie_
#define _ISwfMovie_
    class ISwfMovie
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 7;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024048C4;
        }
        char _0x0000[4];
    };//Size=0x0004
#endif

    ////////////////////////////////////////
    // ClassId:   00008
    // RuntimeId: 06265
    // TypeInfo:  0x024048EC
#ifndef _SwfMovie_
#define _SwfMovie_
    class SwfMovie : public ISwfMovie
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 8;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024048EC;
        }
        char _0x0004[16];
    };//Size=0x0014
#endif

    ////////////////////////////////////////
    // ClassId:   01701
    // RuntimeId: 06240
    // TypeInfo:  0x024044C8
#ifndef _UIGraphEntityData_
#define _UIGraphEntityData_
#pragma pack(push, 4)
    class UIGraphEntityData : public EntityData
    {
    public:
        static __inline UIGraphEntityData* DefaultInstance()
        {
            return (UIGraphEntityData*)0xF8832470;
        }
        static __inline unsigned int ClassId()
        {
            return 1701;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024044C8;
        }
        Array<EventSpec> m_Events; //0x000C
        UIGraphAsset* m_GraphAsset; //0x0010
        UIGraphPriority m_GraphPriority; //0x0014
        UIState m_State; //0x0018
        bool m_PopPreviousGraph; //0x001C
        char _0x001D[3];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00876
    // RuntimeId: 06174
    // TypeInfo:  0x02403FE0
#ifndef _UINodeData_
#define _UINodeData_
#pragma pack(push, 4)
    class UINodeData : public DataContainer
    {
    public:
        static __inline UINodeData* DefaultInstance()
        {
            return (UINodeData*)0xF88207F8;
        }
        static __inline unsigned int ClassId()
        {
            return 876;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403FE0;
        }
        char* m_Name; //0x0008
        UIGraphAsset* m_ParentGraph; //0x000C
        bool m_IsRootNode; //0x0010
        bool m_ParentIsScreen; //0x0011
        char _0x0012[2];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00878
    // RuntimeId: 06234
    // TypeInfo:  0x02404460
#ifndef _JumpNode_
#define _JumpNode_
#pragma pack(push, 4)
    class JumpNode : public UINodeData
    {
    public:
        static __inline JumpNode* DefaultInstance()
        {
            return (JumpNode*)0xF8820850;
        }
        static __inline unsigned int ClassId()
        {
            return 878;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404460;
        }
        UINodePort* m_In; //0x0014
        UINodeData* m_TargetNode; //0x0018
        UINodePort* m_TargetPort; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00895
    // RuntimeId: 06192
    // TypeInfo:  0x02404118
#ifndef _StateNode_
#define _StateNode_
#pragma pack(push, 4)
    class StateNode : public UINodeData
    {
    public:
        static __inline StateNode* DefaultInstance()
        {
            return (StateNode*)0xF8820CE0;
        }
        static __inline unsigned int ClassId()
        {
            return 895;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404118;
        }
        UIScreenAsset* m_Screen; //0x0014
        UINodePort* m_In; //0x0018
        UINodePort* m_Show; //0x001C
        UINodePort* m_Hide; //0x0020
        Array<UINodePort*> m_Inputs; //0x0024
        Array<UINodePort*> m_Outputs; //0x0028
        bool m_RenderToTexture; //0x002C
        char _0x002D[3];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00879
    // RuntimeId: 06230
    // TypeInfo:  0x02404408
#ifndef _GlobalNode_
#define _GlobalNode_
#pragma pack(push, 4)
    class GlobalNode : public UINodeData
    {
    public:
        static __inline GlobalNode* DefaultInstance()
        {
            return (GlobalNode*)0xF8820888;
        }
        static __inline unsigned int ClassId()
        {
            return 879;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404408;
        }
        Array<UINodePort*> m_Outputs; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00880
    // RuntimeId: 06226
    // TypeInfo:  0x024043CC
#ifndef _InstanceOutputNode_
#define _InstanceOutputNode_
#pragma pack(push, 4)
    class InstanceOutputNode : public UINodeData
    {
    public:
        static __inline InstanceOutputNode* DefaultInstance()
        {
            return (InstanceOutputNode*)0xF88208B8;
        }
        static __inline unsigned int ClassId()
        {
            return 880;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024043CC;
        }
        UINodePort* m_In; //0x0014
        __int32 m_Id; //0x0018
        bool m_DestroyGraph; //0x001C
        char _0x001D[3];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00881
    // RuntimeId: 06224
    // TypeInfo:  0x024043A0
#ifndef _InstanceInputNode_
#define _InstanceInputNode_
#pragma pack(push, 4)
    class InstanceInputNode : public UINodeData
    {
    public:
        static __inline InstanceInputNode* DefaultInstance()
        {
            return (InstanceInputNode*)0xF88208F0;
        }
        static __inline unsigned int ClassId()
        {
            return 881;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024043A0;
        }
        UINodePort* m_Out; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00882
    // RuntimeId: 06222
    // TypeInfo:  0x02404374
#ifndef _InstanceNode_
#define _InstanceNode_
#pragma pack(push, 4)
    class InstanceNode : public UINodeData
    {
    public:
        static __inline InstanceNode* DefaultInstance()
        {
            return (InstanceNode*)0xF8820920;
        }
        static __inline unsigned int ClassId()
        {
            return 882;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404374;
        }
        UIGraphAsset* m_UIGraph; //0x0014
        Array<UINodePort*> m_Inputs; //0x0018
        Array<UINodePort*> m_Outputs; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00883
    // RuntimeId: 06220
    // TypeInfo:  0x02404348
#ifndef _ActionNode_
#define _ActionNode_
#pragma pack(push, 4)
    class ActionNode : public UINodeData
    {
    public:
        static __inline ActionNode* DefaultInstance()
        {
            return (ActionNode*)0xF8820958;
        }
        static __inline unsigned int ClassId()
        {
            return 883;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404348;
        }
        __int32 m_ActionKey; //0x0014
        Array<char*> m_Params; //0x0018
        Asset* m_ActionAsset; //0x001C
        UINodePort* m_In; //0x0020
        UINodePort* m_Out; //0x0024
        Array<UINodePort*> m_DataInputs; //0x0028
        bool m_AppendIncomingParams; //0x002C
        char _0x002D[3];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00884
    // RuntimeId: 06218
    // TypeInfo:  0x0240431C
#ifndef _OperandLogicNode_
#define _OperandLogicNode_
#pragma pack(push, 8)
    class OperandLogicNode : public UINodeData
    {
    public:
        static __inline OperandLogicNode* DefaultInstance()
        {
            return (OperandLogicNode*)0xF88209A0;
        }
        static __inline unsigned int ClassId()
        {
            return 884;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240431C;
        }
        UIDataSourceInfo m_LeftDataSourceInfo; //0x0014
        UILogicOperator m_Operator; //0x0024
        UIDataSourceInfo m_RightDataSourceInfo; //0x0028
        double m_RightLiteralOperand; //0x0038
        UINodePort* m_In; //0x0040
        UINodePort* m_True; //0x0044
        UINodePort* m_False; //0x0048
        char _0x004C[4];
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00885
    // RuntimeId: 06216
    // TypeInfo:  0x024042F0
#ifndef _ComparisonLogicNode_
#define _ComparisonLogicNode_
#pragma pack(push, 4)
    class ComparisonLogicNode : public UINodeData
    {
    public:
        static __inline ComparisonLogicNode* DefaultInstance()
        {
            return (ComparisonLogicNode*)0xF8820A08;
        }
        static __inline unsigned int ClassId()
        {
            return 885;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024042F0;
        }
        UINodePort* m_In; //0x0014
        Array<UINodePort*> m_Outputs; //0x0018
        UIDataSourceInfo m_DataSourceInfo; //0x001C
        bool m_SkipFractionals; //0x002C
        char _0x002D[3];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00886
    // RuntimeId: 06214
    // TypeInfo:  0x024042C4
#ifndef _BinaryLogicNode_
#define _BinaryLogicNode_
#pragma pack(push, 4)
    class BinaryLogicNode : public UINodeData
    {
    public:
        static __inline BinaryLogicNode* DefaultInstance()
        {
            return (BinaryLogicNode*)0xF8820A50;
        }
        static __inline unsigned int ClassId()
        {
            return 886;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024042C4;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_True; //0x0018
        UINodePort* m_False; //0x001C
        UIDataSourceInfo m_DataSourceInfo; //0x0020
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00887
    // RuntimeId: 06212
    // TypeInfo:  0x02404298
#ifndef _RefreshNode_
#define _RefreshNode_
#pragma pack(push, 4)
    class RefreshNode : public UINodeData
    {
    public:
        static __inline RefreshNode* DefaultInstance()
        {
            return (RefreshNode*)0xF8820A98;
        }
        static __inline unsigned int ClassId()
        {
            return 887;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404298;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_Out; //0x0018
        UIDataSourceInfo m_DataSource; //0x001C
    };//Size=0x002C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00888
    // RuntimeId: 06210
    // TypeInfo:  0x0240426C
#ifndef _DataStepNode_
#define _DataStepNode_
#pragma pack(push, 4)
    class DataStepNode : public UINodeData
    {
    public:
        static __inline DataStepNode* DefaultInstance()
        {
            return (DataStepNode*)0xF8820AD8;
        }
        static __inline unsigned int ClassId()
        {
            return 888;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240426C;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_Out; //0x0018
        Array<float> m_Steps; //0x001C
        UIDataSourceInfo m_CurrentStepDataSource; //0x0020
        UIDataSourceInfo m_DataSource; //0x0030
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00889
    // RuntimeId: 06208
    // TypeInfo:  0x02404240
#ifndef _DataIncrementNode_
#define _DataIncrementNode_
#pragma pack(push, 4)
    class DataIncrementNode : public UINodeData
    {
    public:
        static __inline DataIncrementNode* DefaultInstance()
        {
            return (DataIncrementNode*)0xF8820B30;
        }
        static __inline unsigned int ClassId()
        {
            return 889;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404240;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_Out; //0x0018
        float m_Max; //0x001C
        float m_Min; //0x0020
        float m_IncrementSize; //0x0024
        UIDataSourceInfo m_DataSource; //0x0028
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00890
    // RuntimeId: 06206
    // TypeInfo:  0x02404214
#ifndef _DataToggleNode_
#define _DataToggleNode_
#pragma pack(push, 4)
    class DataToggleNode : public UINodeData
    {
    public:
        static __inline DataToggleNode* DefaultInstance()
        {
            return (DataToggleNode*)0xF8820B80;
        }
        static __inline unsigned int ClassId()
        {
            return 890;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404214;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_Out; //0x0018
        UIDataSourceInfo m_DataSource; //0x001C
    };//Size=0x002C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00891
    // RuntimeId: 06204
    // TypeInfo:  0x024041E8
#ifndef _DataSetNode_
#define _DataSetNode_
#pragma pack(push, 4)
    class DataSetNode : public UINodeData
    {
    public:
        static __inline DataSetNode* DefaultInstance()
        {
            return (DataSetNode*)0xF8820BC0;
        }
        static __inline unsigned int ClassId()
        {
            return 891;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024041E8;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_Out; //0x0018
        char* m_Param; //0x001C
        UIDataSourceInfo m_DataSource; //0x0020
        bool m_SetToEmptyString; //0x0030
        bool m_ForceUpdate; //0x0031
        char _0x0032[2];
    };//Size=0x0034
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00892
    // RuntimeId: 06202
    // TypeInfo:  0x024041BC
#ifndef _DataGetNode_
#define _DataGetNode_
#pragma pack(push, 4)
    class DataGetNode : public UINodeData
    {
    public:
        static __inline DataGetNode* DefaultInstance()
        {
            return (DataGetNode*)0xF8820C08;
        }
        static __inline unsigned int ClassId()
        {
            return 892;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024041BC;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_Out; //0x0018
        UIDataSourceInfo m_DataSource; //0x001C
    };//Size=0x002C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00893
    // RuntimeId: 06200
    // TypeInfo:  0x02404190
#ifndef _QueryGetNode_
#define _QueryGetNode_
#pragma pack(push, 4)
    class QueryGetNode : public UINodeData
    {
    public:
        static __inline QueryGetNode* DefaultInstance()
        {
            return (QueryGetNode*)0xF8820C48;
        }
        static __inline unsigned int ClassId()
        {
            return 893;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404190;
        }
        UINodePort* m_In; //0x0014
        UINodePort* m_Out; //0x0018
        UIDataSourceInfo m_DataSource; //0x001C
    };//Size=0x002C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00894
    // RuntimeId: 06198
    // TypeInfo:  0x02404164
#ifndef _WidgetNode_
#define _WidgetNode_
#pragma pack(push, 4)
    class WidgetNode : public UINodeData
    {
    public:
        static __inline WidgetNode* DefaultInstance()
        {
            return (WidgetNode*)0xF8820C88;
        }
        static __inline unsigned int ClassId()
        {
            return 894;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404164;
        }
        UIWidgetAsset* m_WidgetAsset; //0x0014
        __int32 m_FocusIndex; //0x0018
        __int32 m_ZDepthLevel; //0x001C
        WidgetVerticalAlignment m_VerticalAlign; //0x0020
        WidgetHorisontalAlignment m_HorisontalAlign; //0x0024
        UIDataBinding* m_DataBinding; //0x0028
        Array<UIWidgetProperty> m_WidgetProperties; //0x002C
        char* m_InstanceName; //0x0030
        Array<UINodePort*> m_Inputs; //0x0034
        Array<UINodePort*> m_Outputs; //0x0038
        bool m_AlwaysInFocus; //0x003C
        char _0x003D[3];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00896
    // RuntimeId: 06232
    // TypeInfo:  0x02404434
#ifndef _DialogNode_
#define _DialogNode_
#pragma pack(push, 4)
    class DialogNode : public StateNode
    {
    public:
        static __inline DialogNode* DefaultInstance()
        {
            return (DialogNode*)0xF8820D28;
        }
        static __inline unsigned int ClassId()
        {
            return 896;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404434;
        }
        char* m_DialogTitle; //0x0030
        char* m_DialogText; //0x0034
        Array<UIPopupButton> m_Buttons; //0x0038
    };//Size=0x003C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02036
    // RuntimeId: 06128
    // TypeInfo:  0x02403D04
#ifndef _UIAsset_
#define _UIAsset_
#pragma pack(push, 4)
    class UIAsset : public Asset
    {
    public:
        static __inline UIAsset* DefaultInstance()
        {
            return (UIAsset*)0xF883D778;
        }
        static __inline unsigned int ClassId()
        {
            return 2036;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403D04;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02026
    // RuntimeId: 06176
    // TypeInfo:  0x0240400C
#ifndef _UIGraphAsset_
#define _UIGraphAsset_
#pragma pack(push, 4)
    class UIGraphAsset : public Asset
    {
    public:
        static __inline UIGraphAsset* DefaultInstance()
        {
            return (UIGraphAsset*)0xF883D5A8;
        }
        static __inline unsigned int ClassId()
        {
            return 2026;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240400C;
        }
        Array<UINodeData*> m_Nodes; //0x000C
        GlobalNode* m_GlobalNode; //0x0010
        Array<UINodeConnection*> m_Connections; //0x0014
        UIAudioEventAsset* m_AudioEventMappings; //0x0018
        char* m_BundleAssetName; //0x001C
        Array<UIEventAsset*> m_EventList; //0x0020
        bool m_Modal; //0x0024
        bool m_ProtectScreens; //0x0025
        bool m_IsWin32UIGraphAsset; //0x0026
        bool m_IsXenonUIGraphAsset; //0x0027
        bool m_IsPs3UIGraphAsset; //0x0028
        char _0x0029[3];
    };//Size=0x002C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00861
    // RuntimeId: 06180
    // TypeInfo:  0x02404048
#ifndef _UIDataBinding_
#define _UIDataBinding_
#pragma pack(push, 4)
    class UIDataBinding : public DataContainer
    {
    public:
        static __inline UIDataBinding* DefaultInstance()
        {
            return (UIDataBinding*)0xF8820398;
        }
        static __inline unsigned int ClassId()
        {
            return 861;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404048;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00862
    // RuntimeId: 06184
    // TypeInfo:  0x02404084
#ifndef _UIDynamicDataBinding_
#define _UIDynamicDataBinding_
#pragma pack(push, 4)
    class UIDynamicDataBinding : public UIDataBinding
    {
    public:
        static __inline UIDynamicDataBinding* DefaultInstance()
        {
            return (UIDynamicDataBinding*)0xF88203B8;
        }
        static __inline unsigned int ClassId()
        {
            return 862;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02404084;
        }
        Array<UIDataSourceInfo> m_Bindings; //0x0008
        bool m_Refresh; //0x000C
        char _0x000D[3];
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02027
    // RuntimeId: 06186
    // TypeInfo:  0x024040B0
#ifndef _UIScreenAsset_
#define _UIScreenAsset_
#pragma pack(push, 4)
    class UIScreenAsset : public UIGraphAsset
    {
    public:
        static __inline UIScreenAsset* DefaultInstance()
        {
            return (UIScreenAsset*)0xF883D5E8;
        }
        static __inline unsigned int ClassId()
        {
            return 2027;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024040B0;
        }
    };//Size=0x002C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00877
    // RuntimeId: 06236
    // TypeInfo:  0x0240448C
#ifndef _SplitterNode_
#define _SplitterNode_
#pragma pack(push, 4)
    class SplitterNode : public UINodeData
    {
    public:
        static __inline SplitterNode* DefaultInstance()
        {
            return (SplitterNode*)0xF8820820;
        }
        static __inline unsigned int ClassId()
        {
            return 877;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240448C;
        }
        UINodePort* m_In; //0x0014
        Array<UINodePort*> m_Outputs; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00897
    // RuntimeId: 06172
    // TypeInfo:  0x02403FB4
#ifndef _UINodeConnection_
#define _UINodeConnection_
#pragma pack(push, 4)
    class UINodeConnection : public DataContainer
    {
    public:
        static __inline UINodeConnection* DefaultInstance()
        {
            return (UINodeConnection*)0xF8820D78;
        }
        static __inline unsigned int ClassId()
        {
            return 897;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403FB4;
        }
        UINodeData* m_SourceNode; //0x0008
        UINodeData* m_TargetNode; //0x000C
        UINodePort* m_SourcePort; //0x0010
        UINodePort* m_TargetPort; //0x0014
        __int32 m_NumScreensToPop; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00898
    // RuntimeId: 06168
    // TypeInfo:  0x02403F5C
#ifndef _UINodePort_
#define _UINodePort_
#pragma pack(push, 4)
    class UINodePort : public DataContainer
    {
    public:
        static __inline UINodePort* DefaultInstance()
        {
            return (UINodePort*)0xF8820DA8;
        }
        static __inline unsigned int ClassId()
        {
            return 898;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403F5C;
        }
        char* m_Name; //0x0008
        char* m_InstanceName; //0x000C
        UIWidgetEventID m_Query; //0x0010
        bool m_AllowManualRemove; //0x0014
        char _0x0015[3];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00899
    // RuntimeId: 06170
    // TypeInfo:  0x02403F88
#ifndef _UIInputEventNodePort_
#define _UIInputEventNodePort_
#pragma pack(push, 4)
    class UIInputEventNodePort : public UINodePort
    {
    public:
        static __inline UIInputEventNodePort* DefaultInstance()
        {
            return (UIInputEventNodePort*)0xF8820DD8;
        }
        static __inline unsigned int ClassId()
        {
            return 899;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403F88;
        }
        UIInputAction m_InputEventType; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02028
    // RuntimeId: 06166
    // TypeInfo:  0x02403F30
#ifndef _UIInterruptFlow_
#define _UIInterruptFlow_
#pragma pack(push, 4)
    class UIInterruptFlow : public Asset
    {
    public:
        static __inline UIInterruptFlow* DefaultInstance()
        {
            return (UIInterruptFlow*)0xF883D628;
        }
        static __inline unsigned int ClassId()
        {
            return 2028;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403F30;
        }
        Array<InterruptFlow> m_interruptFlow; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02029
    // RuntimeId: 06162
    // TypeInfo:  0x02403EF4
#ifndef _UIAudioEventAsset_
#define _UIAudioEventAsset_
#pragma pack(push, 4)
    class UIAudioEventAsset : public Asset
    {
    public:
        static __inline UIAudioEventAsset* DefaultInstance()
        {
            return (UIAudioEventAsset*)0xF883D650;
        }
        static __inline unsigned int ClassId()
        {
            return 2029;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403EF4;
        }
        Array<UIAudioEventMapping> m_AudioEventMappings; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02030
    // RuntimeId: 06152
    // TypeInfo:  0x02403E88
#ifndef _UIEventAsset_
#define _UIEventAsset_
#pragma pack(push, 4)
    class UIEventAsset : public Asset
    {
    public:
        static __inline UIEventAsset* DefaultInstance()
        {
            return (UIEventAsset*)0xF883D678;
        }
        static __inline unsigned int ClassId()
        {
            return 2030;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403E88;
        }
        char* m_Category; //0x000C
        Array<char*> m_EventList; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02031
    // RuntimeId: 06150
    // TypeInfo:  0x02403E5C
#ifndef _UIActionData_
#define _UIActionData_
#pragma pack(push, 4)
    class UIActionData : public Asset
    {
    public:
        static __inline UIActionData* DefaultInstance()
        {
            return (UIActionData*)0xF883D6A0;
        }
        static __inline unsigned int ClassId()
        {
            return 2031;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403E5C;
        }
        Array<char*> m_ActionKeys; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00900
    // RuntimeId: 06146
    // TypeInfo:  0x02403E20
#ifndef _UIGraphPipelineSettings_
#define _UIGraphPipelineSettings_
#pragma pack(push, 4)
    class UIGraphPipelineSettings : public DataContainer
    {
    public:
        static __inline UIGraphPipelineSettings* DefaultInstance()
        {
            return (UIGraphPipelineSettings*)0xF8820E08;
        }
        static __inline unsigned int ClassId()
        {
            return 900;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403E20;
        }
        bool m_OneBundlePerGraph; //0x0008
        char _0x0009[3];
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02032
    // RuntimeId: 06140
    // TypeInfo:  0x02403DD4
#ifndef _UIFontMappingCollection_
#define _UIFontMappingCollection_
#pragma pack(push, 4)
    class UIFontMappingCollection : public Asset
    {
    public:
        static __inline UIFontMappingCollection* DefaultInstance()
        {
            return (UIFontMappingCollection*)0xF883D6C8;
        }
        static __inline unsigned int ClassId()
        {
            return 2032;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403DD4;
        }
        Array<UIFontMapping> m_Fonts; //0x000C
        Array<UITextDatabase*> m_TextDatabase; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02033
    // RuntimeId: 06136
    // TypeInfo:  0x02403D98
#ifndef _UIFontCollection_
#define _UIFontCollection_
#pragma pack(push, 4)
    class UIFontCollection : public Asset
    {
    public:
        static __inline UIFontCollection* DefaultInstance()
        {
            return (UIFontCollection*)0xF883D6F0;
        }
        static __inline unsigned int ClassId()
        {
            return 2033;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403D98;
        }
        LanguageFormat m_Language; //0x000C
        UITextDatabase* m_TextDatabase; //0x0010
        Array<UIFontAsset*> m_Fonts; //0x0014
        ResourceBundleKind m_BundleKind; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02034
    // RuntimeId: 06134
    // TypeInfo:  0x02403D6C
#ifndef _UIFontAsset_
#define _UIFontAsset_
#pragma pack(push, 4)
    class UIFontAsset : public Asset
    {
    public:
        static __inline UIFontAsset* DefaultInstance()
        {
            return (UIFontAsset*)0xF883D720;
        }
        static __inline unsigned int ClassId()
        {
            return 2034;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403D6C;
        }
        char* m_SourceFile; //0x000C
        UITextDatabase* m_TextDatabase; //0x0010
        Array<char*> m_ScaleformFontName; //0x0014
        bool m_NumericsOnly; //0x0018
        bool m_CompleteKorean; //0x0019
        bool m_CompleteJapanese; //0x001A
        bool m_CompleteTraditionalChinese; //0x001B
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02035
    // RuntimeId: 06132
    // TypeInfo:  0x02403D40
#ifndef _UIBundlesAsset_
#define _UIBundlesAsset_
#pragma pack(push, 4)
    class UIBundlesAsset : public Asset
    {
    public:
        static __inline UIBundlesAsset* DefaultInstance()
        {
            return (UIBundlesAsset*)0xF883D750;
        }
        static __inline unsigned int ClassId()
        {
            return 2035;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403D40;
        }
        Array<UIBundleAssetState> m_UIBundleAssetStateList; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02037
    // RuntimeId: 06190
    // TypeInfo:  0x024040EC
#ifndef _UIWidgetAsset_
#define _UIWidgetAsset_
#pragma pack(push, 4)
    class UIWidgetAsset : public UIAsset
    {
    public:
        static __inline UIWidgetAsset* DefaultInstance()
        {
            return (UIWidgetAsset*)0xF883D798;
        }
        static __inline unsigned int ClassId()
        {
            return 2037;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024040EC;
        }
        Array<WidgetEventQueryPair> m_WidgetEvents; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02038
    // RuntimeId: 06126
    // TypeInfo:  0x02403CD8
#ifndef _LocalizationAsset_
#define _LocalizationAsset_
#pragma pack(push, 4)
    class LocalizationAsset : public Asset
    {
    public:
        static __inline LocalizationAsset* DefaultInstance()
        {
            return (LocalizationAsset*)0xF883D7C0;
        }
        static __inline unsigned int ClassId()
        {
            return 2038;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403CD8;
        }
        Array<UITextDatabase*> m_LocalizedTexts; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02039
    // RuntimeId: 06124
    // TypeInfo:  0x02403CAC
#ifndef _UITextDatabase_
#define _UITextDatabase_
#pragma pack(push, 4)
    class UITextDatabase : public Asset
    {
    public:
        static __inline UITextDatabase* DefaultInstance()
        {
            return (UITextDatabase*)0xF883D7E8;
        }
        static __inline unsigned int ClassId()
        {
            return 2039;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403CAC;
        }
        LanguageFormat m_Language; //0x000C
        Guid m_BinaryChunk; //0x0010
        char _0x0010[16];
        unsigned __int32 m_BinaryChunkSize; //0x0020
        Guid m_HistogramChunk; //0x0024
        char _0x0024[16];
        unsigned __int32 m_HistogramChunkSize; //0x0034
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02040
    // RuntimeId: 06108
    // TypeInfo:  0x02403C10
#ifndef _UIStateAsset_
#define _UIStateAsset_
#pragma pack(push, 4)
    class UIStateAsset : public Asset
    {
    public:
        static __inline UIStateAsset* DefaultInstance()
        {
            return (UIStateAsset*)0xF883D838;
        }
        static __inline unsigned int ClassId()
        {
            return 2040;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403C10;
        }
        Array<UIComponentData*> m_UIComponents; //0x000C
        Array<UIAsset*> m_ActionscriptLibraries; //0x0010
        Array<char*> m_ActionscriptNames; //0x0014
        char* m_StateName; //0x0018
        char* m_StatePath; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02041
    // RuntimeId: 06104
    // TypeInfo:  0x02403BD4
#ifndef _UIComponentData_
#define _UIComponentData_
#pragma pack(push, 4)
    class UIComponentData : public Asset
    {
    public:
        static __inline UIComponentData* DefaultInstance()
        {
            return (UIComponentData*)0xF883D870;
        }
        static __inline unsigned int ClassId()
        {
            return 2041;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02403BD4;
        }
        char* m_ShortName; //0x000C
        Array<char*> m_DataSources; //0x0010
        UIUpdateType m_UpdateType; //0x0014
        __int32 m_UpdatesPerSecond; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00009
    // RuntimeId: 06100
    // TypeInfo:  0x02402F24
#ifndef _AnimatedPointCloud_
#define _AnimatedPointCloud_
    class AnimatedPointCloud
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 9;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402F24;
        }
        char _0x0000[352];
    };//Size=0x0160
#endif

    ////////////////////////////////////////
    // ClassId:   00010
    // RuntimeId: 06099
    // TypeInfo:  0x02402EE0
#ifndef _MeshSet_
#define _MeshSet_
    class MeshSet
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 10;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402EE0;
        }
        char _0x0000[256];
    };//Size=0x0100
#endif

    ////////////////////////////////////////
    // ClassId:   02148
    // RuntimeId: 06091
    // TypeInfo:  0x02402D98
#ifndef _DebugConstantData_
#define _DebugConstantData_
#pragma pack(push, 4)
    class DebugConstantData : public Asset
    {
    public:
        static __inline DebugConstantData* DefaultInstance()
        {
            return (DebugConstantData*)0xF883F700;
        }
        static __inline unsigned int ClassId()
        {
            return 2148;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402D98;
        }
        float m_BotDebugDistance; //0x000C
        float m_InViewModeFOV; //0x0010
        unsigned __int32 m_GraphDataBuffer; //0x0014
        float m_MinDecisionTime; //0x0018
        bool m_InaccuracyEnabled; //0x001C
        char _0x001D[3];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02149
    // RuntimeId: 06089
    // TypeInfo:  0x02402D6C
#ifndef _AISettingsData_
#define _AISettingsData_
#pragma pack(push, 4)
    class AISettingsData : public Asset
    {
    public:
        static __inline AISettingsData* DefaultInstance()
        {
            return (AISettingsData*)0xF883F738;
        }
        static __inline unsigned int ClassId()
        {
            return 2149;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402D6C;
        }
        SoundEnvironmentConstantData* m_SoundEnvironmentConstants; //0x000C
        CoverConstantData* m_CoverConstants; //0x0010
        DecisionConstantData* m_DecisionConstants; //0x0014
        PositionEvaluationConstantData* m_PositionEvaluationConstants; //0x0018
        TimingConstantData* m_TimingConstants; //0x001C
        DebugConstantData* m_DebugConstants; //0x0020
        ReadinessLevels m_ReadinessLevels; //0x0024
        BehaviourTemplateData* m_DefaultBehaviourTemplate; //0x0048
        AIVehicleBehaviourData* m_DefaultVehicleType; //0x004C
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01044
    // RuntimeId: 04619
    // TypeInfo:  0x023F55CC
#ifndef _GameAIDifficultyData_
#define _GameAIDifficultyData_
#pragma pack(push, 4)
    class GameAIDifficultyData : public DataContainer
    {
    public:
        static __inline GameAIDifficultyData* DefaultInstance()
        {
            return (GameAIDifficultyData*)0xF88232B8;
        }
        static __inline unsigned int ClassId()
        {
            return 1044;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023F55CC;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02196
    // RuntimeId: 05075
    // TypeInfo:  0x023FA188
#ifndef _GameSensingTemplateData_
#define _GameSensingTemplateData_
#pragma pack(push, 4)
    class GameSensingTemplateData : public Asset
    {
    public:
        static __inline GameSensingTemplateData* DefaultInstance()
        {
            return (GameSensingTemplateData*)0xF8840420;
        }
        static __inline unsigned int ClassId()
        {
            return 2196;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FA188;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01557
    // RuntimeId: 00398
    // TypeInfo:  0x023C667C
#ifndef _BaseShapeData_
#define _BaseShapeData_
#pragma pack(push, 4)
    class BaseShapeData : public GameObjectData
    {
    public:
        static __inline BaseShapeData* DefaultInstance()
        {
            return (BaseShapeData*)0xF882BA78;
        }
        static __inline unsigned int ClassId()
        {
            return 1557;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C667C;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01702
    // RuntimeId: 06079
    // TypeInfo:  0x02402CAC
#ifndef _SensingManagerEntityData_
#define _SensingManagerEntityData_
#pragma pack(push, 4)
    class SensingManagerEntityData : public EntityData
    {
    public:
        static __inline SensingManagerEntityData* DefaultInstance()
        {
            return (SensingManagerEntityData*)0xF88324A8;
        }
        static __inline unsigned int ClassId()
        {
            return 1702;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402CAC;
        }
        Array<SensingSphere> m_SenseTerrainAreas; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01593
    // RuntimeId: 06075
    // TypeInfo:  0x02402C70
#ifndef _SensingComponentData_
#define _SensingComponentData_
#pragma pack(push, 16)
    class SensingComponentData : public ComponentData
    {
    public:
        static __inline SensingComponentData* DefaultInstance()
        {
            return (SensingComponentData*)0xF882D0E0;
        }
        static __inline unsigned int ClassId()
        {
            return 1593;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402C70;
        }
        SensingTemplateData* m_Template; //0x0060
        SensingSettings* m_Settings; //0x0064
        bool m_Enabled; //0x0068
        bool m_SharedPlayerMemory; //0x0069
        bool m_UseWeaponTransform; //0x006A
        char _0x006B[5];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02151
    // RuntimeId: 06073
    // TypeInfo:  0x02402C44
#ifndef _SensingSettings_
#define _SensingSettings_
#pragma pack(push, 8)
    class SensingSettings : public Asset
    {
    public:
        static __inline SensingSettings* DefaultInstance()
        {
            return (SensingSettings*)0xF883F818;
        }
        static __inline unsigned int ClassId()
        {
            return 2151;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402C44;
        }
        char _0x000C[4];
        double m_SensingTimeSpan; //0x0010
        double m_AttackerTrackTime; //0x0018
        double m_LineOfSightTestTime; //0x0020
        __int32 m_MaxRays; //0x0028
        VisionBoxSettings m_CharacterVisionBoxSettings; //0x002C
        VisionBoxSettings m_VehicleVisionBoxSettings; //0x003C
        float m_CloseFireImpactDistance; //0x004C
        float m_CloseExplosiveImpactDistance; //0x0050
        float m_CloseTrajectoryDistance; //0x0054
        float m_ImpactSenseDistance; //0x0058
        float m_MaxVolume; //0x005C
        float m_MaxSize; //0x0060
        float m_MaxSpeed; //0x0064
        float m_VolumeModifier; //0x0068
        float m_MovementModifier; //0x006C
        float m_LuckModifier; //0x0070
        float m_BackgroundLoudnessFactor; //0x0074
        float m_MotionSizeFactor; //0x0078
        float m_MotionSpeedFactor; //0x007C
        float m_MotionPeripheralityFactor; //0x0080
        float m_MotionDistanceFactor; //0x0084
        float m_SmokeSphereRadius; //0x0088
        float m_SmokeSphereDuration; //0x008C
        float m_SpawnOutOfLOSRaycastHeight; //0x0090
        float m_SpawnOutOfLOSTraceDistance; //0x0094
        float m_SpawnOutOfLOSRaycastDistance; //0x0098
        float m_SpawnOutOfLOSRadius; //0x009C
        SensingTemplateData* m_DefaultTemplate; //0x00A0
        char _0x00A4[4];
    };//Size=0x00A8
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02152
    // RuntimeId: 06067
    // TypeInfo:  0x02402BF8
#ifndef _OrderSettings_
#define _OrderSettings_
#pragma pack(push, 4)
    class OrderSettings : public Asset
    {
    public:
        static __inline OrderSettings* DefaultInstance()
        {
            return (OrderSettings*)0xF883F8D8;
        }
        static __inline unsigned int ClassId()
        {
            return 2152;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402BF8;
        }
        Array<OrderReadiness*> m_Orders; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00906
    // RuntimeId: 06009
    // TypeInfo:  0x02402830
#ifndef _UrgencyUserData_
#define _UrgencyUserData_
#pragma pack(push, 4)
    class UrgencyUserData : public DataContainer
    {
    public:
        static __inline UrgencyUserData* DefaultInstance()
        {
            return (UrgencyUserData*)0xF8820F48;
        }
        static __inline unsigned int ClassId()
        {
            return 906;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402830;
        }
        UrgencyUserData* m_Base; //0x0008
        Array<UrgencyModifierData> m_UrgencyModifiers; //0x000C
        Array<UrgencySetData*> m_ModifierSets; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01703
    // RuntimeId: 06061
    // TypeInfo:  0x02402B90
#ifndef _OrderEntityData_
#define _OrderEntityData_
#pragma pack(push, 4)
    class OrderEntityData : public EntityData
    {
    public:
        static __inline OrderEntityData* DefaultInstance()
        {
            return (OrderEntityData*)0xF88324D0;
        }
        static __inline unsigned int ClassId()
        {
            return 1703;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402B90;
        }
        char* m_DebugName; //0x000C
        float m_IssueOrderDelay; //0x0010
        float m_OnCompleteTimeOut; //0x0014
        float m_OnFailedTimeOut; //0x0018
        ReadinessLevel m_ReadinessOnStart; //0x001C
        bool m_Enabled; //0x0020
        char _0x0021[3];
    };//Size=0x0024
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01871
    // RuntimeId: 06059
    // TypeInfo:  0x02402B64
#ifndef _LookAtEntityData_
#define _LookAtEntityData_
#pragma pack(push, 16)
    class LookAtEntityData : public SpatialEntityData
    {
    public:
        static __inline LookAtEntityData* DefaultInstance()
        {
            return (LookAtEntityData*)0xF8835AE0;
        }
        static __inline unsigned int ClassId()
        {
            return 1871;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402B64;
        }
        bool m_RunOnce; //0x0050
        bool m_UseStaticDirection; //0x0051
        bool m_Enabled; //0x0052
        char _0x0053[13];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02160
    // RuntimeId: 05883
    // TypeInfo:  0x024013DC
#ifndef _GameAIWeaponData_
#define _GameAIWeaponData_
#pragma pack(push, 4)
    class GameAIWeaponData : public Asset
    {
    public:
        static __inline GameAIWeaponData* DefaultInstance()
        {
            return (GameAIWeaponData*)0xF883FAB8;
        }
        static __inline unsigned int ClassId()
        {
            return 2160;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024013DC;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00901
    // RuntimeId: 06043
    // TypeInfo:  0x02402AAC
#ifndef _MobilityData_
#define _MobilityData_
#pragma pack(push, 4)
    class MobilityData : public DataContainer
    {
    public:
        static __inline MobilityData* DefaultInstance()
        {
            return (MobilityData*)0xF8820E28;
        }
        static __inline unsigned int ClassId()
        {
            return 901;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402AAC;
        }
        float m_MaxSpeed; //0x0008
        bool m_Use3DWaypoints; //0x000C
        char _0x000D[3];
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00902
    // RuntimeId: 06041
    // TypeInfo:  0x02402A80
#ifndef _ArmamentData_
#define _ArmamentData_
#pragma pack(push, 4)
    class ArmamentData : public DataContainer
    {
    public:
        static __inline ArmamentData* DefaultInstance()
        {
            return (ArmamentData*)0xF8820E50;
        }
        static __inline unsigned int ClassId()
        {
            return 902;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402A80;
        }
        __int32 m_ThreatLength; //0x0008
        TurretData* m_TurretData; //0x000C
        bool m_IsAntiAircraft; //0x0010
        char _0x0011[3];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00903
    // RuntimeId: 06039
    // TypeInfo:  0x02402A54
#ifndef _TurretData_
#define _TurretData_
#pragma pack(push, 4)
    class TurretData : public DataContainer
    {
    public:
        static __inline TurretData* DefaultInstance()
        {
            return (TurretData*)0xF8820E78;
        }
        static __inline unsigned int ClassId()
        {
            return 903;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402A54;
        }
        float m_PitchP; //0x0008
        float m_YawP; //0x000C
        float m_FakeShootSpaceMinDistance; //0x0010
        float m_FakeShootSpaceMaxDistance; //0x0014
        AIAimingConstraintsData* m_AimingConstraints; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00904
    // RuntimeId: 06037
    // TypeInfo:  0x02402A28
#ifndef _AIAimingConstraintsData_
#define _AIAimingConstraintsData_
#pragma pack(push, 4)
    class AIAimingConstraintsData : public DataContainer
    {
    public:
        static __inline AIAimingConstraintsData* DefaultInstance()
        {
            return (AIAimingConstraintsData*)0xF8820EA8;
        }
        static __inline unsigned int ClassId()
        {
            return 904;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402A28;
        }
        float m_MinYaw; //0x0008
        float m_MaxYaw; //0x000C
        float m_MinPitch; //0x0010
        float m_MaxPitch; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02162
    // RuntimeId: 05881
    // TypeInfo:  0x024013B0
#ifndef _GameAIEntryData_
#define _GameAIEntryData_
#pragma pack(push, 4)
    class GameAIEntryData : public Asset
    {
    public:
        static __inline GameAIEntryData* DefaultInstance()
        {
            return (GameAIEntryData*)0xF883FB88;
        }
        static __inline unsigned int ClassId()
        {
            return 2162;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024013B0;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02153
    // RuntimeId: 06033
    // TypeInfo:  0x024029D0
#ifndef _SoundEnvironmentConstantData_
#define _SoundEnvironmentConstantData_
#pragma pack(push, 4)
    class SoundEnvironmentConstantData : public Asset
    {
    public:
        static __inline SoundEnvironmentConstantData* DefaultInstance()
        {
            return (SoundEnvironmentConstantData*)0xF883F900;
        }
        static __inline unsigned int ClassId()
        {
            return 2153;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024029D0;
        }
        float m_HumanPlayerSoldierMovementVolumeOverride; //0x000C
        float m_MemoryTime; //0x0010
        float m_MinimumLoudness; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01872
    // RuntimeId: 06031
    // TypeInfo:  0x024029A4
#ifndef _CoverEntityData_
#define _CoverEntityData_
#pragma pack(push, 16)
    class CoverEntityData : public SpatialEntityData
    {
    public:
        static __inline CoverEntityData* DefaultInstance()
        {
            return (CoverEntityData*)0xF8835B80;
        }
        static __inline unsigned int ClassId()
        {
            return 1872;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024029A4;
        }
        float m_Width; //0x0050
        CoverType m_CoverType; //0x0054
        Array<CoverSlot> m_Slots; //0x0058
        bool m_RightEdgeBlocked; //0x005C
        bool m_TopBlocked; //0x005D
        bool m_LeftEdgeBlocked; //0x005E
        char _0x005F[1];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02154
    // RuntimeId: 06025
    // TypeInfo:  0x02402958
#ifndef _CoverConstantData_
#define _CoverConstantData_
#pragma pack(push, 4)
    class CoverConstantData : public Asset
    {
    public:
        static __inline CoverConstantData* DefaultInstance()
        {
            return (CoverConstantData*)0xF883F930;
        }
        static __inline unsigned int ClassId()
        {
            return 2154;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402958;
        }
        float m_SlotSize; //0x000C
        float m_SlotSpacing; //0x0010
        float m_SlotEdgeDistance; //0x0014
        float m_SlotBlockedEdgeDistance; //0x0018
        float m_MinimumOpenCoverWidth; //0x001C
        float m_ProneHeight; //0x0020
        float m_CrouchHeight; //0x0024
        float m_MediumHeight; //0x0028
        float m_StandHeight; //0x002C
        __int32 m_MaxCoversInMemory; //0x0030
        float m_SearchRadius; //0x0034
        float m_ProneCoverModifier; //0x0038
        float m_CrouchCoverModifier; //0x003C
        float m_MediumCoverModifier; //0x0040
        float m_StandCoverModifier; //0x0044
        float m_IntermediateCoverSlotModifier; //0x0048
        float m_DistanceEvaluationWeight; //0x004C
        float m_EnemiesEvaluationWeight; //0x0050
        float m_AttackPositionEvaluationWeight; //0x0054
        float m_OptimalWeaponDistanceEvaluationWeight; //0x0058
        float m_DislikePreviousCoverWeight; //0x005C
        float m_MaxHeightDifference; //0x0060
        float m_SwitchCoverUrgencyThreshold; //0x0064
        float m_ExtraCoverSize; //0x0068
        float m_ReevaluationTime; //0x006C
        CoverSelectionMethod m_CoverSelectionMethod; //0x0070
        float m_ThreatRadius; //0x0074
        float m_InCoverDistance; //0x0078
        float m_MinAttackableEnemyDistance; //0x007C
        float m_CoverFailIgnoreTime; //0x0080
        float m_StartMeleeFromCoverDistance; //0x0084
        float m_ContinueMeleeFromCoverDistance; //0x0088
    };//Size=0x008C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01594
    // RuntimeId: 06021
    // TypeInfo:  0x0240291C
#ifndef _TargetEvaluatorComponentData_
#define _TargetEvaluatorComponentData_
#pragma pack(push, 16)
    class TargetEvaluatorComponentData : public ComponentData
    {
    public:
        static __inline TargetEvaluatorComponentData* DefaultInstance()
        {
            return (TargetEvaluatorComponentData*)0xF882D190;
        }
        static __inline unsigned int ClassId()
        {
            return 1594;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240291C;
        }
        float m_UpdateInterval; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02155
    // RuntimeId: 06019
    // TypeInfo:  0x024028F0
#ifndef _PositionEvaluationConstantData_
#define _PositionEvaluationConstantData_
#pragma pack(push, 4)
    class PositionEvaluationConstantData : public Asset
    {
    public:
        static __inline PositionEvaluationConstantData* DefaultInstance()
        {
            return (PositionEvaluationConstantData*)0xF883F9D0;
        }
        static __inline unsigned int ClassId()
        {
            return 2155;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024028F0;
        }
        float m_OwnRandomPositionsRadius; //0x000C
        float m_LeaderRandomPositionsRadius; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02156
    // RuntimeId: 06017
    // TypeInfo:  0x024028C4
#ifndef _DecisionConstantData_
#define _DecisionConstantData_
#pragma pack(push, 4)
    class DecisionConstantData : public Asset
    {
    public:
        static __inline DecisionConstantData* DefaultInstance()
        {
            return (DecisionConstantData*)0xF883F9F8;
        }
        static __inline unsigned int ClassId()
        {
            return 2156;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024028C4;
        }
        float m_NewEnemyDecideMaxDistance; //0x000C
        bool m_AllowEmergencyGoalInterrupt; //0x0010
        bool m_AllowUninterruptibleBehaviours; //0x0011
        char _0x0012[2];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02157
    // RuntimeId: 06015
    // TypeInfo:  0x02402898
#ifndef _TimingConstantData_
#define _TimingConstantData_
#pragma pack(push, 4)
    class TimingConstantData : public Asset
    {
    public:
        static __inline TimingConstantData* DefaultInstance()
        {
            return (TimingConstantData*)0xF883FA20;
        }
        static __inline unsigned int ClassId()
        {
            return 2157;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402898;
        }
        float m_UpdateTimePerFrame; //0x000C
        SubsystemTimingConfigData m_SubsystemTimeParts; //0x0010
        Array<BotPriorityConfigData*> m_PriorityClasses; //0x0028
    };//Size=0x002C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00905
    // RuntimeId: 06011
    // TypeInfo:  0x0240285C
#ifndef _BotPriorityConfigData_
#define _BotPriorityConfigData_
#pragma pack(push, 16)
    class BotPriorityConfigData : public DataContainer
    {
    public:
        static __inline BotPriorityConfigData* DefaultInstance()
        {
            return (BotPriorityConfigData*)0xF8820EF0;
        }
        static __inline unsigned int ClassId()
        {
            return 905;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240285C;
        }
        char _0x0008[8];
        Vec3 m_DebugColor; //0x0010
        float m_Distance; //0x0020
        __int32 m_Period; //0x0024
        float m_AngleOffset; //0x0028
        bool m_AppliesToExecution; //0x002C
        bool m_AppliesToDecisions; //0x002D
        char _0x002E[2];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00907
    // RuntimeId: 06065
    // TypeInfo:  0x02402BCC
#ifndef _OrderReadiness_
#define _OrderReadiness_
#pragma pack(push, 4)
    class OrderReadiness : public UrgencyUserData
    {
    public:
        static __inline OrderReadiness* DefaultInstance()
        {
            return (OrderReadiness*)0xF8820F70;
        }
        static __inline unsigned int ClassId()
        {
            return 907;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402BCC;
        }
        char* m_OrderType; //0x0014
        ReadinessState m_MinimumReadiness; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00909
    // RuntimeId: 06007
    // TypeInfo:  0x02402804
#ifndef _UrgencySetData_
#define _UrgencySetData_
#pragma pack(push, 4)
    class UrgencySetData : public DataContainer
    {
    public:
        static __inline UrgencySetData* DefaultInstance()
        {
            return (UrgencySetData*)0xF8820FD0;
        }
        static __inline unsigned int ClassId()
        {
            return 909;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402804;
        }
        char* m_Name; //0x0008
        Array<UrgencyModifierData> m_UrgencyModifiers; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02194
    // RuntimeId: 05077
    // TypeInfo:  0x023FA1B4
#ifndef _GameBehaviourTemplateData_
#define _GameBehaviourTemplateData_
#pragma pack(push, 4)
    class GameBehaviourTemplateData : public Asset
    {
    public:
        static __inline GameBehaviourTemplateData* DefaultInstance()
        {
            return (GameBehaviourTemplateData*)0xF8840290;
        }
        static __inline unsigned int ClassId()
        {
            return 2194;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FA1B4;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02158
    // RuntimeId: 05995
    // TypeInfo:  0x0240276C
#ifndef _AIVehicleTypes_
#define _AIVehicleTypes_
#pragma pack(push, 4)
    class AIVehicleTypes : public Asset
    {
    public:
        static __inline AIVehicleTypes* DefaultInstance()
        {
            return (AIVehicleTypes*)0xF883FA60;
        }
        static __inline unsigned int ClassId()
        {
            return 2158;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240276C;
        }
        Array<AIVehicleBehaviourData*> m_VehicleTypes; //0x000C
        Array<BehaviourData*> m_Goals; //0x0010
        Array<BehaviourData*> m_Intents; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00908
    // RuntimeId: 05993
    // TypeInfo:  0x02402740
#ifndef _BehaviourData_
#define _BehaviourData_
#pragma pack(push, 4)
    class BehaviourData : public UrgencyUserData
    {
    public:
        static __inline BehaviourData* DefaultInstance()
        {
            return (BehaviourData*)0xF8820FA0;
        }
        static __inline unsigned int ClassId()
        {
            return 908;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402740;
        }
        char* m_Name; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00910
    // RuntimeId: 05991
    // TypeInfo:  0x02402714
#ifndef _AIVehicleBehaviourData_
#define _AIVehicleBehaviourData_
#pragma pack(push, 4)
    class AIVehicleBehaviourData : public DataContainer
    {
    public:
        static __inline AIVehicleBehaviourData* DefaultInstance()
        {
            return (AIVehicleBehaviourData*)0xF8820FF8;
        }
        static __inline unsigned int ClassId()
        {
            return 910;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402714;
        }
        char* m_Name; //0x0008
        Array<char*> m_Controls; //0x000C
        Array<char*> m_Behaviours; //0x0010
        Array<char*> m_Goals; //0x0014
        Array<IntentData> m_Intents; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02168
    // RuntimeId: 05640
    // TypeInfo:  0x023FF6F8
#ifndef _GameAISystem_
#define _GameAISystem_
#pragma pack(push, 4)
    class GameAISystem : public Asset
    {
    public:
        static __inline GameAISystem* DefaultInstance()
        {
            return (GameAISystem*)0xF883FC80;
        }
        static __inline unsigned int ClassId()
        {
            return 2168;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF6F8;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00408
    // RuntimeId: 05981
    // TypeInfo:  0x02401CB8
#ifndef _ServerSensingManagerEntity_
#define _ServerSensingManagerEntity_
    class ServerSensingManagerEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 408;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401CB8;
        }
        char _0x000C[10580];
    };//Size=0x2960
#endif

    ////////////////////////////////////////
    // ClassId:   00227
    // RuntimeId: 03761
    // TypeInfo:  0x023EBF2C
#ifndef _Component_
#define _Component_
    class Component : public EntityBusPeer
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 227;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023EBF2C;
        }
        char _0x0004[12];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00409
    // RuntimeId: 05979
    // TypeInfo:  0x02401C68
#ifndef _ServerOrderEntity_
#define _ServerOrderEntity_
    class ServerOrderEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 409;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401C68;
        }
        char _0x000C[196];
    };//Size=0x00D0
#endif

    ////////////////////////////////////////
    // ClassId:   00421
    // RuntimeId: 05978
    // TypeInfo:  0x02401C40
#ifndef _ClientLookAtEntity_
#define _ClientLookAtEntity_
    class ClientLookAtEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 421;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401C40;
        }
        char _0x000C[516];
    };//Size=0x0210
#endif

    ////////////////////////////////////////
    // ClassId:   00620
    // RuntimeId: 05977
    // TypeInfo:  0x02401C18
#ifndef _ServerCoverEntity_
#define _ServerCoverEntity_
    class ServerCoverEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 620;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401C18;
        }
        char _0x0010[36];
    };//Size=0x0034
#endif

    ////////////////////////////////////////
    // ClassId:   00328
    // RuntimeId: 03205
    // TypeInfo:  0x023E44B4
#ifndef _ServerComponent_
#define _ServerComponent_
    class ServerComponent : public Component
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 328;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023E44B4;
        }
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00011
    // RuntimeId: 05974
    // TypeInfo:  0x02401BA0
#ifndef _Navigation_
#define _Navigation_
    class Navigation
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 11;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401BA0;
        }
        char _0x0000[8];
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00012
    // RuntimeId: 05975
    // TypeInfo:  0x02401BC8
#ifndef _NoNavigation_
#define _NoNavigation_
    class NoNavigation : public Navigation
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 12;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401BC8;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   02159
    // RuntimeId: 05969
    // TypeInfo:  0x02401924
#ifndef _BlueprintBundleMetadataContainer_
#define _BlueprintBundleMetadataContainer_
#pragma pack(push, 4)
    class BlueprintBundleMetadataContainer : public Asset
    {
    public:
        static __inline BlueprintBundleMetadataContainer* DefaultInstance()
        {
            return (BlueprintBundleMetadataContainer*)0xF883FA90;
        }
        static __inline unsigned int ClassId()
        {
            return 2159;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401924;
        }
        Array<BlueprintContainerItem*> m_Items; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00911
    // RuntimeId: 05967
    // TypeInfo:  0x024018F8
#ifndef _BlueprintContainerItem_
#define _BlueprintContainerItem_
#pragma pack(push, 4)
    class BlueprintContainerItem : public DataContainer
    {
    public:
        static __inline BlueprintContainerItem* DefaultInstance()
        {
            return (BlueprintContainerItem*)0xF8821028;
        }
        static __inline unsigned int ClassId()
        {
            return 911;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024018F8;
        }
        BlueprintBundleMetadata* m_Metadata; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00912
    // RuntimeId: 05961
    // TypeInfo:  0x02401890
#ifndef _BlueprintBundleMetadata_
#define _BlueprintBundleMetadata_
#pragma pack(push, 4)
    class BlueprintBundleMetadata : public DataContainer
    {
    public:
        static __inline BlueprintBundleMetadata* DefaultInstance()
        {
            return (BlueprintBundleMetadata*)0xF8821048;
        }
        static __inline unsigned int ClassId()
        {
            return 912;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401890;
        }
        char* m_BundlePathName; //0x0008
        char* m_BundleName; //0x000C
        char* m_BlueprintName; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00913
    // RuntimeId: 05965
    // TypeInfo:  0x024018CC
#ifndef _ExampleVehicleBlueprintBundleMetadata_
#define _ExampleVehicleBlueprintBundleMetadata_
#pragma pack(push, 4)
    class ExampleVehicleBlueprintBundleMetadata : public BlueprintBundleMetadata
    {
    public:
        static __inline ExampleVehicleBlueprintBundleMetadata* DefaultInstance()
        {
            return (ExampleVehicleBlueprintBundleMetadata*)0xF8821070;
        }
        static __inline unsigned int ClassId()
        {
            return 913;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024018CC;
        }
        ExampleVehicleType m_ExampleVehicleType; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01884
    // RuntimeId: 00212
    // TypeInfo:  0x023C5058
#ifndef _GameEntityData_
#define _GameEntityData_
#pragma pack(push, 16)
    class GameEntityData : public SpatialEntityData
    {
    public:
        static __inline GameEntityData* DefaultInstance()
        {
            return (GameEntityData*)0xF8836400;
        }
        static __inline unsigned int ClassId()
        {
            return 1884;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C5058;
        }
        Array<GameObjectData*> m_Components; //0x0050
        bool m_Enabled; //0x0054
        __int8 m_RuntimeComponentCount; //0x0055
        char _0x0056[10];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01886
    // RuntimeId: 05957
    // TypeInfo:  0x02401838
#ifndef _BlueprintBundleLoaderEntityData_
#define _BlueprintBundleLoaderEntityData_
#pragma pack(push, 16)
    class BlueprintBundleLoaderEntityData : public GameEntityData
    {
    public:
        static __inline BlueprintBundleLoaderEntityData* DefaultInstance()
        {
            return (BlueprintBundleLoaderEntityData*)0xF8836550;
        }
        static __inline unsigned int ClassId()
        {
            return 1886;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401838;
        }
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01887
    // RuntimeId: 05955
    // TypeInfo:  0x0240180C
#ifndef _BlueprintBundleSelectorEntityData_
#define _BlueprintBundleSelectorEntityData_
#pragma pack(push, 16)
    class BlueprintBundleSelectorEntityData : public GameEntityData
    {
    public:
        static __inline BlueprintBundleSelectorEntityData* DefaultInstance()
        {
            return (BlueprintBundleSelectorEntityData*)0xF88365F0;
        }
        static __inline unsigned int ClassId()
        {
            return 1887;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240180C;
        }
        SpawnEntitySelector* m_BlueprintSelector; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01952
    // RuntimeId: 04656
    // TypeInfo:  0x023F584C
#ifndef _GamePhysicsEntityData_
#define _GamePhysicsEntityData_
#pragma pack(push, 16)
    class GamePhysicsEntityData : public GameEntityData
    {
    public:
        static __inline GamePhysicsEntityData* DefaultInstance()
        {
            return (GamePhysicsEntityData*)0xF8839910;
        }
        static __inline unsigned int ClassId()
        {
            return 1952;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023F584C;
        }
        PhysicsEntityData* m_PhysicsData; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02384
    // RuntimeId: 00436
    // TypeInfo:  0x023C69A4
#ifndef _TreeBase_
#define _TreeBase_
#pragma pack(push, 4)
    class TreeBase : public Asset
    {
    public:
        static __inline TreeBase* DefaultInstance()
        {
            return (TreeBase*)0xF8842A28;
        }
        static __inline unsigned int ClassId()
        {
            return 2384;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C69A4;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02385
    // RuntimeId: 05943
    // TypeInfo:  0x02401728
#ifndef _AwardableTreeBase_
#define _AwardableTreeBase_
#pragma pack(push, 4)
    class AwardableTreeBase : public TreeBase
    {
    public:
        static __inline AwardableTreeBase* DefaultInstance()
        {
            return (AwardableTreeBase*)0xF8842A48;
        }
        static __inline unsigned int ClassId()
        {
            return 2385;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401728;
        }
        StatCategoryTreeCollection* m_StatCategoryTreeCollection; //0x000C
        Array<CriteriaData*> m_GeneralCriteria; //0x0010
        bool m_GeneralStatistics; //0x0014
        char _0x0015[3];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01467
    // RuntimeId: 00434
    // TypeInfo:  0x023C6978
#ifndef _TreeNodeBase_
#define _TreeNodeBase_
#pragma pack(push, 4)
    class TreeNodeBase : public DataContainer
    {
    public:
        static __inline TreeNodeBase* DefaultInstance()
        {
            return (TreeNodeBase*)0xF8829C18;
        }
        static __inline unsigned int ClassId()
        {
            return 1467;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C6978;
        }
        char* m_NodeName; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01468
    // RuntimeId: 05929
    // TypeInfo:  0x02401610
#ifndef _AbstractAwardData_
#define _AbstractAwardData_
#pragma pack(push, 4)
    class AbstractAwardData : public TreeNodeBase
    {
    public:
        static __inline AbstractAwardData* DefaultInstance()
        {
            return (AbstractAwardData*)0xF8829C38;
        }
        static __inline unsigned int ClassId()
        {
            return 1468;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401610;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00914
    // RuntimeId: 05937
    // TypeInfo:  0x024016A4
#ifndef _AwardStarNameData_
#define _AwardStarNameData_
#pragma pack(push, 4)
    class AwardStarNameData : public DataContainer
    {
    public:
        static __inline AwardStarNameData* DefaultInstance()
        {
            return (AwardStarNameData*)0xF88210A0;
        }
        static __inline unsigned int ClassId()
        {
            return 914;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024016A4;
        }
        Array<AwardStarNameInstance> m_NameInstances; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01469
    // RuntimeId: 05933
    // TypeInfo:  0x02401668
#ifndef _AwardData_
#define _AwardData_
#pragma pack(push, 4)
    class AwardData : public AbstractAwardData
    {
    public:
        static __inline AwardData* DefaultInstance()
        {
            return (AwardData*)0xF8829C58;
        }
        static __inline unsigned int ClassId()
        {
            return 1469;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401668;
        }
        Array<AwardData*> m_FilteredChildAwards; //0x000C
        Array<CriteriaData*> m_Criteria; //0x0010
        char* m_Code; //0x0014
        char* m_Description; //0x0018
        char* m_NameSid; //0x001C
        AwardKitAssociation m_KitAssociation; //0x0020
        char* m_ImageName; //0x0024
        char* m_ImageSmallName; //0x0028
        char* m_ImageFancyName; //0x002C
        char* m_SoundName; //0x0030
        AwardType m_Repeat; //0x0034
        Array<char*> m_Licenses; //0x0038
        unsigned __int32 m_MaxRepetitions; //0x003C
        Array<CriteriaAward> m_Dependencies; //0x0040
        AwardGroup m_Group; //0x0044
        StatsMultiplicity m_Multiplicity; //0x0048
        CriteriaGateList* m_UnlockGates; //0x004C
        AwardData* m_ParentAward; //0x0050
        float m_Score; //0x0054
        ScoringBucket m_Bucket; //0x0058
        Array<BasicUnlockInfo> m_UnlockInfos; //0x005C
        bool m_ActiveOnCreation; //0x0060
        bool m_Visible; //0x0061
        char _0x0062[2];
    };//Size=0x0064
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01472
    // RuntimeId: 05931
    // TypeInfo:  0x0240163C
#ifndef _AwardHeaderData_
#define _AwardHeaderData_
#pragma pack(push, 4)
    class AwardHeaderData : public AbstractAwardData
    {
    public:
        static __inline AwardHeaderData* DefaultInstance()
        {
            return (AwardHeaderData*)0xF8829DC8;
        }
        static __inline unsigned int ClassId()
        {
            return 1472;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240163C;
        }
        AwardGroup m_Group; //0x000C
        StatsMultiplicity m_Multiplicity; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01471
    // RuntimeId: 05939
    // TypeInfo:  0x024016D0
#ifndef _AwardStarData_
#define _AwardStarData_
#pragma pack(push, 4)
    class AwardStarData : public AwardData
    {
    public:
        static __inline AwardStarData* DefaultInstance()
        {
            return (AwardStarData*)0xF8829D48;
        }
        static __inline unsigned int ClassId()
        {
            return 1471;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024016D0;
        }
        AwardStarNameData* m_StarTemplate; //0x0064
    };//Size=0x0068
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01004
    // RuntimeId: 05114
    // TypeInfo:  0x023FA450
#ifndef _CriteriaData_
#define _CriteriaData_
#pragma pack(push, 4)
    class CriteriaData : public DataContainer
    {
    public:
        static __inline CriteriaData* DefaultInstance()
        {
            return (CriteriaData*)0xF8822988;
        }
        static __inline unsigned int ClassId()
        {
            return 1004;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FA450;
        }
        float m_CompletionValue; //0x0008
        CriteriaGateList* m_GateList; //0x000C
        StatEvent m_Measuring; //0x0010
        StatsCategoryBaseData* m_ParamX; //0x0014
        StatsCategoryBaseData* m_ParamY; //0x0018
        Array<StatsCategoryBaseData*> m_OrParamsX; //0x001C
        CriteriaType m_CriteriaType; //0x0020
        char* m_DescriptionSid; //0x0024
        float m_ScaleFactor; //0x0028
        float m_Scale; //0x002C
        bool m_ShouldSummarize; //0x0030
        bool m_ShouldHide; //0x0031
        bool m_CountEvents; //0x0032
        char _0x0033[1];
    };//Size=0x0034
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00915
    // RuntimeId: 05921
    // TypeInfo:  0x02401598
#ifndef _CriteriaStarCategoryData_
#define _CriteriaStarCategoryData_
#pragma pack(push, 4)
    class CriteriaStarCategoryData : public DataContainer
    {
    public:
        static __inline CriteriaStarCategoryData* DefaultInstance()
        {
            return (CriteriaStarCategoryData*)0xF88210C0;
        }
        static __inline unsigned int ClassId()
        {
            return 915;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401598;
        }
        Array<CriteriaStarCategoryInstance> m_CriteriaInstances; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01813
    // RuntimeId: 00368
    // TypeInfo:  0x023C5C54
#ifndef _CustomSequenceTrackData_
#define _CustomSequenceTrackData_
#pragma pack(push, 4)
    class CustomSequenceTrackData : public EntityData
    {
    public:
        static __inline CustomSequenceTrackData* DefaultInstance()
        {
            return (CustomSequenceTrackData*)0xF8834148;
        }
        static __inline unsigned int ClassId()
        {
            return 1813;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C5C54;
        }
        char* m_TrackName; //0x000C
        Array<CustomSequenceTrackLinkMapping*> m_InputLinkMap; //0x0010
        Array<CustomSequenceTrackLinkMapping*> m_OutputLinkMap; //0x0014
        Array<CustomSequenceTrackEventMapping*> m_EventMap; //0x0018
        Array<CustomSequenceTrackPropertyMapping*> m_SourcePropertyMap; //0x001C
        Array<CustomSequenceTrackPropertyMapping*> m_TargetPropertyMap; //0x0020
        Array<CustomSequenceTrackPropertyMapping*> m_SourceAndTargetPropertyMap; //0x0024
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00916
    // RuntimeId: 05907
    // TypeInfo:  0x024014F0
#ifndef _AntTrackItemData_
#define _AntTrackItemData_
#pragma pack(push, 4)
    class AntTrackItemData : public DataContainer
    {
    public:
        static __inline AntTrackItemData* DefaultInstance()
        {
            return (AntTrackItemData*)0xF88210E0;
        }
        static __inline unsigned int ClassId()
        {
            return 916;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024014F0;
        }
        AntRef m_Controller; //0x0008
        __int32 m_SequenceTrackIndex; //0x000C
        __int32 m_StartTime; //0x0010
        unsigned __int32 m_NumTicks; //0x0014
        bool m_ResumeAtEnd; //0x0018
        char _0x0019[3];
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01888
    // RuntimeId: 05905
    // TypeInfo:  0x024014C4
#ifndef _AntEventEntityData_
#define _AntEventEntityData_
#pragma pack(push, 16)
    class AntEventEntityData : public GameEntityData
    {
    public:
        static __inline AntEventEntityData* DefaultInstance()
        {
            return (AntEventEntityData*)0xF88366A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1888;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024014C4;
        }
        Array<AntEventData> m_OnEnterEvents; //0x0060
        Array<AntEventData> m_OnUpdateEvents; //0x0064
        Array<AntEventData> m_OnLeaveEvents; //0x0068
        bool m_SendAsPlayerEvent; //0x006C
        bool m_AutoActivate; //0x006D
        char _0x006E[2];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00917
    // RuntimeId: 05897
    // TypeInfo:  0x02401468
#ifndef _AntEnumeration_
#define _AntEnumeration_
#pragma pack(push, 4)
    class AntEnumeration : public DataContainer
    {
    public:
        static __inline AntEnumeration* DefaultInstance()
        {
            return (AntEnumeration*)0xF8821110;
        }
        static __inline unsigned int ClassId()
        {
            return 917;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401468;
        }
        AntRef m_AntAsset; //0x0008
        __int32 m_Value; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02161
    // RuntimeId: 06055
    // TypeInfo:  0x02402B28
#ifndef _AIWeaponData_
#define _AIWeaponData_
#pragma pack(push, 4)
    class AIWeaponData : public GameAIWeaponData
    {
    public:
        static __inline AIWeaponData* DefaultInstance()
        {
            return (AIWeaponData*)0xF883FAD8;
        }
        static __inline unsigned int ClassId()
        {
            return 2161;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02402B28;
        }
        Strengths m_Strengths; //0x000C
        float m_MaxBurstCoolDownTime; //0x001C
        float m_LostTargetBurstCoolDownModifier; //0x0020
        float m_FinalAccuracyPercentage; //0x0024
        float m_AimTransitionFireDelay; //0x0028
        float m_MinRange; //0x002C
        float m_MaxRange; //0x0030
        float m_OptimalRangePercentage; //0x0034
        ReloadBehavior m_ReloadBehavior; //0x0038
        float m_MinExtraReloadTime; //0x003C
        float m_MaxExtraReloadTime; //0x0040
        float m_MinBurstCoolDownTime; //0x0044
        float m_AimAngularVelocity; //0x0048
        float m_InnerInaccurateDistance; //0x004C
        float m_AngleToTargetSnap; //0x0050
        float m_SweepDistance; //0x0054
        float m_SweepTime; //0x0058
        float m_WaitTimeBeforeFire; //0x005C
        BurstLimit m_BurstLimitNear; //0x0060
        BurstLimit m_BurstLimitFar; //0x0068
        float m_StartAccuracyPercentage; //0x0070
        float m_MinimumAccuracyBeforeFiring; //0x0074
        float m_OuterInaccurateDistance; //0x0078
        float m_AdditionalMinimumAccuracyAtMinRange; //0x007C
        float m_GravityModifier; //0x0080
        SweepSelectionType m_SweepType; //0x0084
        AimOrigin m_AimOrigin; //0x0088
        bool m_UseZoom; //0x008C
        bool m_AllowedAgainstImmortals; //0x008D
        bool m_AimWhileReloading; //0x008E
        bool m_AimHighIndirectPath; //0x008F
        bool m_Indirect; //0x0090
        bool m_IsMelee; //0x0091
        bool m_SweepFirstAttack; //0x0092
        bool m_IsBlindFireAllowed; //0x0093
        bool m_CanAltAttack; //0x0094
        bool m_IsStandStill; //0x0095
        bool m_CanSuppress; //0x0096
        bool m_UseFromCover; //0x0097
        bool m_InaccuracyFollowsTarget; //0x0098
        bool m_UseInaccuracyAtCloseRange; //0x0099
        bool m_DisableWeaponSway; //0x009A
        bool m_IsAiAllowed; //0x009B
    };//Size=0x009C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02163
    // RuntimeId: 06035
    // TypeInfo:  0x024029FC
#ifndef _AIEntryData_
#define _AIEntryData_
#pragma pack(push, 4)
    class AIEntryData : public GameAIEntryData
    {
    public:
        static __inline AIEntryData* DefaultInstance()
        {
            return (AIEntryData*)0xF883FBA8;
        }
        static __inline unsigned int ClassId()
        {
            return 2163;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024029FC;
        }
        AIVehicleBehaviourData* m_EquipmentType; //0x000C
        ArmamentData* m_Armament; //0x0010
        MobilityData* m_Mobility; //0x0014
        StrengthType m_StrengthType; //0x0018
        float m_ReuseTime; //0x001C
        bool m_Forbidden; //0x0020
        bool m_HasExposedSoldier; //0x0021
        bool m_InterludeOnly; //0x0022
        bool m_InvalidForAI; //0x0023
    };//Size=0x0024
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01717
    // RuntimeId: 05879
    // TypeInfo:  0x02401384
#ifndef _CoverPrepareFireEntityData_
#define _CoverPrepareFireEntityData_
#pragma pack(push, 4)
    class CoverPrepareFireEntityData : public EntityData
    {
    public:
        static __inline CoverPrepareFireEntityData* DefaultInstance()
        {
            return (CoverPrepareFireEntityData*)0xF8832890;
        }
        static __inline unsigned int ClassId()
        {
            return 1717;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401384;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01596
    // RuntimeId: 05877
    // TypeInfo:  0x02401358
#ifndef _AILocoComponentData_
#define _AILocoComponentData_
#pragma pack(push, 16)
    class AILocoComponentData : public ComponentData
    {
    public:
        static __inline AILocoComponentData* DefaultInstance()
        {
            return (AILocoComponentData*)0xF882D300;
        }
        static __inline unsigned int ClassId()
        {
            return 1596;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401358;
        }
        AILocoBinding m_Binding; //0x0060
        AILocoVaultBinding m_VaultBinding; //0x0084
        AILocoCoverBinding m_CoverBinding; //0x00A0
        float m_WantedYaw; //0x00E8
        __int32 m_AnimationEntitySpacePriority; //0x00EC
    };//Size=0x00F0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00984
    // RuntimeId: 05326
    // TypeInfo:  0x023FCF70
#ifndef _WaypointData_
#define _WaypointData_
#pragma pack(push, 4)
    class WaypointData : public DataContainer
    {
    public:
        static __inline WaypointData* DefaultInstance()
        {
            return (WaypointData*)0xF88223D8;
        }
        static __inline unsigned int ClassId()
        {
            return 984;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FCF70;
        }
        __int32 m_SchematicsNameHash; //0x0008
        unsigned __int16 m_WaypointId; //0x000C
        bool m_UseClientsPosition; //0x000E
        char _0x000F[1];
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00985
    // RuntimeId: 05867
    // TypeInfo:  0x0240127C
#ifndef _AbstractLocoWaypointData_
#define _AbstractLocoWaypointData_
#pragma pack(push, 4)
    class AbstractLocoWaypointData : public WaypointData
    {
    public:
        static __inline AbstractLocoWaypointData* DefaultInstance()
        {
            return (AbstractLocoWaypointData*)0xF8822400;
        }
        static __inline unsigned int ClassId()
        {
            return 985;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240127C;
        }
        AILocoBaseTaskData m_BaseTask; //0x0010
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00988
    // RuntimeId: 05871
    // TypeInfo:  0x024012D4
#ifndef _CoverWaypointData_
#define _CoverWaypointData_
#pragma pack(push, 16)
    class CoverWaypointData : public AbstractLocoWaypointData
    {
    public:
        static __inline CoverWaypointData* DefaultInstance()
        {
            return (CoverWaypointData*)0xF88225A0;
        }
        static __inline unsigned int ClassId()
        {
            return 988;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024012D4;
        }
        AILocoCoverTaskData m_CoverTask; //0x0030
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00989
    // RuntimeId: 05869
    // TypeInfo:  0x024012A8
#ifndef _ScenarioWaypointData_
#define _ScenarioWaypointData_
#pragma pack(push, 16)
    class ScenarioWaypointData : public AbstractLocoWaypointData
    {
    public:
        static __inline ScenarioWaypointData* DefaultInstance()
        {
            return (ScenarioWaypointData*)0xF8822670;
        }
        static __inline unsigned int ClassId()
        {
            return 989;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024012A8;
        }
        AntRef m_ScenarioAntRef; //0x0030
        char _0x0034[12];
        ScenarioTaskData m_ScenarioTask; //0x0040
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00986
    // RuntimeId: 05875
    // TypeInfo:  0x0240132C
#ifndef _StandardMoveWaypointData_
#define _StandardMoveWaypointData_
#pragma pack(push, 16)
    class StandardMoveWaypointData : public AbstractLocoWaypointData
    {
    public:
        static __inline StandardMoveWaypointData* DefaultInstance()
        {
            return (StandardMoveWaypointData*)0xF8822460;
        }
        static __inline unsigned int ClassId()
        {
            return 986;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240132C;
        }
        AILocoMoveTaskData m_MoveTask; //0x0030
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00066
    // RuntimeId: 05831
    // TypeInfo:  0x02401144
#ifndef _RawFileData_
#define _RawFileData_
    class RawFileData
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 66;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02401144;
        }
        char _0x0000[20];
    };//Size=0x0014
#endif

    ////////////////////////////////////////
    // ClassId:   01504
    // RuntimeId: 00258
    // TypeInfo:  0x023C53DC
#ifndef _MaterialRelationPropertyData_
#define _MaterialRelationPropertyData_
#pragma pack(push, 4)
    class MaterialRelationPropertyData : public DataContainer
    {
    public:
        static __inline MaterialRelationPropertyData* DefaultInstance()
        {
            return (MaterialRelationPropertyData*)0xF882A398;
        }
        static __inline unsigned int ClassId()
        {
            return 1504;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C53DC;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01505
    // RuntimeId: 00262
    // TypeInfo:  0x023C5434
#ifndef _PhysicsPropertyRelationPropertyData_
#define _PhysicsPropertyRelationPropertyData_
#pragma pack(push, 4)
    class PhysicsPropertyRelationPropertyData : public MaterialRelationPropertyData
    {
    public:
        static __inline PhysicsPropertyRelationPropertyData* DefaultInstance()
        {
            return (PhysicsPropertyRelationPropertyData*)0xF882A3B8;
        }
        static __inline unsigned int ClassId()
        {
            return 1505;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C5434;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01507
    // RuntimeId: 05826
    // TypeInfo:  0x024004E0
#ifndef _MaterialRelationDamageData_
#define _MaterialRelationDamageData_
#pragma pack(push, 4)
    class MaterialRelationDamageData : public PhysicsPropertyRelationPropertyData
    {
    public:
        static __inline MaterialRelationDamageData* DefaultInstance()
        {
            return (MaterialRelationDamageData*)0xF882A3F8;
        }
        static __inline unsigned int ClassId()
        {
            return 1507;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024004E0;
        }
        float m_CollisionDamageMultiplier; //0x0008
        float m_CollisionDamageThreshold; //0x000C
        float m_DamageProtectionMultiplier; //0x0010
        float m_DamagePenetrationMultiplier; //0x0014
        float m_DamageProtectionThreshold; //0x0018
        float m_ExplosionCoverDamageModifier; //0x001C
        bool m_InflictsDemolitionDamage; //0x0020
        char _0x0021[3];
    };//Size=0x0024
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01508
    // RuntimeId: 05824
    // TypeInfo:  0x024004B4
#ifndef _MaterialRelationTerrainDestructionData_
#define _MaterialRelationTerrainDestructionData_
#pragma pack(push, 4)
    class MaterialRelationTerrainDestructionData : public PhysicsPropertyRelationPropertyData
    {
    public:
        static __inline MaterialRelationTerrainDestructionData* DefaultInstance()
        {
            return (MaterialRelationTerrainDestructionData*)0xF882A430;
        }
        static __inline unsigned int ClassId()
        {
            return 1508;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024004B4;
        }
        float m_Width; //0x0008
        float m_Depth; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01511
    // RuntimeId: 00260
    // TypeInfo:  0x023C5408
#ifndef _PhysicsMaterialRelationPropertyData_
#define _PhysicsMaterialRelationPropertyData_
#pragma pack(push, 4)
    class PhysicsMaterialRelationPropertyData : public MaterialRelationPropertyData
    {
    public:
        static __inline PhysicsMaterialRelationPropertyData* DefaultInstance()
        {
            return (PhysicsMaterialRelationPropertyData*)0xF882A498;
        }
        static __inline unsigned int ClassId()
        {
            return 1511;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C5408;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01514
    // RuntimeId: 05820
    // TypeInfo:  0x0240045C
#ifndef _MaterialRelationEffectData_
#define _MaterialRelationEffectData_
#pragma pack(push, 4)
    class MaterialRelationEffectData : public PhysicsMaterialRelationPropertyData
    {
    public:
        static __inline MaterialRelationEffectData* DefaultInstance()
        {
            return (MaterialRelationEffectData*)0xF882A510;
        }
        static __inline unsigned int ClassId()
        {
            return 1514;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240045C;
        }
        Array<EffectBlueprint*> m_ImpactEffects; //0x0008
        Array<ObjectBlueprint*> m_ImpactDebris; //0x000C
        float m_ImpactEffectMaxSpreadAngle; //0x0010
        bool m_MirrorImpactDirection; //0x0014
        char _0x0015[3];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01509
    // RuntimeId: 05818
    // TypeInfo:  0x02400430
#ifndef _MaterialPropertyImpulseData_
#define _MaterialPropertyImpulseData_
#pragma pack(push, 4)
    class MaterialPropertyImpulseData : public PhysicsPropertyRelationPropertyData
    {
    public:
        static __inline MaterialPropertyImpulseData* DefaultInstance()
        {
            return (MaterialPropertyImpulseData*)0xF882A458;
        }
        static __inline unsigned int ClassId()
        {
            return 1509;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400430;
        }
        float m_ImpulseAbsorptionMultiplier; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01510
    // RuntimeId: 05816
    // TypeInfo:  0x02400404
#ifndef _MaterialPropertyHealthData_
#define _MaterialPropertyHealthData_
#pragma pack(push, 4)
    class MaterialPropertyHealthData : public PhysicsPropertyRelationPropertyData
    {
    public:
        static __inline MaterialPropertyHealthData* DefaultInstance()
        {
            return (MaterialPropertyHealthData*)0xF882A478;
        }
        static __inline unsigned int ClassId()
        {
            return 1510;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400404;
        }
        float m_Health; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01515
    // RuntimeId: 05814
    // TypeInfo:  0x024003D8
#ifndef _MaterialPropertyTerrainData_
#define _MaterialPropertyTerrainData_
#pragma pack(push, 16)
    class MaterialPropertyTerrainData : public PhysicsMaterialRelationPropertyData
    {
    public:
        static __inline MaterialPropertyTerrainData* DefaultInstance()
        {
            return (MaterialPropertyTerrainData*)0xF882A540;
        }
        static __inline unsigned int ClassId()
        {
            return 1515;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024003D8;
        }
        char _0x0008[8];
        Vec3 m_DirtTriggerColor; //0x0010
        EffectBlueprint* m_DestructionEffect; //0x0020
        float m_DirtTriggerFactor; //0x0024
        char _0x0028[8];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01516
    // RuntimeId: 05812
    // TypeInfo:  0x024003AC
#ifndef _MaterialRelationDecalData_
#define _MaterialRelationDecalData_
#pragma pack(push, 4)
    class MaterialRelationDecalData : public PhysicsMaterialRelationPropertyData
    {
    public:
        static __inline MaterialRelationDecalData* DefaultInstance()
        {
            return (MaterialRelationDecalData*)0xF882A588;
        }
        static __inline unsigned int ClassId()
        {
            return 1516;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024003AC;
        }
        DecalTemplateData* m_Decal; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01517
    // RuntimeId: 05810
    // TypeInfo:  0x02400380
#ifndef _MaterialPropertyEffectData_
#define _MaterialPropertyEffectData_
#pragma pack(push, 4)
    class MaterialPropertyEffectData : public PhysicsMaterialRelationPropertyData
    {
    public:
        static __inline MaterialPropertyEffectData* DefaultInstance()
        {
            return (MaterialPropertyEffectData*)0xF882A5A8;
        }
        static __inline unsigned int ClassId()
        {
            return 1517;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400380;
        }
        Array<EffectBlueprint*> m_ImpactEffects; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01518
    // RuntimeId: 05808
    // TypeInfo:  0x02400354
#ifndef _MaterialPropertySoundData_
#define _MaterialPropertySoundData_
#pragma pack(push, 4)
    class MaterialPropertySoundData : public PhysicsMaterialRelationPropertyData
    {
    public:
        static __inline MaterialPropertySoundData* DefaultInstance()
        {
            return (MaterialPropertySoundData*)0xF882A5C8;
        }
        static __inline unsigned int ClassId()
        {
            return 1518;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400354;
        }
        SoundAsset* m_ImpactSound; //0x0008
        SoundAsset* m_ScrapeSound; //0x000C
        float m_ScrapeLength; //0x0010
        MaterialSoldierSoundSettings* m_SoldierSettings; //0x0014
        float m_Softness; //0x0018
        float m_MaterialSoundId; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00918
    // RuntimeId: 05806
    // TypeInfo:  0x02400328
#ifndef _MaterialSoldierSoundSettings_
#define _MaterialSoldierSoundSettings_
#pragma pack(push, 4)
    class MaterialSoldierSoundSettings : public DataContainer
    {
    public:
        static __inline MaterialSoldierSoundSettings* DefaultInstance()
        {
            return (MaterialSoldierSoundSettings*)0xF8821138;
        }
        static __inline unsigned int ClassId()
        {
            return 918;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400328;
        }
        SoundAsset* m_FootStepSound; //0x0008
        SoundAsset* m_ProneSound; //0x000C
        SoundAsset* m_LandSound; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01718
    // RuntimeId: 05804
    // TypeInfo:  0x024002FC
#ifndef _StreamingGateEntityData_
#define _StreamingGateEntityData_
#pragma pack(push, 4)
    class StreamingGateEntityData : public EntityData
    {
    public:
        static __inline StreamingGateEntityData* DefaultInstance()
        {
            return (StreamingGateEntityData*)0xF88328B0;
        }
        static __inline unsigned int ClassId()
        {
            return 1718;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024002FC;
        }
        float m_Timeout; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01719
    // RuntimeId: 05802
    // TypeInfo:  0x024002D0
#ifndef _WeaponStateEntityData_
#define _WeaponStateEntityData_
#pragma pack(push, 4)
    class WeaponStateEntityData : public EntityData
    {
    public:
        static __inline WeaponStateEntityData* DefaultInstance()
        {
            return (WeaponStateEntityData*)0xF88328D8;
        }
        static __inline unsigned int ClassId()
        {
            return 1719;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024002D0;
        }
        Realm m_Realm; //0x000C
        __int32 m_WeaponSlot; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01720
    // RuntimeId: 05800
    // TypeInfo:  0x024002A4
#ifndef _SpectatorReplayEntityData_
#define _SpectatorReplayEntityData_
#pragma pack(push, 4)
    class SpectatorReplayEntityData : public EntityData
    {
    public:
        static __inline SpectatorReplayEntityData* DefaultInstance()
        {
            return (SpectatorReplayEntityData*)0xF8832900;
        }
        static __inline unsigned int ClassId()
        {
            return 1720;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024002A4;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01721
    // RuntimeId: 05798
    // TypeInfo:  0x02400278
#ifndef _PlayerLookAtEntityData_
#define _PlayerLookAtEntityData_
#pragma pack(push, 16)
    class PlayerLookAtEntityData : public EntityData
    {
    public:
        static __inline PlayerLookAtEntityData* DefaultInstance()
        {
            return (PlayerLookAtEntityData*)0xF8832920;
        }
        static __inline unsigned int ClassId()
        {
            return 1721;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400278;
        }
        char _0x000C[4];
        LinearTransform m_TargetTransform; //0x0010
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01889
    // RuntimeId: 05796
    // TypeInfo:  0x0240024C
#ifndef _AntInteractionData_
#define _AntInteractionData_
#pragma pack(push, 16)
    class AntInteractionData : public GameEntityData
    {
    public:
        static __inline AntInteractionData* DefaultInstance()
        {
            return (AntInteractionData*)0xF8836750;
        }
        static __inline unsigned int ClassId()
        {
            return 1889;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240024C;
        }
        AntInteractionBinding m_AntBindings; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01722
    // RuntimeId: 05788
    // TypeInfo:  0x024001B8
#ifndef _CustomizeBaseEntityData_
#define _CustomizeBaseEntityData_
#pragma pack(push, 4)
    class CustomizeBaseEntityData : public EntityData
    {
    public:
        static __inline CustomizeBaseEntityData* DefaultInstance()
        {
            return (CustomizeBaseEntityData*)0xF8832988;
        }
        static __inline unsigned int ClassId()
        {
            return 1722;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024001B8;
        }
        Realm m_Realm; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01724
    // RuntimeId: 05790
    // TypeInfo:  0x024001E4
#ifndef _CustomizeCharacterEntityData_
#define _CustomizeCharacterEntityData_
#pragma pack(push, 4)
    class CustomizeCharacterEntityData : public CustomizeBaseEntityData
    {
    public:
        static __inline CustomizeCharacterEntityData* DefaultInstance()
        {
            return (CustomizeCharacterEntityData*)0xF88329D8;
        }
        static __inline unsigned int ClassId()
        {
            return 1724;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024001E4;
        }
        CustomizeCharacterData* m_CustomizeCharacterData; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01723
    // RuntimeId: 05792
    // TypeInfo:  0x02400210
#ifndef _CustomizeSoldierEntityData_
#define _CustomizeSoldierEntityData_
#pragma pack(push, 4)
    class CustomizeSoldierEntityData : public CustomizeBaseEntityData
    {
    public:
        static __inline CustomizeSoldierEntityData* DefaultInstance()
        {
            return (CustomizeSoldierEntityData*)0xF88329B0;
        }
        static __inline unsigned int ClassId()
        {
            return 1723;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400210;
        }
        CustomizeSoldierData* m_CustomizeSoldierData; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01725
    // RuntimeId: 05786
    // TypeInfo:  0x0240018C
#ifndef _PlayerFilterEntityData_
#define _PlayerFilterEntityData_
#pragma pack(push, 4)
    class PlayerFilterEntityData : public EntityData
    {
    public:
        static __inline PlayerFilterEntityData* DefaultInstance()
        {
            return (PlayerFilterEntityData*)0xF8832A00;
        }
        static __inline unsigned int ClassId()
        {
            return 1725;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240018C;
        }
        Realm m_Realm; //0x000C
        bool m_InvertFilter; //0x0010
        bool m_ForwardToSpectators; //0x0011
        char _0x0012[2];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01726
    // RuntimeId: 05784
    // TypeInfo:  0x02400160
#ifndef _AreaProximityEntityData_
#define _AreaProximityEntityData_
#pragma pack(push, 4)
    class AreaProximityEntityData : public EntityData
    {
    public:
        static __inline AreaProximityEntityData* DefaultInstance()
        {
            return (AreaProximityEntityData*)0xF8832A28;
        }
        static __inline unsigned int ClassId()
        {
            return 1726;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400160;
        }
        Realm m_Realm; //0x000C
        float m_ProximityDistance; //0x0010
        UpdatePass m_UpdatePass; //0x0014
        bool m_AutoStart; //0x0018
        char _0x0019[3];
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01890
    // RuntimeId: 05782
    // TypeInfo:  0x02400134
#ifndef _ArmDisarmAwardEntityData_
#define _ArmDisarmAwardEntityData_
#pragma pack(push, 16)
    class ArmDisarmAwardEntityData : public GameEntityData
    {
    public:
        static __inline ArmDisarmAwardEntityData* DefaultInstance()
        {
            return (ArmDisarmAwardEntityData*)0xF8836800;
        }
        static __inline unsigned int ClassId()
        {
            return 1890;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400134;
        }
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01891
    // RuntimeId: 05780
    // TypeInfo:  0x02400108
#ifndef _StatEventTriggerEntityData_
#define _StatEventTriggerEntityData_
#pragma pack(push, 16)
    class StatEventTriggerEntityData : public GameEntityData
    {
    public:
        static __inline StatEventTriggerEntityData* DefaultInstance()
        {
            return (StatEventTriggerEntityData*)0xF88368A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1891;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400108;
        }
        StatEvent m_StatEvent; //0x0060
        char* m_MiscParamX; //0x0064
        char* m_MiscParamY; //0x0068
        bool m_SendToAll; //0x006C
        char _0x006D[3];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01892
    // RuntimeId: 05778
    // TypeInfo:  0x024000DC
#ifndef _ArtilleryStrikeEntityData_
#define _ArtilleryStrikeEntityData_
#pragma pack(push, 16)
    class ArtilleryStrikeEntityData : public GameEntityData
    {
    public:
        static __inline ArtilleryStrikeEntityData* DefaultInstance()
        {
            return (ArtilleryStrikeEntityData*)0xF8836950;
        }
        static __inline unsigned int ClassId()
        {
            return 1892;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024000DC;
        }
        MissileEntityData* m_MissileData; //0x0060
        float m_MissileSpawnRadius; //0x0064
        float m_DurationOfArtilleryStrike; //0x0068
        float m_MaxDelayBetweenProjectiles; //0x006C
        float m_MinDelayBetweenProjectiles; //0x0070
        float m_MaxDelayBetweenStrikes; //0x0074
        float m_MinDelayBetweenStrikes; //0x0078
        float m_MinRadiusToSoldier; //0x007C
        float m_RadiusWhenFollowingSoldier; //0x0080
        float m_HeightOffsetWhenFollowingSoldier; //0x0084
        unsigned __int32 m_NumberOfStrikes; //0x0088
        unsigned __int32 m_MaxProjectilesPerStrike; //0x008C
        unsigned __int32 m_MinProjectilesPerStrike; //0x0090
        bool m_FollowSoldier; //0x0094
        char _0x0095[11];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01727
    // RuntimeId: 05776
    // TypeInfo:  0x024000B0
#ifndef _RoundOverEntityData_
#define _RoundOverEntityData_
#pragma pack(push, 4)
    class RoundOverEntityData : public EntityData
    {
    public:
        static __inline RoundOverEntityData* DefaultInstance()
        {
            return (RoundOverEntityData*)0xF8832A58;
        }
        static __inline unsigned int ClassId()
        {
            return 1727;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024000B0;
        }
        TeamId m_Team; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01893
    // RuntimeId: 05774
    // TypeInfo:  0x02400084
#ifndef _PreRoundEntityData_
#define _PreRoundEntityData_
#pragma pack(push, 16)
    class PreRoundEntityData : public GameEntityData
    {
    public:
        static __inline PreRoundEntityData* DefaultInstance()
        {
            return (PreRoundEntityData*)0xF8836A30;
        }
        static __inline unsigned int ClassId()
        {
            return 1893;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400084;
        }
        __int32 m_RoundMaxPlayerCount; //0x0060
        unsigned __int32 m_RoundRestartCountdown; //0x0064
        __int32 m_RoundMinPlayerCount; //0x0068
        char _0x006C[4];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01894
    // RuntimeId: 05772
    // TypeInfo:  0x02400058
#ifndef _AutoSquadEntityData_
#define _AutoSquadEntityData_
#pragma pack(push, 16)
    class AutoSquadEntityData : public GameEntityData
    {
    public:
        static __inline AutoSquadEntityData* DefaultInstance()
        {
            return (AutoSquadEntityData*)0xF8836AE0;
        }
        static __inline unsigned int ClassId()
        {
            return 1894;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x02400058;
        }
        SquadId m_SquadId; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01895
    // RuntimeId: 05770
    // TypeInfo:  0x0240002C
#ifndef _AutoTeamEntityData_
#define _AutoTeamEntityData_
#pragma pack(push, 16)
    class AutoTeamEntityData : public GameEntityData
    {
    public:
        static __inline AutoTeamEntityData* DefaultInstance()
        {
            return (AutoTeamEntityData*)0xF8836B90;
        }
        static __inline unsigned int ClassId()
        {
            return 1895;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0240002C;
        }
        unsigned __int32 m_TeamDifferenceToAutoBalance; //0x0060
        TeamAssignMode m_TeamAssignMode; //0x0064
        unsigned __int32 m_PlayerCountNeededToAutoBalance; //0x0068
        bool m_ForceIntoSquad; //0x006C
        bool m_RotateTeamOnNewRound; //0x006D
        bool m_AutoBalance; //0x006E
        char _0x006F[1];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01896
    // RuntimeId: 05766
    // TypeInfo:  0x023FFFF0
#ifndef _InputRestrictionEntityData_
#define _InputRestrictionEntityData_
#pragma pack(push, 16)
    class InputRestrictionEntityData : public GameEntityData
    {
    public:
        static __inline InputRestrictionEntityData* DefaultInstance()
        {
            return (InputRestrictionEntityData*)0xF8836C40;
        }
        static __inline unsigned int ClassId()
        {
            return 1896;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFFF0;
        }
        bool m_ApplyRestrictionsToSpecificPlayer; //0x0060
        bool m_Throttle; //0x0061
        bool m_Strafe; //0x0062
        bool m_Brake; //0x0063
        bool m_HandBrake; //0x0064
        bool m_Clutch; //0x0065
        bool m_Yaw; //0x0066
        bool m_Pitch; //0x0067
        bool m_Roll; //0x0068
        bool m_Fire; //0x0069
        bool m_FireCountermeasure; //0x006A
        bool m_AltFire; //0x006B
        bool m_CycleRadioChannel; //0x006C
        bool m_SelectMeleeWeapon; //0x006D
        bool m_Zoom; //0x006E
        bool m_Jump; //0x006F
        bool m_ChangeVehicle; //0x0070
        bool m_ChangeEntry; //0x0071
        bool m_ChangePose; //0x0072
        bool m_ToggleParachute; //0x0073
        bool m_ChangeWeapon; //0x0074
        bool m_Reload; //0x0075
        bool m_ToggleCamera; //0x0076
        bool m_Sprint; //0x0077
        bool m_ScoreboardMenu; //0x0078
        bool m_MapZoom; //0x0079
        bool m_GearUp; //0x007A
        bool m_GearDown; //0x007B
        bool m_ThreeDimensionalMap; //0x007C
        bool m_GiveOrder; //0x007D
        bool m_Prone; //0x007E
        bool m_SwitchPrimaryInventory; //0x007F
        bool m_SwitchPrimaryWeapon; //0x0080
        bool m_GrenadeLauncher; //0x0081
        bool m_StaticGadget; //0x0082
        bool m_DynamicGadget1; //0x0083
        bool m_DynamicGadget2; //0x0084
        bool m_MeleeAttack; //0x0085
        bool m_ThrowGrenade; //0x0086
        bool m_SelectWeapon1; //0x0087
        bool m_SelectWeapon2; //0x0088
        bool m_SelectWeapon3; //0x0089
        bool m_SelectWeapon4; //0x008A
        bool m_SelectWeapon5; //0x008B
        bool m_SelectWeapon6; //0x008C
        bool m_SelectWeapon7; //0x008D
        bool m_SelectWeapon8; //0x008E
        bool m_SelectWeapon9; //0x008F
        bool m_OverridePreviousInputRestriction; //0x0090
        char _0x0091[15];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01897
    // RuntimeId: 05764
    // TypeInfo:  0x023FFFC4
#ifndef _EventIfSwitchEntityData_
#define _EventIfSwitchEntityData_
#pragma pack(push, 16)
    class EventIfSwitchEntityData : public GameEntityData
    {
    public:
        static __inline EventIfSwitchEntityData* DefaultInstance()
        {
            return (EventIfSwitchEntityData*)0xF8836D20;
        }
        static __inline unsigned int ClassId()
        {
            return 1897;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFFC4;
        }
        bool m_RunOnce; //0x0060
        bool m_StartState; //0x0061
        char _0x0062[14];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01898
    // RuntimeId: 05762
    // TypeInfo:  0x023FFF98
#ifndef _TeamFilterEntityData_
#define _TeamFilterEntityData_
#pragma pack(push, 16)
    class TeamFilterEntityData : public GameEntityData
    {
    public:
        static __inline TeamFilterEntityData* DefaultInstance()
        {
            return (TeamFilterEntityData*)0xF8836DD0;
        }
        static __inline unsigned int ClassId()
        {
            return 1898;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFF98;
        }
        Realm m_Realm; //0x0060
        TeamId m_Team; //0x0064
        bool m_InvertFilter; //0x0068
        bool m_GenerateEventForEveryMatchingTeamMember; //0x0069
        char _0x006A[6];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01728
    // RuntimeId: 05760
    // TypeInfo:  0x023FFF6C
#ifndef _PlatformSplitterEntityData_
#define _PlatformSplitterEntityData_
#pragma pack(push, 4)
    class PlatformSplitterEntityData : public EntityData
    {
    public:
        static __inline PlatformSplitterEntityData* DefaultInstance()
        {
            return (PlatformSplitterEntityData*)0xF8832A80;
        }
        static __inline unsigned int ClassId()
        {
            return 1728;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFF6C;
        }
        Realm m_Realm; //0x000C
        bool m_RunOnce; //0x0010
        char _0x0011[3];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01729
    // RuntimeId: 05758
    // TypeInfo:  0x023FFF40
#ifndef _EventSplitterEntityData_
#define _EventSplitterEntityData_
#pragma pack(push, 4)
    class EventSplitterEntityData : public EntityData
    {
    public:
        static __inline EventSplitterEntityData* DefaultInstance()
        {
            return (EventSplitterEntityData*)0xF8832AA8;
        }
        static __inline unsigned int ClassId()
        {
            return 1729;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFF40;
        }
        Realm m_Realm; //0x000C
        bool m_RunOnce; //0x0010
        char _0x0011[3];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01899
    // RuntimeId: 05756
    // TypeInfo:  0x023FFF14
#ifndef _EventMemoryEntityData_
#define _EventMemoryEntityData_
#pragma pack(push, 16)
    class EventMemoryEntityData : public GameEntityData
    {
    public:
        static __inline EventMemoryEntityData* DefaultInstance()
        {
            return (EventMemoryEntityData*)0xF8836E80;
        }
        static __inline unsigned int ClassId()
        {
            return 1899;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFF14;
        }
        Realm m_Realm; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01900
    // RuntimeId: 05754
    // TypeInfo:  0x023FFEE8
#ifndef _StateEventGateEntityData_
#define _StateEventGateEntityData_
#pragma pack(push, 16)
    class StateEventGateEntityData : public GameEntityData
    {
    public:
        static __inline StateEventGateEntityData* DefaultInstance()
        {
            return (StateEventGateEntityData*)0xF8836F30;
        }
        static __inline unsigned int ClassId()
        {
            return 1900;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFEE8;
        }
        EventGateState m_CheckedState; //0x0060
        char _0x0064[12];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01901
    // RuntimeId: 05750
    // TypeInfo:  0x023FFEAC
#ifndef _SpeedEventGateEntityData_
#define _SpeedEventGateEntityData_
#pragma pack(push, 16)
    class SpeedEventGateEntityData : public GameEntityData
    {
    public:
        static __inline SpeedEventGateEntityData* DefaultInstance()
        {
            return (SpeedEventGateEntityData*)0xF8836FE0;
        }
        static __inline unsigned int ClassId()
        {
            return 1901;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFEAC;
        }
        float m_MinSpeed; //0x0060
        float m_MaxSpeed; //0x0064
        char _0x0068[8];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01730
    // RuntimeId: 05748
    // TypeInfo:  0x023FFE80
#ifndef _EventCompareGateEntityData_
#define _EventCompareGateEntityData_
#pragma pack(push, 4)
    class EventCompareGateEntityData : public EntityData
    {
    public:
        static __inline EventCompareGateEntityData* DefaultInstance()
        {
            return (EventCompareGateEntityData*)0xF8832AD0;
        }
        static __inline unsigned int ClassId()
        {
            return 1730;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFE80;
        }
        __int32 m_Value; //0x000C
        EventCompareGateType m_CompareType; //0x0010
        Realm m_Realm; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01902
    // RuntimeId: 05744
    // TypeInfo:  0x023FFE44
#ifndef _HudEntityData_
#define _HudEntityData_
#pragma pack(push, 16)
    class HudEntityData : public GameEntityData
    {
    public:
        static __inline HudEntityData* DefaultInstance()
        {
            return (HudEntityData*)0xF8837090;
        }
        static __inline unsigned int ClassId()
        {
            return 1902;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFE44;
        }
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01731
    // RuntimeId: 05740
    // TypeInfo:  0x023FFE08
#ifndef _SaveGameLoadedEntityData_
#define _SaveGameLoadedEntityData_
#pragma pack(push, 4)
    class SaveGameLoadedEntityData : public EntityData
    {
    public:
        static __inline SaveGameLoadedEntityData* DefaultInstance()
        {
            return (SaveGameLoadedEntityData*)0xF8832B00;
        }
        static __inline unsigned int ClassId()
        {
            return 1731;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFE08;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01732
    // RuntimeId: 05738
    // TypeInfo:  0x023FFDDC
#ifndef _SaveEntityData_
#define _SaveEntityData_
#pragma pack(push, 4)
    class SaveEntityData : public EntityData
    {
    public:
        static __inline SaveEntityData* DefaultInstance()
        {
            return (SaveEntityData*)0xF8832B20;
        }
        static __inline unsigned int ClassId()
        {
            return 1732;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFDDC;
        }
        TextureAsset* m_SaveScreenTexture; //0x000C
        char* m_LevelName; //0x0010
        char* m_SaveFileName; //0x0014
        char* m_SaveNameSID; //0x0018
        bool m_CheckForHumanPlayer; //0x001C
        char _0x001D[3];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01733
    // RuntimeId: 05736
    // TypeInfo:  0x023FFDB0
#ifndef _StartEntityData_
#define _StartEntityData_
#pragma pack(push, 4)
    class StartEntityData : public EntityData
    {
    public:
        static __inline StartEntityData* DefaultInstance()
        {
            return (StartEntityData*)0xF8832B58;
        }
        static __inline unsigned int ClassId()
        {
            return 1733;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFDB0;
        }
        float m_SortIndex; //0x000C
        char* m_StartName; //0x0010
        bool m_IsDefault; //0x0014
        char _0x0015[3];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01903
    // RuntimeId: 05734
    // TypeInfo:  0x023FFD84
#ifndef _MapMarkerEntityData_
#define _MapMarkerEntityData_
#pragma pack(push, 16)
    class MapMarkerEntityData : public GameEntityData
    {
    public:
        static __inline MapMarkerEntityData* DefaultInstance()
        {
            return (MapMarkerEntityData*)0xF8837130;
        }
        static __inline unsigned int ClassId()
        {
            return 1903;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFD84;
        }
        Vec3 m_BaseTransform; //0x0060
        float m_ProgressMinTime; //0x0070
        char* m_Sid; //0x0074
        __int32 m_NrOfPassengers; //0x0078
        __int32 m_NrOfEntries; //0x007C
        float m_ProgressTime1Player; //0x0080
        float m_ShowRadius; //0x0084
        float m_HideRadius; //0x0088
        float m_BlinkTime; //0x008C
        MapMarkerType m_MarkerType; //0x0090
        TeamId m_VisibleForTeam; //0x0094
        TeamId m_OwnerTeam; //0x0098
        UIHudIcon m_HudIcon; //0x009C
        float m_VerticalOffset; //0x00A0
        float m_FocusPointRadius; //0x00A4
        float m_InstantFlagReturnRadius; //0x00A8
        float m_Progress; //0x00AC
        float m_ProgressPlayerSpeedUpPercentage; //0x00B0
        unsigned __int32 m_TrackedPlayersInRange; //0x00B4
        float m_TrackingPlayerRange; //0x00B8
        float m_ProgressTime; //0x00BC
        bool m_OnlyShowSnapped; //0x00C0
        bool m_FlagControlMarker; //0x00C1
        bool m_ShowProgress; //0x00C2
        bool m_UseMarkerTransform; //0x00C3
        bool m_IsVisible; //0x00C4
        bool m_Snap; //0x00C5
        bool m_ShowAirTargetBox; //0x00C6
        bool m_IsFocusPoint; //0x00C7
        char _0x00C8[8];
    };//Size=0x00D0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01734
    // RuntimeId: 05728
    // TypeInfo:  0x023FFD38
#ifndef _MessageEntityData_
#define _MessageEntityData_
#pragma pack(push, 4)
    class MessageEntityData : public EntityData
    {
    public:
        static __inline MessageEntityData* DefaultInstance()
        {
            return (MessageEntityData*)0xF8832B88;
        }
        static __inline unsigned int ClassId()
        {
            return 1734;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFD38;
        }
        char* m_MessageSid; //0x000C
        Array<MessageLineData> m_AdditionalMessages; //0x0010
        UIMessageEntityType m_MessageType; //0x0014
        float m_DisplayTime; //0x0018
        EntryInputActionEnum m_EntryInputAction; //0x001C
        bool m_Enabled; //0x0020
        char _0x0021[3];
    };//Size=0x0024
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01904
    // RuntimeId: 05722
    // TypeInfo:  0x023FFCEC
#ifndef _TacticalObjectiveEntityData_
#define _TacticalObjectiveEntityData_
#pragma pack(push, 16)
    class TacticalObjectiveEntityData : public GameEntityData
    {
    public:
        static __inline TacticalObjectiveEntityData* DefaultInstance()
        {
            return (TacticalObjectiveEntityData*)0xF8837240;
        }
        static __inline unsigned int ClassId()
        {
            return 1904;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFCEC;
        }
        char* m_MissionSid; //0x0060
        char* m_BriefingSidTeam1; //0x0064
        char* m_BriefingSidTeam2; //0x0068
        float m_Team1Timer; //0x006C
        float m_Team2Timer; //0x0070
        char _0x0074[12];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01905
    // RuntimeId: 05720
    // TypeInfo:  0x023FFCC0
#ifndef _LevelControlEntityData_
#define _LevelControlEntityData_
#pragma pack(push, 16)
    class LevelControlEntityData : public GameEntityData
    {
    public:
        static __inline LevelControlEntityData* DefaultInstance()
        {
            return (LevelControlEntityData*)0xF8837300;
        }
        static __inline unsigned int ClassId()
        {
            return 1905;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFCC0;
        }
        char* m_LevelToLoad; //0x0060
        bool m_RollCredits; //0x0064
        char _0x0065[11];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01906
    // RuntimeId: 05718
    // TypeInfo:  0x023FFC94
#ifndef _ObjectiveEntityData_
#define _ObjectiveEntityData_
#pragma pack(push, 16)
    class ObjectiveEntityData : public GameEntityData
    {
    public:
        static __inline ObjectiveEntityData* DefaultInstance()
        {
            return (ObjectiveEntityData*)0xF88373B0;
        }
        static __inline unsigned int ClassId()
        {
            return 1906;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFC94;
        }
        char* m_ObjectiveBriefSid; //0x0060
        char* m_ObjectiveSid; //0x0064
        MissionObjectiveHudData* m_HudData; //0x0068
        ObjectiveType m_ObjectiveType; //0x006C
        float m_DisplayTime; //0x0070
        float m_DelayTime; //0x0074
        SquadId m_SquadId; //0x0078
        TeamId m_TeamId; //0x007C
        char* m_SuccessSid; //0x0080
        MessageReciever m_Reciever; //0x0084
        bool m_RetriggerSuccessOnShowObjective; //0x0088
        bool m_Tutorial; //0x0089
        bool m_DisplaySuccess; //0x008A
        char _0x008B[5];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00919
    // RuntimeId: 05714
    // TypeInfo:  0x023FFC58
#ifndef _MissionObjectiveHudData_
#define _MissionObjectiveHudData_
#pragma pack(push, 16)
    class MissionObjectiveHudData : public DataContainer
    {
    public:
        static __inline MissionObjectiveHudData* DefaultInstance()
        {
            return (MissionObjectiveHudData*)0xF8821160;
        }
        static __inline unsigned int ClassId()
        {
            return 919;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFC58;
        }
        char _0x0008[8];
        Vec3 m_CameraPosition; //0x0010
        Vec2 m_HorizontalBoundaries; //0x0020
        Vec2 m_VerticalBoundaries; //0x0028
        float m_CameraRotation; //0x0030
        float m_CameraFov; //0x0034
        float m_CameraLookDistance; //0x0038
        float m_CameraDistance; //0x003C
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01907
    // RuntimeId: 05710
    // TypeInfo:  0x023FFC1C
#ifndef _MovieEntityData_
#define _MovieEntityData_
#pragma pack(push, 16)
    class MovieEntityData : public GameEntityData
    {
    public:
        static __inline MovieEntityData* DefaultInstance()
        {
            return (MovieEntityData*)0xF8837480;
        }
        static __inline unsigned int ClassId()
        {
            return 1907;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFC1C;
        }
        MovieTextureAsset* m_Movie; //0x0060
        float m_ExternalTime; //0x0064
        bool m_IsNormalMap; //0x0068
        char _0x0069[7];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01735
    // RuntimeId: 05708
    // TypeInfo:  0x023FFBF0
#ifndef _PlayVideoEntityData_
#define _PlayVideoEntityData_
#pragma pack(push, 4)
    class PlayVideoEntityData : public EntityData
    {
    public:
        static __inline PlayVideoEntityData* DefaultInstance()
        {
            return (PlayVideoEntityData*)0xF8832BC0;
        }
        static __inline unsigned int ClassId()
        {
            return 1735;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFBF0;
        }
        MovieTextureAsset* m_Movie; //0x000C
        bool m_KeepBlackScreen; //0x0010
        bool m_AllowSkip; //0x0011
        char _0x0012[2];
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01736
    // RuntimeId: 05706
    // TypeInfo:  0x023FFBC4
#ifndef _FadeEntityData_
#define _FadeEntityData_
#pragma pack(push, 4)
    class FadeEntityData : public EntityData
    {
    public:
        static __inline FadeEntityData* DefaultInstance()
        {
            return (FadeEntityData*)0xF8832BE8;
        }
        static __inline unsigned int ClassId()
        {
            return 1736;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFBC4;
        }
        float m_FadeTime; //0x000C
        float m_MaxWaitFadedWhileStreamingTime; //0x0010
        bool m_FadeScreen; //0x0014
        bool m_FadeUI; //0x0015
        bool m_FadeRumble; //0x0016
        bool m_FadeAudio; //0x0017
        bool m_FadeMovie; //0x0018
        bool m_StartFaded; //0x0019
        char _0x001A[2];
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01908
    // RuntimeId: 05704
    // TypeInfo:  0x023FFB98
#ifndef _AmmoCrateEntityData_
#define _AmmoCrateEntityData_
#pragma pack(push, 16)
    class AmmoCrateEntityData : public GameEntityData
    {
    public:
        static __inline AmmoCrateEntityData* DefaultInstance()
        {
            return (AmmoCrateEntityData*)0xF8837530;
        }
        static __inline unsigned int ClassId()
        {
            return 1908;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFB98;
        }
        MapMarkerEntityData* m_Marker; //0x0060
        StaticModelEntityData* m_Model; //0x0064
        float m_RefillDelay; //0x0068
        float m_Radius; //0x006C
        bool m_EnableReplenish; //0x0070
        char _0x0071[15];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01947
    // RuntimeId: 04672
    // TypeInfo:  0x023F5978
#ifndef _InteractionEntityData_
#define _InteractionEntityData_
#pragma pack(push, 16)
    class InteractionEntityData : public GameEntityData
    {
    public:
        static __inline InteractionEntityData* DefaultInstance()
        {
            return (InteractionEntityData*)0xF88394B0;
        }
        static __inline unsigned int ClassId()
        {
            return 1947;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023F5978;
        }
        float m_UseWithinRadius; //0x0060
        float m_UseWithinAngle; //0x0064
        SoundAsset* m_PreInteractionSoundEffect; //0x0068
        unsigned __int32 m_MaxUses; //0x006C
        bool m_AllowInteractionViaRemoteEntry; //0x0070
        bool m_TestIfOccluded; //0x0071
        char _0x0072[14];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01909
    // RuntimeId: 05694
    // TypeInfo:  0x023FFB10
#ifndef _KillAllEntityData_
#define _KillAllEntityData_
#pragma pack(push, 16)
    class KillAllEntityData : public GameEntityData
    {
    public:
        static __inline KillAllEntityData* DefaultInstance()
        {
            return (KillAllEntityData*)0xF88375F0;
        }
        static __inline unsigned int ClassId()
        {
            return 1909;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFB10;
        }
        bool m_KillAllHumanSoldiers; //0x0060
        char _0x0061[15];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01737
    // RuntimeId: 05692
    // TypeInfo:  0x023FFAE4
#ifndef _WaypointTriggerEntityData_
#define _WaypointTriggerEntityData_
#pragma pack(push, 4)
    class WaypointTriggerEntityData : public EntityData
    {
    public:
        static __inline WaypointTriggerEntityData* DefaultInstance()
        {
            return (WaypointTriggerEntityData*)0xF8832C18;
        }
        static __inline unsigned int ClassId()
        {
            return 1737;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFAE4;
        }
        Realm m_Realm; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01910
    // RuntimeId: 05690
    // TypeInfo:  0x023FFAB8
#ifndef _CombatAreaTriggerEntityData_
#define _CombatAreaTriggerEntityData_
#pragma pack(push, 16)
    class CombatAreaTriggerEntityData : public GameEntityData
    {
    public:
        static __inline CombatAreaTriggerEntityData* DefaultInstance()
        {
            return (CombatAreaTriggerEntityData*)0xF88376A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1910;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFAB8;
        }
        float m_MaxRandomSpawnHeight; //0x0060
        float m_SpawnHeight; //0x0064
        unsigned __int32 m_TimeToReturn; //0x0068
        BulletEntityData* m_DeserterProjectile; //0x006C
        TeamId m_Team; //0x0070
        float m_StrikeRadius; //0x0074
        float m_InitalSpeed; //0x0078
        bool m_IsAiAllowedOutside; //0x007C
        bool m_IsTeamSpecific; //0x007D
        char _0x007E[2];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01911
    // RuntimeId: 05688
    // TypeInfo:  0x023FFA8C
#ifndef _SurroundingGeometryEntityData_
#define _SurroundingGeometryEntityData_
#pragma pack(push, 16)
    class SurroundingGeometryEntityData : public GameEntityData
    {
    public:
        static __inline SurroundingGeometryEntityData* DefaultInstance()
        {
            return (SurroundingGeometryEntityData*)0xF8837760;
        }
        static __inline unsigned int ClassId()
        {
            return 1911;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFA8C;
        }
        AllowedVehiclesData* m_AllowedVehicleList; //0x0060
        CombatAreaTriggerEntityData* m_CombatArea; //0x0064
        unsigned __int32 m_CombatAreaIndex; //0x0068
        char _0x006C[4];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01912
    // RuntimeId: 05686
    // TypeInfo:  0x023FFA60
#ifndef _UIMinimapVolumeEntityData_
#define _UIMinimapVolumeEntityData_
#pragma pack(push, 16)
    class UIMinimapVolumeEntityData : public GameEntityData
    {
    public:
        static __inline UIMinimapVolumeEntityData* DefaultInstance()
        {
            return (UIMinimapVolumeEntityData*)0xF8837810;
        }
        static __inline unsigned int ClassId()
        {
            return 1912;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFA60;
        }
        Asset* m_Asset; //0x0060
        bool m_IsDefault; //0x0064
        char _0x0065[11];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01541
    // RuntimeId: 05684
    // TypeInfo:  0x023FFA34
#ifndef _UICombatAreaEntityData_
#define _UICombatAreaEntityData_
#pragma pack(push, 4)
    class UICombatAreaEntityData : public GameObjectData
    {
    public:
        static __inline UICombatAreaEntityData* DefaultInstance()
        {
            return (UICombatAreaEntityData*)0xF882AD00;
        }
        static __inline unsigned int ClassId()
        {
            return 1541;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFA34;
        }
        UICombatAreaAsset* m_Asset; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00921
    // RuntimeId: 05682
    // TypeInfo:  0x023FFA08
#ifndef _AllowedVehiclesData_
#define _AllowedVehiclesData_
#pragma pack(push, 4)
    class AllowedVehiclesData : public DataContainer
    {
    public:
        static __inline AllowedVehiclesData* DefaultInstance()
        {
            return (AllowedVehiclesData*)0xF8821238;
        }
        static __inline unsigned int ClassId()
        {
            return 921;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FFA08;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01913
    // RuntimeId: 05680
    // TypeInfo:  0x023FF9DC
#ifndef _DeathAreaTriggerEntityData_
#define _DeathAreaTriggerEntityData_
#pragma pack(push, 16)
    class DeathAreaTriggerEntityData : public GameEntityData
    {
    public:
        static __inline DeathAreaTriggerEntityData* DefaultInstance()
        {
            return (DeathAreaTriggerEntityData*)0xF88378C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1913;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF9DC;
        }
        float m_Damage; //0x0060
        float m_TimeToReturn; //0x0064
        char _0x0068[8];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01914
    // RuntimeId: 05678
    // TypeInfo:  0x023FF9B0
#ifndef _CapturePointEntityData_
#define _CapturePointEntityData_
#pragma pack(push, 16)
    class CapturePointEntityData : public GameEntityData
    {
    public:
        static __inline CapturePointEntityData* DefaultInstance()
        {
            return (CapturePointEntityData*)0xF8837970;
        }
        static __inline unsigned int ClassId()
        {
            return 1914;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF9B0;
        }
        __int32 m_EnemyTicketLossWhenCaptured; //0x0060
        __int32 m_MinNrToTakeControl; //0x0064
        Array<ObjectBlueprint*> m_FlagTemplates; //0x0068
        ObjectBlueprint* m_CapturePoint; //0x006C
        TeamId m_InitialOwnerTeam; //0x0070
        float m_CaptureRadius; //0x0074
        __int32 m_MaxCaptureMultiplier; //0x0078
        __int32 m_AreaValue; //0x007C
        unsigned __int32 m_SpawnMenuListOrdinal; //0x0080
        Array<AreaValueTeam> m_AreaValues; //0x0084
        __int32 m_TimeToGetControl; //0x0088
        __int32 m_TimeToLoseControl; //0x008C
        float m_ReturnMultiplier; //0x0090
        __int32 m_OnlyTakeableByTeam; //0x0094
        float m_ShowRadius; //0x0098
        float m_HideRadius; //0x009C
        float m_AddedMultiplierPerPlayer; //0x00A0
        float m_Modify3DIconVerticalOffset; //0x00A4
        CapturableType m_CapturableType; //0x00A8
        char* m_IntruderWarningSID; //0x00AC
        bool m_IsCapturedInUpperSphere; //0x00B0
        bool m_DisableWhenLosingControl; //0x00B1
        bool m_LoseControlWhenNotClose; //0x00B2
        bool m_DisableIfEnemyInside; //0x00B3
        bool m_IsVisible; //0x00B4
        bool m_ForceSnap; //0x00B5
        bool m_UseAreaValuesPerTeam; //0x00B6
        bool m_IntruderWarning; //0x00B7
        bool m_ShowOnMinimap; //0x00B8
        bool m_HoistFlag; //0x00B9
        bool m_StartAtBottom; //0x00BA
        bool m_RemoveWhenCaptured; //0x00BB
        bool m_SeesawCapturing; //0x00BC
        char _0x00BD[3];
    };//Size=0x00C0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01915
    // RuntimeId: 05672
    // TypeInfo:  0x023FF964
#ifndef _FlagCounterEntityData_
#define _FlagCounterEntityData_
#pragma pack(push, 16)
    class FlagCounterEntityData : public GameEntityData
    {
    public:
        static __inline FlagCounterEntityData* DefaultInstance()
        {
            return (FlagCounterEntityData*)0xF8837A80;
        }
        static __inline unsigned int ClassId()
        {
            return 1915;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF964;
        }
        TeamId m_TeamId; //0x0060
        float m_EnemyFlagProgress; //0x0064
        float m_RoundTime; //0x0068
        __int32 m_ObjectiveFlagCount; //0x006C
        bool m_VisibleInMinimap; //0x0070
        char _0x0071[15];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01916
    // RuntimeId: 05670
    // TypeInfo:  0x023FF938
#ifndef _TicketCounterEntityData_
#define _TicketCounterEntityData_
#pragma pack(push, 16)
    class TicketCounterEntityData : public GameEntityData
    {
    public:
        static __inline TicketCounterEntityData* DefaultInstance()
        {
            return (TicketCounterEntityData*)0xF8837B30;
        }
        static __inline unsigned int ClassId()
        {
            return 1916;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF938;
        }
        Array<TicketCountPercentage> m_TicketPercentages; //0x0060
        __int32 m_TicketLossPerMin; //0x0064
        TicketDecreaseType m_DecreaseTickets; //0x0068
        TeamId m_TeamId; //0x006C
        __int32 m_TicketLossWhenLostAll; //0x0070
        __int32 m_TicketLossWhenLostAllControlsPoint; //0x0074
        __int32 m_InitialTicketCount; //0x0078
        __int32 m_TicketLossStart; //0x007C
        bool m_SetBestSquadSpawner; //0x0080
        bool m_HaltTicketLossOnEqualPointCount; //0x0081
        bool m_ResetCapturePointsOnReset; //0x0082
        bool m_SpawnAlwaysAllowed; //0x0083
        char _0x0084[12];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01917
    // RuntimeId: 05664
    // TypeInfo:  0x023FF8EC
#ifndef _HumanPlayerEntityData_
#define _HumanPlayerEntityData_
#pragma pack(push, 16)
    class HumanPlayerEntityData : public GameEntityData
    {
    public:
        static __inline HumanPlayerEntityData* DefaultInstance()
        {
            return (HumanPlayerEntityData*)0xF8837C00;
        }
        static __inline unsigned int ClassId()
        {
            return 1917;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF8EC;
        }
        float m_PlayerKilledDelay; //0x0060
        char* m_LastManStandingSid; //0x0064
        float m_DisplayTime; //0x0068
        char _0x006C[4];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01918
    // RuntimeId: 05662
    // TypeInfo:  0x023FF8C0
#ifndef _TeamEntityData_
#define _TeamEntityData_
#pragma pack(push, 16)
    class TeamEntityData : public GameEntityData
    {
    public:
        static __inline TeamEntityData* DefaultInstance()
        {
            return (TeamEntityData*)0xF8837CB0;
        }
        static __inline unsigned int ClassId()
        {
            return 1918;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF8C0;
        }
        TeamData* m_Team; //0x0060
        TeamId m_Id; //0x0064
        char _0x0068[8];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02164
    // RuntimeId: 05658
    // TypeInfo:  0x023FF868
#ifndef _TeamAsset_
#define _TeamAsset_
#pragma pack(push, 4)
    class TeamAsset : public Asset
    {
    public:
        static __inline TeamAsset* DefaultInstance()
        {
            return (TeamAsset*)0xF883FBE0;
        }
        static __inline unsigned int ClassId()
        {
            return 2164;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF868;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02165
    // RuntimeId: 05660
    // TypeInfo:  0x023FF894
#ifndef _TeamData_
#define _TeamData_
#pragma pack(push, 4)
    class TeamData : public TeamAsset
    {
    public:
        static __inline TeamData* DefaultInstance()
        {
            return (TeamData*)0xF883FC00;
        }
        static __inline unsigned int ClassId()
        {
            return 2165;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF894;
        }
        SoldierBlueprint* m_Soldier; //0x000C
        FactionId m_Faction; //0x0010
        Array<SoldierCustomizationAsset*> m_SoldierCustomization; //0x0014
        Array<VehicleCustomizationAsset*> m_VehicleCustomization; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02166
    // RuntimeId: 05656
    // TypeInfo:  0x023FF83C
#ifndef _PlayFromHereAsset_
#define _PlayFromHereAsset_
#pragma pack(push, 4)
    class PlayFromHereAsset : public Asset
    {
    public:
        static __inline PlayFromHereAsset* DefaultInstance()
        {
            return (PlayFromHereAsset*)0xF883FC30;
        }
        static __inline unsigned int ClassId()
        {
            return 2166;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF83C;
        }
        Blueprint* m_Soldier; //0x000C
        AnimatedSkeletonDatabase* m_AnimatedSkeletonDatabase; //0x0010
        AntProjectAsset* m_AntProject; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00922
    // RuntimeId: 05654
    // TypeInfo:  0x023FF810
#ifndef _EntityTransformData_
#define _EntityTransformData_
#pragma pack(push, 4)
    class EntityTransformData : public DataContainer
    {
    public:
        static __inline EntityTransformData* DefaultInstance()
        {
            return (EntityTransformData*)0xF8821258;
        }
        static __inline unsigned int ClassId()
        {
            return 922;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF810;
        }
        Array<LinearTransform> m_EntityTransforms; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00923
    // RuntimeId: 05652
    // TypeInfo:  0x023FF7E4
#ifndef _LevelSaveData_
#define _LevelSaveData_
#pragma pack(push, 4)
    class LevelSaveData : public DataContainer
    {
    public:
        static __inline LevelSaveData* DefaultInstance()
        {
            return (LevelSaveData*)0xF8821278;
        }
        static __inline unsigned int ClassId()
        {
            return 923;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF7E4;
        }
        unsigned __int32 m_SaveSize; //0x0008
        Array<char*> m_SaveNames; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00924
    // RuntimeId: 05650
    // TypeInfo:  0x023FF7B8
#ifndef _AnimatedSkeletonDatabase_
#define _AnimatedSkeletonDatabase_
#pragma pack(push, 4)
    class AnimatedSkeletonDatabase : public DataContainer
    {
    public:
        static __inline AnimatedSkeletonDatabase* DefaultInstance()
        {
            return (AnimatedSkeletonDatabase*)0xF88212A0;
        }
        static __inline unsigned int ClassId()
        {
            return 924;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF7B8;
        }
        Array<RagdollAsset*> m_Ragdolls; //0x0008
        Array<AnimatedSkeletonDatabaseItem> m_Items; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02416
    // RuntimeId: 00102
    // TypeInfo:  0x023C2D18
#ifndef _DataBusData_
#define _DataBusData_
#pragma pack(push, 4)
    class DataBusData : public Asset
    {
    public:
        static __inline DataBusData* DefaultInstance()
        {
            return (DataBusData*)0xF8843000;
        }
        static __inline unsigned int ClassId()
        {
            return 2416;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023C2D18;
        }
        Array<PropertyConnection> m_PropertyConnections; //0x000C
        Array<LinkConnection> m_LinkConnections; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00925
    // RuntimeId: 05644
    // TypeInfo:  0x023FF750
#ifndef _CameraTransition_
#define _CameraTransition_
#pragma pack(push, 4)
    class CameraTransition : public DataContainer
    {
    public:
        static __inline CameraTransition* DefaultInstance()
        {
            return (CameraTransition*)0xF88212C8;
        }
        static __inline unsigned int ClassId()
        {
            return 925;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF750;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02167
    // RuntimeId: 05642
    // TypeInfo:  0x023FF724
#ifndef _CameraModeAsset_
#define _CameraModeAsset_
#pragma pack(push, 4)
    class CameraModeAsset : public Asset
    {
    public:
        static __inline CameraModeAsset* DefaultInstance()
        {
            return (CameraModeAsset*)0xF883FC60;
        }
        static __inline unsigned int ClassId()
        {
            return 2167;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF724;
        }
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02169
    // RuntimeId: 05983
    // TypeInfo:  0x024026B8
#ifndef _AISystemAsset_
#define _AISystemAsset_
#pragma pack(push, 4)
    class AISystemAsset : public GameAISystem
    {
    public:
        static __inline AISystemAsset* DefaultInstance()
        {
            return (AISystemAsset*)0xF883FCA0;
        }
        static __inline unsigned int ClassId()
        {
            return 2169;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x024026B8;
        }
        AIVehicleTypes* m_Behaviours; //0x000C
        OrderSettings* m_Orders; //0x0010
        AISettingsData* m_Settings; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02171
    // RuntimeId: 05636
    // TypeInfo:  0x023FF6BC
#ifndef _PathfindingSandboxAsset_
#define _PathfindingSandboxAsset_
#pragma pack(push, 4)
    class PathfindingSandboxAsset : public Asset
    {
    public:
        static __inline PathfindingSandboxAsset* DefaultInstance()
        {
            return (PathfindingSandboxAsset*)0xF883FD00;
        }
        static __inline unsigned int ClassId()
        {
            return 2171;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF6BC;
        }
        PathfindingSystemEntityData* m_System; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01738
    // RuntimeId: 05634
    // TypeInfo:  0x023FF690
#ifndef _PathfindingSystemEntityData_
#define _PathfindingSystemEntityData_
#pragma pack(push, 4)
    class PathfindingSystemEntityData : public EntityData
    {
    public:
        static __inline PathfindingSystemEntityData* DefaultInstance()
        {
            return (PathfindingSystemEntityData*)0xF8832C40;
        }
        static __inline unsigned int ClassId()
        {
            return 1738;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF690;
        }
        Array<unsigned __int32> m_PathfindingTypesOnLevel; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00926
    // RuntimeId: 05632
    // TypeInfo:  0x023FF664
#ifndef _FaceAnimationWaveMappings_
#define _FaceAnimationWaveMappings_
#pragma pack(push, 4)
    class FaceAnimationWaveMappings : public DataContainer
    {
    public:
        static __inline FaceAnimationWaveMappings* DefaultInstance()
        {
            return (FaceAnimationWaveMappings*)0xF88212E8;
        }
        static __inline unsigned int ClassId()
        {
            return 926;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF664;
        }
        AntRef m_AntAsset; //0x0008
        AntRef m_OnStartedTalking; //0x000C
        Array<FaceAnimationWaveMapping> m_Mappings; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02172
    // RuntimeId: 05628
    // TypeInfo:  0x023FF628
#ifndef _BigWorldSettingsAsset_
#define _BigWorldSettingsAsset_
#pragma pack(push, 4)
    class BigWorldSettingsAsset : public Asset
    {
    public:
        static __inline BigWorldSettingsAsset* DefaultInstance()
        {
            return (BigWorldSettingsAsset*)0xF883FD28;
        }
        static __inline unsigned int ClassId()
        {
            return 2172;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF628;
        }
        Array<BigWorldSetting*> m_Settings; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00927
    // RuntimeId: 05626
    // TypeInfo:  0x023FF5FC
#ifndef _BigWorldSetting_
#define _BigWorldSetting_
#pragma pack(push, 4)
    class BigWorldSetting : public DataContainer
    {
    public:
        static __inline BigWorldSetting* DefaultInstance()
        {
            return (BigWorldSetting*)0xF8821310;
        }
        static __inline unsigned int ClassId()
        {
            return 927;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF5FC;
        }
        SoundAsset* m_Sound; //0x0008
        __int32 m_MinDistance; //0x000C
        __int32 m_MaxDistance; //0x0010
        float m_MinDelayTimeInMinutes; //0x0014
        float m_MaxDelayTimeInMinutes; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02173
    // RuntimeId: 05624
    // TypeInfo:  0x023FF5D0
#ifndef _LevelReportingAsset_
#define _LevelReportingAsset_
#pragma pack(push, 4)
    class LevelReportingAsset : public Asset
    {
    public:
        static __inline LevelReportingAsset* DefaultInstance()
        {
            return (LevelReportingAsset*)0xF883FD50;
        }
        static __inline unsigned int ClassId()
        {
            return 2173;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF5D0;
        }
        Array<LevelDescriptionAsset*> m_BuiltLevels; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02174
    // RuntimeId: 05622
    // TypeInfo:  0x023FF5A4
#ifndef _LevelDescriptionAsset_
#define _LevelDescriptionAsset_
#pragma pack(push, 4)
    class LevelDescriptionAsset : public Asset
    {
    public:
        static __inline LevelDescriptionAsset* DefaultInstance()
        {
            return (LevelDescriptionAsset*)0xF883FD78;
        }
        static __inline unsigned int ClassId()
        {
            return 2174;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF5A4;
        }
        char* m_LevelName; //0x000C
        Array<LevelDescriptionInclusionCategory> m_Categories; //0x0010
        LevelDescription m_Description; //0x0014
        Array<char*> m_StartPoints; //0x0024
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00928
    // RuntimeId: 05614
    // TypeInfo:  0x023FF52C
#ifndef _LevelDescriptionComponent_
#define _LevelDescriptionComponent_
#pragma pack(push, 4)
    class LevelDescriptionComponent : public DataContainer
    {
    public:
        static __inline LevelDescriptionComponent* DefaultInstance()
        {
            return (LevelDescriptionComponent*)0xF8821340;
        }
        static __inline unsigned int ClassId()
        {
            return 928;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF52C;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00929
    // RuntimeId: 05618
    // TypeInfo:  0x023FF568
#ifndef _MemoryLevelDescriptionComponent_
#define _MemoryLevelDescriptionComponent_
#pragma pack(push, 4)
    class MemoryLevelDescriptionComponent : public LevelDescriptionComponent
    {
    public:
        static __inline MemoryLevelDescriptionComponent* DefaultInstance()
        {
            return (MemoryLevelDescriptionComponent*)0xF8821360;
        }
        static __inline unsigned int ClassId()
        {
            return 929;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FF568;
        }
        __int32 m_TexturePoolSize; //0x0008
        __int32 m_TexturePoolSizeXenon; //0x000C
        __int32 m_TexturePoolSizePs3; //0x0010
        __int32 m_MeshPoolSizePs3; //0x0014
        __int32 m_MeshPoolSizePs3Cell; //0x0018
        __int32 m_MeshPoolSizeXenon; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00938
    // RuntimeId: 05594
    // TypeInfo:  0x023FDF18
#ifndef _WeaponSwayData_
#define _WeaponSwayData_
#pragma pack(push, 4)
    class WeaponSwayData : public DataContainer
    {
    public:
        static __inline WeaponSwayData* DefaultInstance()
        {
            return (WeaponSwayData*)0xF8821620;
        }
        static __inline unsigned int ClassId()
        {
            return 938;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDF18;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00939
    // RuntimeId: 05596
    // TypeInfo:  0x023FDF44
#ifndef _GunSwayData_
#define _GunSwayData_
#pragma pack(push, 4)
    class GunSwayData : public WeaponSwayData
    {
    public:
        static __inline GunSwayData* DefaultInstance()
        {
            return (GunSwayData*)0xF8821640;
        }
        static __inline unsigned int ClassId()
        {
            return 939;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDF44;
        }
        GunSwayStandData m_Stand; //0x0008
        GunSwayCrouchProneData m_Crouch; //0x0120
        GunSwayCrouchProneData m_Prone; //0x01B8
        GunSwayStanceTransition m_ProneToCrouch; //0x0250
        GunSwayStanceTransition m_ProneToStand; //0x0264
        GunSwayStanceTransition m_CrouchToProne; //0x0278
        GunSwayStanceTransition m_CrouchToStand; //0x028C
        GunSwayStanceTransition m_StandToProne; //0x02A0
        GunSwayStanceTransition m_StandToCrouch; //0x02B4
        GunSwayStanceZoomModifierData m_SuppressionModifierUnzoomed; //0x02C8
        GunSwayStanceZoomModifierData m_SuppressionModifierZoomed; //0x02E8
        Array<GunSwayModifierData*> m_Modifiers; //0x0308
        float m_DeviationScaleFactorZoom; //0x030C
        float m_GameplayDeviationScaleFactorZoom; //0x0310
        float m_DeviationScaleFactorNoZoom; //0x0314
        float m_GameplayDeviationScaleFactorNoZoom; //0x0318
        float m_ShootingRecoilDecreaseScale; //0x031C
        float m_FirstShotRecoilMultiplier; //0x0320
        CameraRecoilData* m_CameraRecoil; //0x0324
    };//Size=0x0328
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02175
    // RuntimeId: 05592
    // TypeInfo:  0x023FDEEC
#ifndef _GunSwayModifierData_
#define _GunSwayModifierData_
#pragma pack(push, 4)
    class GunSwayModifierData : public Asset
    {
    public:
        static __inline GunSwayModifierData* DefaultInstance()
        {
            return (GunSwayModifierData*)0xF883FDB8;
        }
        static __inline unsigned int ClassId()
        {
            return 2175;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDEEC;
        }
        UnlockAssetBase* m_UnlockAsset; //0x000C
        GunSwayStanceZoomModifierData m_StandZoomModifier; //0x0010
        GunSwayStanceZoomModifierData m_StandNoZoomModifier; //0x0030
        GunSwayStanceZoomModifierData m_CrouchZoomModifier; //0x0050
        GunSwayStanceZoomModifierData m_CrouchNoZoomModifier; //0x0070
        GunSwayStanceZoomModifierData m_ProneZoomModifier; //0x0090
        GunSwayStanceZoomModifierData m_ProneNoZoomModifier; //0x00B0
        bool m_OnlyInSupportedShooting; //0x00D0
        bool m_OnlyOnWeaponLightEnabled; //0x00D1
        char _0x00D2[2];
    };//Size=0x00D4
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00940
    // RuntimeId: 05574
    // TypeInfo:  0x023FDE40
#ifndef _CameraRecoilData_
#define _CameraRecoilData_
#pragma pack(push, 4)
    class CameraRecoilData : public DataContainer
    {
    public:
        static __inline CameraRecoilData* DefaultInstance()
        {
            return (CameraRecoilData*)0xF8821980;
        }
        static __inline unsigned int ClassId()
        {
            return 940;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDE40;
        }
        float m_SpringConstant; //0x0008
        float m_SpringDamping; //0x000C
        float m_SpringMinThresholdAngle; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01739
    // RuntimeId: 05566
    // TypeInfo:  0x023FDDE4
#ifndef _WeaponLagEntityData_
#define _WeaponLagEntityData_
#pragma pack(push, 4)
    class WeaponLagEntityData : public EntityData
    {
    public:
        static __inline WeaponLagEntityData* DefaultInstance()
        {
            return (WeaponLagEntityData*)0xF8832C68;
        }
        static __inline unsigned int ClassId()
        {
            return 1739;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDDE4;
        }
        WeaponLagBinding m_Binding; //0x000C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01953
    // RuntimeId: 05336
    // TypeInfo:  0x023FD014
#ifndef _ProjectileEntityData_
#define _ProjectileEntityData_
#pragma pack(push, 16)
    class ProjectileEntityData : public GamePhysicsEntityData
    {
    public:
        static __inline ProjectileEntityData* DefaultInstance()
        {
            return (ProjectileEntityData*)0xF88399C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1953;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FD014;
        }
        float m_VisualConvergeDistance; //0x0070
        float m_InitialSpeed; //0x0074
        float m_TimeToLive; //0x0078
        unsigned __int32 m_MaxCount; //0x007C
        float m_InitMeshHideTime; //0x0080
        MaterialContainerPair* m_MaterialPair; //0x0084
        AntHitReactionWeaponType m_HitReactionWeaponType; //0x0088
        ExplosionEntityData* m_Explosion; //0x008C
        WeaponSuppressionData* m_SuppressionData; //0x0090
        char* m_AmmunitionType; //0x0094
        bool m_ServerProjectileDisabled; //0x0098
        bool m_DetonateOnTimeout; //0x0099
        bool m_SuppressOwnerVehicleDamage; //0x009A
        char _0x009B[5];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00963
    // RuntimeId: 05416
    // TypeInfo:  0x023FD438
#ifndef _ToolData_
#define _ToolData_
#pragma pack(push, 4)
    class ToolData : public DataContainer
    {
    public:
        static __inline ToolData* DefaultInstance()
        {
            return (ToolData*)0xF8821F10;
        }
        static __inline unsigned int ClassId()
        {
            return 963;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FD438;
        }
        bool m_IsAlwaysActive; //0x0008
        char _0x0009[3];
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00941
    // RuntimeId: 05544
    // TypeInfo:  0x023FDCD0
#ifndef _WeaponOverrideData_
#define _WeaponOverrideData_
#pragma pack(push, 4)
    class WeaponOverrideData : public DataContainer
    {
    public:
        static __inline WeaponOverrideData* DefaultInstance()
        {
            return (WeaponOverrideData*)0xF88219A8;
        }
        static __inline unsigned int ClassId()
        {
            return 941;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDCD0;
        }
        DataContainer* m_Data; //0x0008
        Array<WeaponOverrideValue> m_Values; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00942
    // RuntimeId: 05538
    // TypeInfo:  0x023FDC84
#ifndef _BoneFakePhysicsData_
#define _BoneFakePhysicsData_
#pragma pack(push, 4)
    class BoneFakePhysicsData : public DataContainer
    {
    public:
        static __inline BoneFakePhysicsData* DefaultInstance()
        {
            return (BoneFakePhysicsData*)0xF88219D0;
        }
        static __inline unsigned int ClassId()
        {
            return 942;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDC84;
        }
        FakePhysicsData* m_FakePhysics; //0x0008
        char* m_BoneName; //0x000C
        __int32 m_BoneId; //0x0010
    };//Size=0x0014
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01919
    // RuntimeId: 05494
    // TypeInfo:  0x023FD948
#ifndef _WeaponEntityData_
#define _WeaponEntityData_
#pragma pack(push, 16)
    class WeaponEntityData : public GameEntityData
    {
    public:
        static __inline WeaponEntityData* DefaultInstance()
        {
            return (WeaponEntityData*)0xF8837D60;
        }
        static __inline unsigned int ClassId()
        {
            return 1919;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FD948;
        }
        Array<WeaponStateData> m_WeaponStates; //0x0060
        WeaponClassEnum m_WeaponClass; //0x0064
        GameAIWeaponData* m_AIData; //0x0068
        WeaponFiringData* m_WeaponFiring; //0x006C
        WeaponData* m_CustomWeaponType; //0x0070
        char _0x0074[12];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00943
    // RuntimeId: 05496
    // TypeInfo:  0x023FD974
#ifndef _WeaponModifierBase_
#define _WeaponModifierBase_
#pragma pack(push, 4)
    class WeaponModifierBase : public DataContainer
    {
    public:
        static __inline WeaponModifierBase* DefaultInstance()
        {
            return (WeaponModifierBase*)0xF88219F8;
        }
        static __inline unsigned int ClassId()
        {
            return 943;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FD974;
        }
    };//Size=0x0008
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00945
    // RuntimeId: 05526
    // TypeInfo:  0x023FDBD0
#ifndef _WeaponClassModifier_
#define _WeaponClassModifier_
#pragma pack(push, 4)
    class WeaponClassModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponClassModifier* DefaultInstance()
        {
            return (WeaponClassModifier*)0xF8821A48;
        }
        static __inline unsigned int ClassId()
        {
            return 945;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDBD0;
        }
        WeaponClassEnum m_WeaponClass; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00946
    // RuntimeId: 05524
    // TypeInfo:  0x023FDBA4
#ifndef _WeaponAnimatedFireTypeModifier_
#define _WeaponAnimatedFireTypeModifier_
#pragma pack(push, 4)
    class WeaponAnimatedFireTypeModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAnimatedFireTypeModifier* DefaultInstance()
        {
            return (WeaponAnimatedFireTypeModifier*)0xF8821A68;
        }
        static __inline unsigned int ClassId()
        {
            return 946;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDBA4;
        }
        AnimatedFireEnum m_AnimatedFireType; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00947
    // RuntimeId: 05522
    // TypeInfo:  0x023FDB78
#ifndef _WeaponZoomModifier_
#define _WeaponZoomModifier_
#pragma pack(push, 4)
    class WeaponZoomModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponZoomModifier* DefaultInstance()
        {
            return (WeaponZoomModifier*)0xF8821A88;
        }
        static __inline unsigned int ClassId()
        {
            return 947;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDB78;
        }
        float m_ZoomRenderFov; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00948
    // RuntimeId: 05520
    // TypeInfo:  0x023FDB4C
#ifndef _WeaponMagazineModifier_
#define _WeaponMagazineModifier_
#pragma pack(push, 4)
    class WeaponMagazineModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponMagazineModifier* DefaultInstance()
        {
            return (WeaponMagazineModifier*)0xF8821AA8;
        }
        static __inline unsigned int ClassId()
        {
            return 948;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDB4C;
        }
        __int32 m_MagazineCapacity; //0x0008
        __int32 m_NumberOfMagazines; //0x000C
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00949
    // RuntimeId: 05518
    // TypeInfo:  0x023FDB20
#ifndef _WeaponAnimTypeModifier_
#define _WeaponAnimTypeModifier_
#pragma pack(push, 4)
    class WeaponAnimTypeModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAnimTypeModifier* DefaultInstance()
        {
            return (WeaponAnimTypeModifier*)0xF8821AD0;
        }
        static __inline unsigned int ClassId()
        {
            return 949;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDB20;
        }
        WeaponAnimType m_WeaponAnimType; //0x0008
    };//Size=0x000C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00950
    // RuntimeId: 05514
    // TypeInfo:  0x023FDAE4
#ifndef _WeaponAnimationConfigurationModifier_
#define _WeaponAnimationConfigurationModifier_
#pragma pack(push, 4)
    class WeaponAnimationConfigurationModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAnimationConfigurationModifier* DefaultInstance()
        {
            return (WeaponAnimationConfigurationModifier*)0xF8821AF0;
        }
        static __inline unsigned int ClassId()
        {
            return 950;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x023FDAE4;
        }
        Array<float> m_ZoomInOutMeshTransitionFactors; //0x0008
        AnimationConfigurationData m_AnimationConfiguration; //0x000C
        AnimatedFireEnum m_AnimatedFireType; //0x0018
    };//Size=0x001C
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00951
    // RuntimeId: 05512
    // TypeInfo:  0x023FDAB8
#ifndef _WeaponAimingSimulationModifier_
#define _WeaponAimingSimulationModifier_
#pragma pack(push, 4)
    class WeaponAimingSimulationModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAimingSimulationModifier* DefaultInstance()
        {
            return (WeaponAimingSimulationModifier*)0xF8821B20;
        }
        static __inline unsigned int ClassId()
        {
            return 951;
        }
