#pragma once

#include "declarations.h"
#include "structs.h"

namespace fb
{
    ////////////////////////////////////////
// ClassId:   01420
// RuntimeId: 03765
// TypeInfo:  0x0000000142BFDFA0
#ifndef _DataContainer_
#define _DataContainer_
#pragma pack(push, 8)
    class DataContainer
    {
    public:
        static __inline DataContainer* DefaultInstance()
        {
            return (DataContainer*)0x0000000068980080;
        }
        static __inline unsigned int ClassId()
        {
            return 1420;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142BFDFA0;
        }
        char _0x0000[16];
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01491
    // RuntimeId: 03791
    // TypeInfo:  0x0000000142BFF590
#ifndef _Asset_
#define _Asset_
#pragma pack(push, 8)
    class Asset : public DataContainer
    {
    public:
        static __inline Asset* DefaultInstance()
        {
            return (Asset*)0x0000000068A21D40;
        }
        static __inline unsigned int ClassId()
        {
            return 1491;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142BFF590;
        }
        char* m_Name; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01918
    // RuntimeId: 10206
    // TypeInfo:  0x0000000142C92D80
#ifndef _WebBrowserLocalURLAsset_
#define _WebBrowserLocalURLAsset_
#pragma pack(push, 8)
    class WebBrowserLocalURLAsset : public Asset
    {
    public:
        static __inline WebBrowserLocalURLAsset* DefaultInstance()
        {
            return (WebBrowserLocalURLAsset*)0x0000000068A2B1E0;
        }
        static __inline unsigned int ClassId()
        {
            return 1918;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C92D80;
        }
        char* m_LocalPath; //0x0018
        RawFileDataAsset* m_File; //0x0020
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03248
    // RuntimeId: 06903
    // TypeInfo:  0x0000000142C4B780
#ifndef _LevelDescriptionComponent_
#define _LevelDescriptionComponent_
#pragma pack(push, 8)
    class LevelDescriptionComponent : public DataContainer
    {
    public:
        static __inline LevelDescriptionComponent* DefaultInstance()
        {
            return (LevelDescriptionComponent*)0x0000000068A5A0A0;
        }
        static __inline unsigned int ClassId()
        {
            return 3248;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C4B780;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03838
    // RuntimeId: 03801
    // TypeInfo:  0x0000000142BFF470
#ifndef _SystemSettings_
#define _SystemSettings_
#pragma pack(push, 8)
    class SystemSettings : public DataContainer
    {
    public:
        static __inline SystemSettings* DefaultInstance()
        {
            return (SystemSettings*)0x0000000068A66FE0;
        }
        static __inline unsigned int ClassId()
        {
            return 3838;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142BFF470;
        }
        char* m_Name; //0x0010
        GamePlatform m_Platform; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02192
    // RuntimeId: 03797
    // TypeInfo:  0x0000000142BFF530
#ifndef _GameDataContainer_
#define _GameDataContainer_
#pragma pack(push, 8)
    class GameDataContainer : public DataContainer
    {
    public:
        static __inline GameDataContainer* DefaultInstance()
        {
            return (GameDataContainer*)0x0000000068A30FA0;
        }
        static __inline unsigned int ClassId()
        {
            return 2192;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142BFF530;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02194
    // RuntimeId: 03799
    // TypeInfo:  0x0000000142BFF4D0
#ifndef _DataBusPeer_
#define _DataBusPeer_
#pragma pack(push, 8)
    class DataBusPeer : public GameDataContainer
    {
    public:
        static __inline DataBusPeer* DefaultInstance()
        {
            return (DataBusPeer*)0x0000000068A31110;
        }
        static __inline unsigned int ClassId()
        {
            return 2194;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142BFF4D0;
        }
        unsigned __int32 m_Flags; //0x0010
        char _0x0014[4];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02195
    // RuntimeId: 05098
    // TypeInfo:  0x0000000142C202F0
#ifndef _GameObjectData_
#define _GameObjectData_
#pragma pack(push, 8)
    class GameObjectData : public DataBusPeer
    {
    public:
        static __inline GameObjectData* DefaultInstance()
        {
            return (GameObjectData*)0x0000000068A31140;
        }
        static __inline unsigned int ClassId()
        {
            return 2195;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C202F0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03017
    // RuntimeId: 05114
    // TypeInfo:  0x0000000142C200B0
#ifndef _ComponentData_
#define _ComponentData_
#pragma pack(push, 16)
    class ComponentData : public GameObjectData
    {
    public:
        static __inline ComponentData* DefaultInstance()
        {
            return (ComponentData*)0x0000000068A4E020;
        }
        static __inline unsigned int ClassId()
        {
            return 3017;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C200B0;
        }
        Array<GameObjectData*> m_Components; //0x0018
        LinearTransform m_Transform; //0x0020
        bool m_Excluded; //0x0060
        char _0x0061[15];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02228
    // RuntimeId: 05104
    // TypeInfo:  0x0000000142C20290
#ifndef _EntityData_
#define _EntityData_
#pragma pack(push, 8)
    class EntityData : public GameObjectData
    {
    public:
        static __inline EntityData* DefaultInstance()
        {
            return (EntityData*)0x0000000068A325B0;
        }
        static __inline unsigned int ClassId()
        {
            return 2228;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C20290;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01939
    // RuntimeId: 10188
    // TypeInfo:  0x0000000142C92980
#ifndef _WaterEffectSetup_
#define _WaterEffectSetup_
#pragma pack(push, 8)
    class WaterEffectSetup : public Asset
    {
    public:
        static __inline WaterEffectSetup* DefaultInstance()
        {
            return (WaterEffectSetup*)0x0000000068A2B860;
        }
        static __inline unsigned int ClassId()
        {
            return 1939;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C92980;
        }
        Array<WaterAmbientFoamEffectSpawner> m_AmbientEffects; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00314
    // RuntimeId: 05410
    // TypeInfo:  0x0000000142C23AF0
#ifndef _EntityBusPeer_
#define _EntityBusPeer_
    class EntityBusPeer
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 314;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C23AF0;
        }
        char _0x0000[8];
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00604
    // RuntimeId: 04934
    // TypeInfo:  0x0000000142C17E70
#ifndef _Entity_
#define _Entity_
    class Entity : public EntityBusPeer
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 604;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C17E70;
        }
        char _0x0008[24];
    };//Size=0x0020
#endif

    ////////////////////////////////////////
    // ClassId:   00315
    // RuntimeId: 05428
    // TypeInfo:  0x0000000142C241A0
#ifndef _Component_
#define _Component_
    class Component : public EntityBusPeer
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 315;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C241A0;
        }
        char _0x0008[24];
    };//Size=0x0020
#endif

    ////////////////////////////////////////
    // ClassId:   00654
    // RuntimeId: 05316
    // TypeInfo:  0x0000000142C23690
#ifndef _SpatialEntity_
#define _SpatialEntity_
    class SpatialEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 654;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C23690;
        }
        char _0x0020[8];
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00541
    // RuntimeId: 08241
    // TypeInfo:  0x0000000142C67880
#ifndef _PhysicsComponent_
#define _PhysicsComponent_
    class PhysicsComponent : public Component
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 541;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C67880;
        }
        char _0x0020[8];
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00675
    // RuntimeId: 05429
    // TypeInfo:  0x0000000142C24330
#ifndef _ComponentEntity_
#define _ComponentEntity_
    class ComponentEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 675;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C24330;
        }
        char _0x0028[24];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   00661
    // RuntimeId: 10176
    // TypeInfo:  0x0000000142C92320
#ifndef _WaterInteractTurbulenceDisturbEntity_
#define _WaterInteractTurbulenceDisturbEntity_
    class WaterInteractTurbulenceDisturbEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 661;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C92320;
        }
        char _0x0028[72];
    };//Size=0x0070
#endif

    ////////////////////////////////////////
    // ClassId:   02440
    // RuntimeId: 10174
    // TypeInfo:  0x0000000142C91E50
#ifndef _VoipEntityData_
#define _VoipEntityData_
#pragma pack(push, 8)
    class VoipEntityData : public EntityData
    {
    public:
        static __inline VoipEntityData* DefaultInstance()
        {
            return (VoipEntityData*)0x0000000068A371D0;
        }
        static __inline unsigned int ClassId()
        {
            return 2440;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91E50;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01361
    // RuntimeId: 10172
    // TypeInfo:  0x0000000142C91EB0
#ifndef _VoipEntity_
#define _VoipEntity_
    class VoipEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1361;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91EB0;
        }
        char _0x0020[32];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   03845
    // RuntimeId: 10171
    // TypeInfo:  0x0000000142C91940
#ifndef _TwinkleUISettings_
#define _TwinkleUISettings_
#pragma pack(push, 8)
    class TwinkleUISettings : public SystemSettings
    {
    public:
        static __inline TwinkleUISettings* DefaultInstance()
        {
            return (TwinkleUISettings*)0x0000000068A67340;
        }
        static __inline unsigned int ClassId()
        {
            return 3845;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91940;
        }
        char* m_JsHost; //0x0020
        char* m_JsBundle; //0x0028
        char* m_JsBundleProtocol; //0x0030
        char* m_RemoteBindHost; //0x0038
        __int32 m_RemoteBindPort; //0x0040
        char _0x0044[4];
        char* m_ScriptEngineBackend; //0x0048
        float m_SuspendLingeringTimeout; //0x0050
        char _0x0054[4];
        char* m_TwinkleWidgetPath; //0x0058
        char* m_TwinkleScreenPath; //0x0060
        unsigned __int32 m_MaxTexturePackingWidth; //0x0068
        unsigned __int32 m_MaxTexturePackingHeight; //0x006C
        unsigned __int32 m_DynamicAtlasSize; //0x0070
        unsigned __int32 m_StaticAtlasSize; //0x0074
        unsigned __int32 m_MaxSingleTexturesNum; //0x0078
        float m_DebugMemoryBudgetFrontEnd; //0x007C
        float m_DebugMemoryBudgetInGame; //0x0080
        char _0x0084[4];
        TwinkleStaticBundlesAsset* m_StaticBundle; //0x0088
        bool m_Enabled; //0x0090
        bool m_UseTwinkleOverlay; //0x0091
        bool m_OperationsGlobeLogicEnabled; //0x0092
        bool m_ResizeRootSurfaceToScreen; //0x0093
        bool m_UseManifestBundle; //0x0094
        bool m_HttpCacheEnabled; //0x0095
        bool m_HttpCacheWritesEnabled; //0x0096
        bool m_EnableInputConceptsForJS; //0x0097
        bool m_EnableTwinkleSpecificInputConceptsForJS; //0x0098
        bool m_DisableTextureLoading; //0x0099
        bool m_DisableFontLoading; //0x009A
        char _0x009B[5];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01546
    // RuntimeId: 10169
    // TypeInfo:  0x0000000142C919A0
#ifndef _TwinkleUIConfiguration_
#define _TwinkleUIConfiguration_
#pragma pack(push, 8)
    class TwinkleUIConfiguration : public Asset
    {
    public:
        static __inline TwinkleUIConfiguration* DefaultInstance()
        {
            return (TwinkleUIConfiguration*)0x0000000068A22FB0;
        }
        static __inline unsigned int ClassId()
        {
            return 1546;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C919A0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01799
    // RuntimeId: 10167
    // TypeInfo:  0x0000000142C91A00
#ifndef _TwinkleStaticBundlesAsset_
#define _TwinkleStaticBundlesAsset_
#pragma pack(push, 8)
    class TwinkleStaticBundlesAsset : public Asset
    {
    public:
        static __inline TwinkleStaticBundlesAsset* DefaultInstance()
        {
            return (TwinkleStaticBundlesAsset*)0x0000000068A282E0;
        }
        static __inline unsigned int ClassId()
        {
            return 1799;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91A00;
        }
        char* m_ResourceBundlePath; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02639
    // RuntimeId: 07531
    // TypeInfo:  0x0000000142C5B310
#ifndef _UIWidgetEntityData_
#define _UIWidgetEntityData_
#pragma pack(push, 8)
    class UIWidgetEntityData : public EntityData
    {
    public:
        static __inline UIWidgetEntityData* DefaultInstance()
        {
            return (UIWidgetEntityData*)0x0000000068A418C0;
        }
        static __inline unsigned int ClassId()
        {
            return 2639;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5B310;
        }
        UIElementSize m_Size; //0x0018
        Array<UIElementLayerEntityData*> m_Layers; //0x0020
        Array<UITextureMappingAsset*> m_TextureMappings; //0x0028
        Array<GameObjectData*> m_Components; //0x0030
        UICompareDataSource m_VisibilityDataSource; //0x0038
        Array<char*> m_InputEvents; //0x0058
        bool m_Visible; //0x0060
        char _0x0061[7];
    };//Size=0x0068
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02640
    // RuntimeId: 10163
    // TypeInfo:  0x0000000142C91AC0
#ifndef _TwinkleUIWidgetEntityData_
#define _TwinkleUIWidgetEntityData_
#pragma pack(push, 8)
    class TwinkleUIWidgetEntityData : public UIWidgetEntityData
    {
    public:
        static __inline TwinkleUIWidgetEntityData* DefaultInstance()
        {
            return (TwinkleUIWidgetEntityData*)0x0000000068A41940;
        }
        static __inline unsigned int ClassId()
        {
            return 2640;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91AC0;
        }
    };//Size=0x0068
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01667
    // RuntimeId: 07573
    // TypeInfo:  0x0000000142C5AC50
#ifndef _UICppScreenData_
#define _UICppScreenData_
#pragma pack(push, 8)
    class UICppScreenData : public Asset
    {
    public:
        static __inline UICppScreenData* DefaultInstance()
        {
            return (UICppScreenData*)0x0000000068A254F0;
        }
        static __inline unsigned int ClassId()
        {
            return 1667;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5AC50;
        }
        float m_FieldOfView; //0x0018
        float m_ScreenLayoutWidth; //0x001C
        float m_ScreenLayoutHeight; //0x0020
        bool m_ScaleUpAndKeepAspectRatio; //0x0024
        bool m_FlashCompatibilityMode; //0x0025
        bool m_EatAllInput; //0x0026
        bool m_LayoutWithSafeZone; //0x0027
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01919
    // RuntimeId: 10159
    // TypeInfo:  0x0000000142C91B80
#ifndef _TwinkleBundledVideos_
#define _TwinkleBundledVideos_
#pragma pack(push, 8)
    class TwinkleBundledVideos : public Asset
    {
    public:
        static __inline TwinkleBundledVideos* DefaultInstance()
        {
            return (TwinkleBundledVideos*)0x0000000068A2B220;
        }
        static __inline unsigned int ClassId()
        {
            return 1919;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91B80;
        }
        Array<MovieTextureAsset*> m_Movies; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01972
    // RuntimeId: 10157
    // TypeInfo:  0x0000000142C91BE0
#ifndef _TwinkleTtfAsset_
#define _TwinkleTtfAsset_
#pragma pack(push, 8)
    class TwinkleTtfAsset : public Asset
    {
    public:
        static __inline TwinkleTtfAsset* DefaultInstance()
        {
            return (TwinkleTtfAsset*)0x0000000068A2C7A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1972;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91BE0;
        }
        // unhandled basic type ResourceRef m_FontResource; //0x0018
        char _0x0018[8];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02274
    // RuntimeId: 10133
    // TypeInfo:  0x0000000142C91C40
#ifndef _TwinkleEnabledEntityData_
#define _TwinkleEnabledEntityData_
#pragma pack(push, 8)
    class TwinkleEnabledEntityData : public EntityData
    {
    public:
        static __inline TwinkleEnabledEntityData* DefaultInstance()
        {
            return (TwinkleEnabledEntityData*)0x0000000068A33490;
        }
        static __inline unsigned int ClassId()
        {
            return 2274;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91C40;
        }
        Realm m_Realm; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02418
    // RuntimeId: 10131
    // TypeInfo:  0x0000000142C91CA0
#ifndef _TwinkleOverlayEntityData_
#define _TwinkleOverlayEntityData_
#pragma pack(push, 8)
    class TwinkleOverlayEntityData : public EntityData
    {
    public:
        static __inline TwinkleOverlayEntityData* DefaultInstance()
        {
            return (TwinkleOverlayEntityData*)0x0000000068A368F0;
        }
        static __inline unsigned int ClassId()
        {
            return 2418;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91CA0;
        }
        Realm m_Realm; //0x0018
        bool m_IsDeployed; //0x001C
        char _0x001D[3];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01974
    // RuntimeId: 10129
    // TypeInfo:  0x0000000142C91D00
#ifndef _TwinkleBundleAsset_
#define _TwinkleBundleAsset_
#pragma pack(push, 8)
    class TwinkleBundleAsset : public Asset
    {
    public:
        static __inline TwinkleBundleAsset* DefaultInstance()
        {
            return (TwinkleBundleAsset*)0x0000000068A2C830;
        }
        static __inline unsigned int ClassId()
        {
            return 1974;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C91D00;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00952
    // RuntimeId: 05672
    // TypeInfo:  0x0000000142C2AD60
#ifndef _UIWidgetEntity_
#define _UIWidgetEntity_
    class UIWidgetEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 952;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C2AD60;
        }
        char _0x0020[264];
    };//Size=0x0128
#endif

    ////////////////////////////////////////
    // ClassId:   00644
    // RuntimeId: 10126
    // TypeInfo:  0x0000000142C90CF0
#ifndef _TwinkleOverlayEntity_
#define _TwinkleOverlayEntity_
    class TwinkleOverlayEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 644;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90CF0;
        }
        char _0x0020[24];
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   00001
    // RuntimeId: 10125
    // TypeInfo:  0x0000000142C90B20
#ifndef _TwinkleTtfFontData_
#define _TwinkleTtfFontData_
    class TwinkleTtfFontData
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90B20;
        }
        char _0x0000[48];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   01215
    // RuntimeId: 10124
    // TypeInfo:  0x0000000142C90B70
#ifndef _TwinkleEnabledEntity_
#define _TwinkleEnabledEntity_
    class TwinkleEnabledEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1215;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90B70;
        }
        char _0x0020[24];
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   00958
    // RuntimeId: 10123
    // TypeInfo:  0x0000000142C90C10
#ifndef _TwinkleUIWidgetEntity_
#define _TwinkleUIWidgetEntity_
    class TwinkleUIWidgetEntity : public UIWidgetEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 958;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90C10;
        }
    };//Size=0x0128
#endif

    ////////////////////////////////////////
    // ClassId:   03258
    // RuntimeId: 10122
    // TypeInfo:  0x0000000142C90690
#ifndef _TireTrailsLevelDescriptionComponent_
#define _TireTrailsLevelDescriptionComponent_
#pragma pack(push, 8)
    class TireTrailsLevelDescriptionComponent : public LevelDescriptionComponent
    {
    public:
        static __inline TireTrailsLevelDescriptionComponent* DefaultInstance()
        {
            return (TireTrailsLevelDescriptionComponent*)0x0000000068A5A4A0;
        }
        static __inline unsigned int ClassId()
        {
            return 3258;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90690;
        }
        bool m_Enabled; //0x0010
        char _0x0011[7];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01818
    // RuntimeId: 05120
    // TypeInfo:  0x0000000142C1FF90
#ifndef _DataContainerPolicyAsset_
#define _DataContainerPolicyAsset_
#pragma pack(push, 8)
    class DataContainerPolicyAsset : public Asset
    {
    public:
        static __inline DataContainerPolicyAsset* DefaultInstance()
        {
            return (DataContainerPolicyAsset*)0x0000000068A28A30;
        }
        static __inline unsigned int ClassId()
        {
            return 1818;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C1FF90;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03053
    // RuntimeId: 05116
    // TypeInfo:  0x0000000142C20050
#ifndef _GameComponentData_
#define _GameComponentData_
#pragma pack(push, 16)
    class GameComponentData : public ComponentData
    {
    public:
        static __inline GameComponentData* DefaultInstance()
        {
            return (GameComponentData*)0x0000000068A4F640;
        }
        static __inline unsigned int ClassId()
        {
            return 3053;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C20050;
        }
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03746
    // RuntimeId: 05346
    // TypeInfo:  0x0000000142C22CF0
#ifndef _MaterialRelationPropertyData_
#define _MaterialRelationPropertyData_
#pragma pack(push, 8)
    class MaterialRelationPropertyData : public DataContainer
    {
    public:
        static __inline MaterialRelationPropertyData* DefaultInstance()
        {
            return (MaterialRelationPropertyData*)0x0000000068A65850;
        }
        static __inline unsigned int ClassId()
        {
            return 3746;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C22CF0;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02387
    // RuntimeId: 10110
    // TypeInfo:  0x0000000142C907B0
#ifndef _TireTrailManagerEntityData_
#define _TireTrailManagerEntityData_
#pragma pack(push, 8)
    class TireTrailManagerEntityData : public EntityData
    {
    public:
        static __inline TireTrailManagerEntityData* DefaultInstance()
        {
            return (TireTrailManagerEntityData*)0x0000000068A35BD0;
        }
        static __inline unsigned int ClassId()
        {
            return 2387;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C907B0;
        }
        Realm m_Realm; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01840
    // RuntimeId: 10108
    // TypeInfo:  0x0000000142C908D0
#ifndef _RibbonVolumeTemplateData_
#define _RibbonVolumeTemplateData_
#pragma pack(push, 8)
    class RibbonVolumeTemplateData : public DataContainerPolicyAsset
    {
    public:
        static __inline RibbonVolumeTemplateData* DefaultInstance()
        {
            return (RibbonVolumeTemplateData*)0x0000000068A29430;
        }
        static __inline unsigned int ClassId()
        {
            return 1840;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C908D0;
        }
        SurfaceShaderBaseAsset* m_Shader; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02454
    // RuntimeId: 05106
    // TypeInfo:  0x0000000142C20230
#ifndef _SpatialEntityData_
#define _SpatialEntityData_
#pragma pack(push, 16)
    class SpatialEntityData : public EntityData
    {
    public:
        static __inline SpatialEntityData* DefaultInstance()
        {
            return (SpatialEntityData*)0x0000000068A376F0;
        }
        static __inline unsigned int ClassId()
        {
            return 2454;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C20230;
        }
        char _0x0018[8];
        LinearTransform m_Transform; //0x0020
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01280
    // RuntimeId: 10104
    // TypeInfo:  0x0000000142C90930
#ifndef _ClientTireTrailManagerEntity_
#define _ClientTireTrailManagerEntity_
    class ClientTireTrailManagerEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1280;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90930;
        }
        char _0x0020[3568];
    };//Size=0x0E10
#endif

    ////////////////////////////////////////
    // ClassId:   00316
    // RuntimeId: 05894
    // TypeInfo:  0x0000000142C334B0
#ifndef _GameComponent_
#define _GameComponent_
    class GameComponent : public Component
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 316;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C334B0;
        }
        char _0x0020[16];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   01331
    // RuntimeId: 08974
    // TypeInfo:  0x0000000142C771F0
#ifndef _RenderVolumeEntity_
#define _RenderVolumeEntity_
    class RenderVolumeEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1331;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C771F0;
        }
        char _0x0020[128];
    };//Size=0x00A0
#endif

    ////////////////////////////////////////
    // ClassId:   02642
    // RuntimeId: 10101
    // TypeInfo:  0x0000000142C8FA80
#ifndef _SpartaInputDebuggingWidgetData_
#define _SpartaInputDebuggingWidgetData_
#pragma pack(push, 8)
    class SpartaInputDebuggingWidgetData : public UIWidgetEntityData
    {
    public:
        static __inline SpartaInputDebuggingWidgetData* DefaultInstance()
        {
            return (SpartaInputDebuggingWidgetData*)0x0000000068A41A50;
        }
        static __inline unsigned int ClassId()
        {
            return 2642;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FA80;
        }
        Realm m_Realm; //0x0068
        char _0x006C[4];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02643
    // RuntimeId: 10099
    // TypeInfo:  0x0000000142C8FAE0
#ifndef _SpartaUIWidgetEntityData_
#define _SpartaUIWidgetEntityData_
#pragma pack(push, 8)
    class SpartaUIWidgetEntityData : public UIWidgetEntityData
    {
    public:
        static __inline SpartaUIWidgetEntityData* DefaultInstance()
        {
            return (SpartaUIWidgetEntityData*)0x0000000068A41AE0;
        }
        static __inline unsigned int ClassId()
        {
            return 2643;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FAE0;
        }
    };//Size=0x0068
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02250
    // RuntimeId: 10097
    // TypeInfo:  0x0000000142C8FB40
#ifndef _SpartaUIOnlineEntityData_
#define _SpartaUIOnlineEntityData_
#pragma pack(push, 8)
    class SpartaUIOnlineEntityData : public EntityData
    {
    public:
        static __inline SpartaUIOnlineEntityData* DefaultInstance()
        {
            return (SpartaUIOnlineEntityData*)0x0000000068A32CA0;
        }
        static __inline unsigned int ClassId()
        {
            return 2250;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FB40;
        }
        Realm m_Realm; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01597
    // RuntimeId: 10095
    // TypeInfo:  0x0000000142C8FBA0
#ifndef _SpartaAudioEffectsAsset_
#define _SpartaAudioEffectsAsset_
#pragma pack(push, 8)
    class SpartaAudioEffectsAsset : public Asset
    {
    public:
        static __inline SpartaAudioEffectsAsset* DefaultInstance()
        {
            return (SpartaAudioEffectsAsset*)0x0000000068A24160;
        }
        static __inline unsigned int ClassId()
        {
            return 1597;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FBA0;
        }
        SoundAsset* m_ClickSound; //0x0018
        SoundAsset* m_MouseOverSound; //0x0020
        SoundAsset* m_MenuOpenedSound; //0x0028
        SoundAsset* m_MenuClosedSound; //0x0030
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03842
    // RuntimeId: 10093
    // TypeInfo:  0x0000000142C8FC00
#ifndef _SpartaSoundSettings_
#define _SpartaSoundSettings_
#pragma pack(push, 8)
    class SpartaSoundSettings : public SystemSettings
    {
    public:
        static __inline SpartaSoundSettings* DefaultInstance()
        {
            return (SpartaSoundSettings*)0x0000000068A67200;
        }
        static __inline unsigned int ClassId()
        {
            return 3842;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FC00;
        }
        char* m_SpartaAudioEffectsAssetPath; //0x0020
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03876
    // RuntimeId: 10091
    // TypeInfo:  0x0000000142C8FC60
#ifndef _SpartaExtensionSettings_
#define _SpartaExtensionSettings_
#pragma pack(push, 8)
    class SpartaExtensionSettings : public SystemSettings
    {
    public:
        static __inline SpartaExtensionSettings* DefaultInstance()
        {
            return (SpartaExtensionSettings*)0x0000000068A68CD0;
        }
        static __inline unsigned int ClassId()
        {
            return 3876;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FC60;
        }
        char* m_GatewayHost; //0x0020
        char* m_GatewayProtocol; //0x0028
        char* m_ServiceOverride; //0x0030
        char* m_SpartaSuperBundleAssetPath; //0x0038
        char* m_SpartaBundleAssePath; //0x0040
        bool m_OnlineDebugEnabled; //0x0048
        bool m_OriginAccountAssocWorkaroundsEnabled; //0x0049
        char _0x004A[6];
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03857
    // RuntimeId: 10089
    // TypeInfo:  0x0000000142C8FCC0
#ifndef _SpartaGatewaySettings_
#define _SpartaGatewaySettings_
#pragma pack(push, 8)
    class SpartaGatewaySettings : public SystemSettings
    {
    public:
        static __inline SpartaGatewaySettings* DefaultInstance()
        {
            return (SpartaGatewaySettings*)0x0000000068A680F0;
        }
        static __inline unsigned int ClassId()
        {
            return 3857;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FCC0;
        }
        Array<SpartaGatewayToOnlineEnvironmentMapping> m_ManifestSettings; //0x0020
        unsigned __int32 m_ManifestDownloadNumRetries; //0x0028
        char _0x002C[4];
        char* m_GatewayHostOverride; //0x0030
        bool m_RemoteManifestFeatureEnabled; //0x0038
        char _0x0039[7];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02359
    // RuntimeId: 10062
    // TypeInfo:  0x0000000142C8FD20
#ifndef _SpartaStreamingInstallEntityData_
#define _SpartaStreamingInstallEntityData_
#pragma pack(push, 8)
    class SpartaStreamingInstallEntityData : public EntityData
    {
    public:
        static __inline SpartaStreamingInstallEntityData* DefaultInstance()
        {
            return (SpartaStreamingInstallEntityData*)0x0000000068A35320;
        }
        static __inline unsigned int ClassId()
        {
            return 2359;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FD20;
        }
        float m_InstallProgress; //0x0018
        bool m_IsInstalling; //0x001C
        bool m_IsMpInstalled; //0x001D
        char _0x001E[2];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02450
    // RuntimeId: 10060
    // TypeInfo:  0x0000000142C8FD80
#ifndef _SpartaMenuVOEntityData_
#define _SpartaMenuVOEntityData_
#pragma pack(push, 8)
    class SpartaMenuVOEntityData : public EntityData
    {
    public:
        static __inline SpartaMenuVOEntityData* DefaultInstance()
        {
            return (SpartaMenuVOEntityData*)0x0000000068A37590;
        }
        static __inline unsigned int ClassId()
        {
            return 2450;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FD80;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02879
    // RuntimeId: 09991
    // TypeInfo:  0x0000000142C8FDE0
#ifndef _SpartaEndOfRoundEntityData_
#define _SpartaEndOfRoundEntityData_
#pragma pack(push, 8)
    class SpartaEndOfRoundEntityData : public EntityData
    {
    public:
        static __inline SpartaEndOfRoundEntityData* DefaultInstance()
        {
            return (SpartaEndOfRoundEntityData*)0x0000000068A4AE10;
        }
        static __inline unsigned int ClassId()
        {
            return 2879;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FDE0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02857
    // RuntimeId: 09989
    // TypeInfo:  0x0000000142C8FE40
#ifndef _SpartaInGameEntityData_
#define _SpartaInGameEntityData_
#pragma pack(push, 8)
    class SpartaInGameEntityData : public EntityData
    {
    public:
        static __inline SpartaInGameEntityData* DefaultInstance()
        {
            return (SpartaInGameEntityData*)0x0000000068A4A7E0;
        }
        static __inline unsigned int ClassId()
        {
            return 2857;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FE40;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02941
    // RuntimeId: 09987
    // TypeInfo:  0x0000000142C8FEA0
#ifndef _SpartaWarsawFrontEndEntityData_
#define _SpartaWarsawFrontEndEntityData_
#pragma pack(push, 8)
    class SpartaWarsawFrontEndEntityData : public EntityData
    {
    public:
        static __inline SpartaWarsawFrontEndEntityData* DefaultInstance()
        {
            return (SpartaWarsawFrontEndEntityData*)0x0000000068A4C470;
        }
        static __inline unsigned int ClassId()
        {
            return 2941;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FEA0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02266
    // RuntimeId: 09985
    // TypeInfo:  0x0000000142C8FF00
#ifndef _SpartaFrontEndAudioEntityData_
#define _SpartaFrontEndAudioEntityData_
#pragma pack(push, 8)
    class SpartaFrontEndAudioEntityData : public EntityData
    {
    public:
        static __inline SpartaFrontEndAudioEntityData* DefaultInstance()
        {
            return (SpartaFrontEndAudioEntityData*)0x0000000068A33200;
        }
        static __inline unsigned int ClassId()
        {
            return 2266;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FF00;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02333
    // RuntimeId: 09983
    // TypeInfo:  0x0000000142C8FF60
#ifndef _SpartaFrontEndCoreEntityData_
#define _SpartaFrontEndCoreEntityData_
#pragma pack(push, 8)
    class SpartaFrontEndCoreEntityData : public EntityData
    {
    public:
        static __inline SpartaFrontEndCoreEntityData* DefaultInstance()
        {
            return (SpartaFrontEndCoreEntityData*)0x0000000068A34A90;
        }
        static __inline unsigned int ClassId()
        {
            return 2333;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FF60;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01600
    // RuntimeId: 09296
    // TypeInfo:  0x0000000142C7F9B0
#ifndef _PresenceBackendData_
#define _PresenceBackendData_
#pragma pack(push, 8)
    class PresenceBackendData : public Asset
    {
    public:
        static __inline PresenceBackendData* DefaultInstance()
        {
            return (PresenceBackendData*)0x0000000068A242E0;
        }
        static __inline unsigned int ClassId()
        {
            return 1600;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F9B0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01978
    // RuntimeId: 09975
    // TypeInfo:  0x0000000142C90020
#ifndef _SpartaBundleAsset_
#define _SpartaBundleAsset_
#pragma pack(push, 8)
    class SpartaBundleAsset : public Asset
    {
    public:
        static __inline SpartaBundleAsset* DefaultInstance()
        {
            return (SpartaBundleAsset*)0x0000000068A2C910;
        }
        static __inline unsigned int ClassId()
        {
            return 1978;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90020;
        }
        Array<SpartaDataAsset*> m_SpartaBundledAssets; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01887
    // RuntimeId: 09973
    // TypeInfo:  0x0000000142C90080
#ifndef _SpartaDataAsset_
#define _SpartaDataAsset_
#pragma pack(push, 8)
    class SpartaDataAsset : public Asset
    {
    public:
        static __inline SpartaDataAsset* DefaultInstance()
        {
            return (SpartaDataAsset*)0x0000000068A2A800;
        }
        static __inline unsigned int ClassId()
        {
            return 1887;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90080;
        }
        Guid m_ChunkGuid; //0x0018
        char _0x0018[16];
        Array<OffsetInfo> m_Offsets; //0x0028
        unsigned __int32 m_ChunkSize; //0x0030
        char _0x0034[4];
        char* m_LocalPath; //0x0038
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02609
    // RuntimeId: 07533
    // TypeInfo:  0x0000000142C5B2B0
#ifndef _UIElementEntityData_
#define _UIElementEntityData_
#pragma pack(push, 16)
    class UIElementEntityData : public EntityData
    {
    public:
        static __inline UIElementEntityData* DefaultInstance()
        {
            return (UIElementEntityData*)0x0000000068A3FAE0;
        }
        static __inline unsigned int ClassId()
        {
            return 2609;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5B2B0;
        }
        char* m_InstanceName; //0x0018
        UIElementTransform m_UIElementTransform; //0x0020
        UIElementColor m_Color; //0x0050
        Vec3 m_PositionOffset; //0x0070
        Vec3 m_RotationOffset; //0x0080
        unsigned __int32 m_InstanceNameHash; //0x0090
        UIElementSize m_Size; //0x0094
        UILayoutMode m_LayoutMode; //0x009C
        UIElementOffset m_Offset; //0x00A0
        UIElementAnchor m_Anchor; //0x00A8
        UIElementOffset m_Position; //0x00B0
        UIElementRectExpansion m_Expansion; //0x00B8
        bool m_Visible; //0x00C8
        char _0x00C9[7];
    };//Size=0x00D0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02625
    // RuntimeId: 09967
    // TypeInfo:  0x0000000142C90140
#ifndef _SpartaTextElementEntityData_
#define _SpartaTextElementEntityData_
#pragma pack(push, 16)
    class SpartaTextElementEntityData : public UIElementEntityData
    {
    public:
        static __inline SpartaTextElementEntityData* DefaultInstance()
        {
            return (SpartaTextElementEntityData*)0x0000000068A40D30;
        }
        static __inline unsigned int ClassId()
        {
            return 2625;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C90140;
        }
        char* m_Text; //0x00D0
        UIElementFontStyle* m_Style; //0x00D8
        UIElementFontEffect* m_Effect; //0x00E0
        char _0x00E8[8];
    };//Size=0x00F0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02933
    // RuntimeId: 09965
    // TypeInfo:  0x0000000142C901A0
#ifndef _TunguskaGlobeEntityData_
#define _TunguskaGlobeEntityData_
#pragma pack(push, 16)
    class TunguskaGlobeEntityData : public EntityData
    {
    public:
        static __inline TunguskaGlobeEntityData* DefaultInstance()
        {
            return (TunguskaGlobeEntityData*)0x0000000068A4C1B0;
        }
        static __inline unsigned int ClassId()
        {
            return 2933;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C901A0;
        }
        Realm m_Realm; //0x0018
        char _0x001C[4];
        LinearTransform m_GlobeCenter; //0x0020
        LinearTransform m_CameraTransformResult; //0x0060
        float m_InCameraFov; //0x00A0
        float m_CameraFovResult; //0x00A4
        float m_GlowIntensity; //0x00A8
        char _0x00AC[4];
    };//Size=0x00B0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00090
    // RuntimeId: 09171
    // TypeInfo:  0x0000000142C7DC60
#ifndef _PresenceBackend_
#define _PresenceBackend_
    class PresenceBackend
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 90;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7DC60;
        }
        char _0x0000[32];
    };//Size=0x0020
#endif

    ////////////////////////////////////////
    // ClassId:   00610
    // RuntimeId: 09962
    // TypeInfo:  0x0000000142C8D6C0
#ifndef _SpartaWarsawFrontEndEntity_
#define _SpartaWarsawFrontEndEntity_
    class SpartaWarsawFrontEndEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 610;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D6C0;
        }
        char _0x0020[24];
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   00829
    // RuntimeId: 09961
    // TypeInfo:  0x0000000142C8D760
#ifndef _SpartaFrontEndCoreEntity_
#define _SpartaFrontEndCoreEntity_
    class SpartaFrontEndCoreEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 829;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D760;
        }
        char _0x0020[24];
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   01254
    // RuntimeId: 09960
    // TypeInfo:  0x0000000142C8D800
#ifndef _SpartaFrontEndAudioEntity_
#define _SpartaFrontEndAudioEntity_
    class SpartaFrontEndAudioEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1254;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D800;
        }
        char _0x0020[24];
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   01154
    // RuntimeId: 09959
    // TypeInfo:  0x0000000142C8D8A0
#ifndef _SpartaUIOnlineEntity_
#define _SpartaUIOnlineEntity_
    class SpartaUIOnlineEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1154;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D8A0;
        }
        char _0x0020[80];
    };//Size=0x0070
#endif

    ////////////////////////////////////////
    // ClassId:   03492
    // RuntimeId: 07829
    // TypeInfo:  0x0000000142C5FAA0
#ifndef _ToolData_
#define _ToolData_
#pragma pack(push, 8)
    class ToolData : public DataContainer
    {
    public:
        static __inline ToolData* DefaultInstance()
        {
            return (ToolData*)0x0000000068A5FE10;
        }
        static __inline unsigned int ClassId()
        {
            return 3492;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5FAA0;
        }
        bool m_IsAlwaysActive; //0x0010
        char _0x0011[7];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03190
    // RuntimeId: 09956
    // TypeInfo:  0x0000000142C8D370
#ifndef _WeaponZeroingComponentData_
#define _WeaponZeroingComponentData_
#pragma pack(push, 16)
    class WeaponZeroingComponentData : public GameComponentData
    {
    public:
        static __inline WeaponZeroingComponentData* DefaultInstance()
        {
            return (WeaponZeroingComponentData*)0x0000000068A57780;
        }
        static __inline unsigned int ClassId()
        {
            return 3190;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D370;
        }
        __int32 m_CycleInputAction; //0x0070
        bool m_Enabled; //0x0074
        char _0x0075[11];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01458
    // RuntimeId: 07845
    // TypeInfo:  0x0000000142C5F800
#ifndef _WeaponModifierBase_
#define _WeaponModifierBase_
#pragma pack(push, 8)
    class WeaponModifierBase : public DataContainer
    {
    public:
        static __inline WeaponModifierBase* DefaultInstance()
        {
            return (WeaponModifierBase*)0x0000000068A21410;
        }
        static __inline unsigned int ClassId()
        {
            return 1458;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5F800;
        }
        __int32 m_ApplyOrder; //0x0010
        char _0x0014[4];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03601
    // RuntimeId: 07881
    // TypeInfo:  0x0000000142C5F380
#ifndef _WeaponSwayData_
#define _WeaponSwayData_
#pragma pack(push, 8)
    class WeaponSwayData : public DataContainer
    {
    public:
        static __inline WeaponSwayData* DefaultInstance()
        {
            return (WeaponSwayData*)0x0000000068A62340;
        }
        static __inline unsigned int ClassId()
        {
            return 3601;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5F380;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01940
    // RuntimeId: 09946
    // TypeInfo:  0x0000000142C8D490
#ifndef _GunSwayModifierData_
#define _GunSwayModifierData_
#pragma pack(push, 8)
    class GunSwayModifierData : public Asset
    {
    public:
        static __inline GunSwayModifierData* DefaultInstance()
        {
            return (GunSwayModifierData*)0x0000000068A2B8A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1940;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D490;
        }
        GunSwayStanceZoomModifierData m_StandZoomModifier; //0x0018
        GunSwayStanceZoomModifierData m_StandNoZoomModifier; //0x005C
        GunSwayStanceZoomModifierData m_CrouchZoomModifier; //0x00A0
        GunSwayStanceZoomModifierData m_CrouchNoZoomModifier; //0x00E4
        GunSwayStanceZoomModifierData m_ProneZoomModifier; //0x0128
        GunSwayStanceZoomModifierData m_ProneNoZoomModifier; //0x016C
        bool m_OnlyInSupportedShooting; //0x01B0
        bool m_OnlyOnWeaponLightEnabled; //0x01B1
        char _0x01B2[6];
    };//Size=0x01B8
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03397
    // RuntimeId: 09928
    // TypeInfo:  0x0000000142C8D4F0
#ifndef _CameraRecoilData_
#define _CameraRecoilData_
#pragma pack(push, 8)
    class CameraRecoilData : public DataContainer
    {
    public:
        static __inline CameraRecoilData* DefaultInstance()
        {
            return (CameraRecoilData*)0x0000000068A5DC20;
        }
        static __inline unsigned int ClassId()
        {
            return 3397;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D4F0;
        }
        float m_SpringConstant; //0x0010
        float m_SpringDamping; //0x0014
        float m_SpringMinThresholdAngle; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02442
    // RuntimeId: 09920
    // TypeInfo:  0x0000000142C89F90
#ifndef _WeaponLagEntityData_
#define _WeaponLagEntityData_
#pragma pack(push, 8)
    class WeaponLagEntityData : public EntityData
    {
    public:
        static __inline WeaponLagEntityData* DefaultInstance()
        {
            return (WeaponLagEntityData*)0x0000000068A372C0;
        }
        static __inline unsigned int ClassId()
        {
            return 2442;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C89F90;
        }
        WeaponLagBinding m_Binding; //0x0018
        char _0x007C[4];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03666
    // RuntimeId: 09916
    // TypeInfo:  0x0000000142C89FF0
#ifndef _WeaponStateData1p_
#define _WeaponStateData1p_
#pragma pack(push, 8)
    class WeaponStateData1p : public DataContainer
    {
    public:
        static __inline WeaponStateData1p* DefaultInstance()
        {
            return (WeaponStateData1p*)0x0000000068A63CC0;
        }
        static __inline unsigned int ClassId()
        {
            return 3666;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C89FF0;
        }
        Array<WeaponMesh1p> m_WeaponMesh1p; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03298
    // RuntimeId: 09912
    // TypeInfo:  0x0000000142C8A050
#ifndef _SoldierWeaponBlueprintPipelineSettings_
#define _SoldierWeaponBlueprintPipelineSettings_
#pragma pack(push, 8)
    class SoldierWeaponBlueprintPipelineSettings : public DataContainer
    {
    public:
        static __inline SoldierWeaponBlueprintPipelineSettings* DefaultInstance()
        {
            return (SoldierWeaponBlueprintPipelineSettings*)0x0000000068A5B610;
        }
        static __inline unsigned int ClassId()
        {
            return 3298;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A050;
        }
        bool m_DisableOnDemandLoading; //0x0010
        char _0x0011[7];
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03789
    // RuntimeId: 09804
    // TypeInfo:  0x0000000142C8B130
#ifndef _ExplosionPackTrigger_
#define _ExplosionPackTrigger_
#pragma pack(push, 8)
    class ExplosionPackTrigger : public DataContainer
    {
    public:
        static __inline ExplosionPackTrigger* DefaultInstance()
        {
            return (ExplosionPackTrigger*)0x0000000068A66390;
        }
        static __inline unsigned int ClassId()
        {
            return 3789;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B130;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02464
    // RuntimeId: 05110
    // TypeInfo:  0x0000000142C20170
#ifndef _ComponentEntityData_
#define _ComponentEntityData_
#pragma pack(push, 16)
    class ComponentEntityData : public SpatialEntityData
    {
    public:
        static __inline ComponentEntityData* DefaultInstance()
        {
            return (ComponentEntityData*)0x0000000068A37D50;
        }
        static __inline unsigned int ClassId()
        {
            return 2464;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C20170;
        }
        Array<GameObjectData*> m_Components; //0x0060
        unsigned __int8 m_ClientRuntimeComponentCount; //0x0068
        unsigned __int8 m_ServerRuntimeComponentCount; //0x0069
        unsigned __int8 m_ClientRuntimeTransformationCount; //0x006A
        unsigned __int8 m_ServerRuntimeTransformationCount; //0x006B
        char _0x006C[4];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01894
    // RuntimeId: 05276
    // TypeInfo:  0x0000000142C1E670
#ifndef _SharedBundleBaseAsset_
#define _SharedBundleBaseAsset_
#pragma pack(push, 8)
    class SharedBundleBaseAsset : public Asset
    {
    public:
        static __inline SharedBundleBaseAsset* DefaultInstance()
        {
            return (SharedBundleBaseAsset*)0x0000000068A2A9C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1894;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C1E670;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03317
    // RuntimeId: 09584
    // TypeInfo:  0x0000000142C8C6F0
#ifndef _SocketObjectDataBase_
#define _SocketObjectDataBase_
#pragma pack(push, 8)
    class SocketObjectDataBase : public DataContainer
    {
    public:
        static __inline SocketObjectDataBase* DefaultInstance()
        {
            return (SocketObjectDataBase*)0x0000000068A5BDF0;
        }
        static __inline unsigned int ClassId()
        {
            return 3317;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C6F0;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03318
    // RuntimeId: 09900
    // TypeInfo:  0x0000000142C8A290
#ifndef _WeaponSocketObjectData_
#define _WeaponSocketObjectData_
#pragma pack(push, 8)
    class WeaponSocketObjectData : public SocketObjectDataBase
    {
    public:
        static __inline WeaponSocketObjectData* DefaultInstance()
        {
            return (WeaponSocketObjectData*)0x0000000068A5BE20;
        }
        static __inline unsigned int ClassId()
        {
            return 3318;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A290;
        }
        Asset* m_Used1p; //0x0010
        Asset* m_Used1pZoom; //0x0018
        Asset* m_Used3p; //0x0020
        Asset* m_Used3pZoom; //0x0028
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03319
    // RuntimeId: 09904
    // TypeInfo:  0x0000000142C8A1D0
#ifndef _WeaponSkinnedSocketObjectData_
#define _WeaponSkinnedSocketObjectData_
#pragma pack(push, 8)
    class WeaponSkinnedSocketObjectData : public WeaponSocketObjectData
    {
    public:
        static __inline WeaponSkinnedSocketObjectData* DefaultInstance()
        {
            return (WeaponSkinnedSocketObjectData*)0x0000000068A5BE70;
        }
        static __inline unsigned int ClassId()
        {
            return 3319;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A1D0;
        }
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01469
    // RuntimeId: 09894
    // TypeInfo:  0x0000000142C8A2F0
#ifndef _CustomWeaponTypeModifier_
#define _CustomWeaponTypeModifier_
#pragma pack(push, 8)
    class CustomWeaponTypeModifier : public WeaponModifierBase
    {
    public:
        static __inline CustomWeaponTypeModifier* DefaultInstance()
        {
            return (CustomWeaponTypeModifier*)0x0000000068A216D0;
        }
        static __inline unsigned int ClassId()
        {
            return 1469;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A2F0;
        }
        WeaponData* m_CustomWeaponType; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01470
    // RuntimeId: 09892
    // TypeInfo:  0x0000000142C8A350
#ifndef _WeaponZoomLevelModifier_
#define _WeaponZoomLevelModifier_
#pragma pack(push, 8)
    class WeaponZoomLevelModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponZoomLevelModifier* DefaultInstance()
        {
            return (WeaponZoomLevelModifier*)0x0000000068A21710;
        }
        static __inline unsigned int ClassId()
        {
            return 1470;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A350;
        }
        __int32 m_ZoomLevelIndex; //0x0018
        char _0x001C[4];
        ZoomLevelData* m_ZoomLevel; //0x0020
        WeaponZoomLevelData* m_WeaponZoomLevel; //0x0028
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01471
    // RuntimeId: 09890
    // TypeInfo:  0x0000000142C8A3B0
#ifndef _WeaponZoomModifier_
#define _WeaponZoomModifier_
#pragma pack(push, 8)
    class WeaponZoomModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponZoomModifier* DefaultInstance()
        {
            return (WeaponZoomModifier*)0x0000000068A21760;
        }
        static __inline unsigned int ClassId()
        {
            return 1471;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A3B0;
        }
        float m_ZoomRenderFov; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01463
    // RuntimeId: 09888
    // TypeInfo:  0x0000000142C8A410
#ifndef _WeaponClassModifier_
#define _WeaponClassModifier_
#pragma pack(push, 8)
    class WeaponClassModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponClassModifier* DefaultInstance()
        {
            return (WeaponClassModifier*)0x0000000068A21540;
        }
        static __inline unsigned int ClassId()
        {
            return 1463;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A410;
        }
        WeaponClassEnum m_WeaponClass; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01464
    // RuntimeId: 09886
    // TypeInfo:  0x0000000142C8A470
#ifndef _WeaponAnimatedFireTypeModifier_
#define _WeaponAnimatedFireTypeModifier_
#pragma pack(push, 8)
    class WeaponAnimatedFireTypeModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAnimatedFireTypeModifier* DefaultInstance()
        {
            return (WeaponAnimatedFireTypeModifier*)0x0000000068A21580;
        }
        static __inline unsigned int ClassId()
        {
            return 1464;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A470;
        }
        AnimatedFireEnum m_AnimatedFireType; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01460
    // RuntimeId: 09884
    // TypeInfo:  0x0000000142C8A4D0
#ifndef _WeaponAnimTypeModifier_
#define _WeaponAnimTypeModifier_
#pragma pack(push, 8)
    class WeaponAnimTypeModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAnimTypeModifier* DefaultInstance()
        {
            return (WeaponAnimTypeModifier*)0x0000000068A21480;
        }
        static __inline unsigned int ClassId()
        {
            return 1460;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A4D0;
        }
        WeaponAnimType m_WeaponAnimType; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01472
    // RuntimeId: 09880
    // TypeInfo:  0x0000000142C8A530
#ifndef _WeaponAnimationConfigurationModifier_
#define _WeaponAnimationConfigurationModifier_
#pragma pack(push, 8)
    class WeaponAnimationConfigurationModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAnimationConfigurationModifier* DefaultInstance()
        {
            return (WeaponAnimationConfigurationModifier*)0x0000000068A217A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1472;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A530;
        }
        AnimatedFireEnum m_AnimatedFireType; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02465
    // RuntimeId: 05112
    // TypeInfo:  0x0000000142C20110
#ifndef _GameComponentEntityData_
#define _GameComponentEntityData_
#pragma pack(push, 16)
    class GameComponentEntityData : public ComponentEntityData
    {
    public:
        static __inline GameComponentEntityData* DefaultInstance()
        {
            return (GameComponentEntityData*)0x0000000068A37DE0;
        }
        static __inline unsigned int ClassId()
        {
            return 2465;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C20110;
        }
        bool m_Enabled; //0x0070
        char _0x0071[15];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02476
    // RuntimeId: 08177
    // TypeInfo:  0x0000000142C65970
#ifndef _GamePhysicsEntityData_
#define _GamePhysicsEntityData_
#pragma pack(push, 16)
    class GamePhysicsEntityData : public GameComponentEntityData
    {
    public:
        static __inline GamePhysicsEntityData* DefaultInstance()
        {
            return (GamePhysicsEntityData*)0x0000000068A38A30;
        }
        static __inline unsigned int ClassId()
        {
            return 2476;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C65970;
        }
        PhysicsEntityData* m_PhysicsData; //0x0080
        char _0x0088[8];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02477
    // RuntimeId: 07759
    // TypeInfo:  0x0000000142C5FEC0
#ifndef _ProjectileEntityData_
#define _ProjectileEntityData_
#pragma pack(push, 16)
    class ProjectileEntityData : public GamePhysicsEntityData
    {
    public:
        static __inline ProjectileEntityData* DefaultInstance()
        {
            return (ProjectileEntityData*)0x0000000068A38AE0;
        }
        static __inline unsigned int ClassId()
        {
            return 2477;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5FEC0;
        }
        float m_InitialSpeed; //0x0090
        float m_TimeToLive; //0x0094
        unsigned __int32 m_MaxCount; //0x0098
        float m_InitMeshHideTime; //0x009C
        float m_VisualConvergeDistance; //0x00A0
        float m_VisualConvergenceDelay; //0x00A4
        float m_VisualConvergenceDuration; //0x00A8
        float m_ProxyVisualConvergenceDelay; //0x00AC
        float m_ProxyVisualConvergenceDuration; //0x00B0
        char _0x00B4[4];
        ExplosionEntityData* m_Explosion; //0x00B8
        WeaponSuppressionData* m_SuppressionData; //0x00C0
        char* m_AmmunitionType; //0x00C8
        MaterialDecl m_MaterialPair; //0x00D0
        AntHitReactionWeaponType m_HitReactionWeaponType; //0x00D4
        bool m_DetonateOnTimeout; //0x00D8
        bool m_ServerProjectileDisabled; //0x00D9
        bool m_HideOnDetonation; //0x00DA
        bool m_VehicleLightingEnable; //0x00DB
        char _0x00DC[4];
    };//Size=0x00E0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03493
    // RuntimeId: 07831
    // TypeInfo:  0x0000000142C5FA40
#ifndef _WeaponData_
#define _WeaponData_
#pragma pack(push, 8)
    class WeaponData : public ToolData
    {
    public:
        static __inline WeaponData* DefaultInstance()
        {
            return (WeaponData*)0x0000000068A5FE40;
        }
        static __inline unsigned int ClassId()
        {
            return 3493;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5FA40;
        }
        bool m_ShowLaserPaintedVehicles; //0x0018
        char _0x0019[7];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03512
    // RuntimeId: 09868
    // TypeInfo:  0x0000000142C8A710
#ifndef _SpyderHunterWeaponData_
#define _SpyderHunterWeaponData_
#pragma pack(push, 8)
    class SpyderHunterWeaponData : public WeaponData
    {
    public:
        static __inline SpyderHunterWeaponData* DefaultInstance()
        {
            return (SpyderHunterWeaponData*)0x0000000068A60600;
        }
        static __inline unsigned int ClassId()
        {
            return 3512;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A710;
        }
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03502
    // RuntimeId: 09866
    // TypeInfo:  0x0000000142C8A770
#ifndef _BallisticShieldWeaponData_
#define _BallisticShieldWeaponData_
#pragma pack(push, 16)
    class BallisticShieldWeaponData : public WeaponData
    {
    public:
        static __inline BallisticShieldWeaponData* DefaultInstance()
        {
            return (BallisticShieldWeaponData*)0x0000000068A60170;
        }
        static __inline unsigned int ClassId()
        {
            return 3502;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A770;
        }
        Vec3 m_ADSZeroPitchOffset; //0x0020
        Vec3 m_ADSMinPitchOffset; //0x0030
        Vec3 m_ADSMaxPitchOffset; //0x0040
        Vec3 m_CrouchZeroPitchOffset; //0x0050
        Vec3 m_CrouchMinPitchOffset; //0x0060
        Vec3 m_CrouchMaxPitchOffset; //0x0070
        Vec3 m_CrouchMoveZeroPitchOffset; //0x0080
        Vec3 m_CrouchMoveMinPitchOffset; //0x0090
        Vec3 m_CrouchMoveMaxPitchOffset; //0x00A0
        LinearTransform m_SprintOffset; //0x00B0
        float m_MaxHealth; //0x00F0
        char _0x00F4[4];
        ObjectBlueprint* m_PhysicsBlueprint; //0x00F8
        float m_DestructionMeshHealth; //0x0100
        char _0x0104[4];
        ObjectBlueprint* m_DestructionMeshBlueprint1p; //0x0108
        ObjectBlueprint* m_DestructionMeshBlueprint3p; //0x0110
        char _0x0118[8];
    };//Size=0x0120
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03510
    // RuntimeId: 09864
    // TypeInfo:  0x0000000142C8A7D0
#ifndef _SupplySphereWeaponData_
#define _SupplySphereWeaponData_
#pragma pack(push, 8)
    class SupplySphereWeaponData : public WeaponData
    {
    public:
        static __inline SupplySphereWeaponData* DefaultInstance()
        {
            return (SupplySphereWeaponData*)0x0000000068A60550;
        }
        static __inline unsigned int ClassId()
        {
            return 3510;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A7D0;
        }
        SupplyData m_SupplyData; //0x0020
    };//Size=0x0048
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02070
    // RuntimeId: 09856
    // TypeInfo:  0x0000000142C8A8F0
#ifndef _SupplyUnitSphereData_
#define _SupplyUnitSphereData_
#pragma pack(push, 8)
    class SupplyUnitSphereData : public DataContainer
    {
    public:
        static __inline SupplyUnitSphereData* DefaultInstance()
        {
            return (SupplyUnitSphereData*)0x0000000068A2E6A0;
        }
        static __inline unsigned int ClassId()
        {
            return 2070;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A8F0;
        }
        float m_Radius; //0x0010
        float m_MaxRadius; //0x0014
        float m_RadiusChangeTime; //0x0018
        float m_SupplyIncSpeed; //0x001C
        float m_InstantRefill; //0x0020
        float m_SupplyPointsRefillSpeed; //0x0024
        float m_SupplyPointsCapacity; //0x0028
        bool m_ForceUseInstantRefill; //0x002C
        bool m_InfiniteCapacity; //0x002D
        char _0x002E[2];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02072
    // RuntimeId: 09858
    // TypeInfo:  0x0000000142C8A890
#ifndef _HealingSupplyUnitSphereData_
#define _HealingSupplyUnitSphereData_
#pragma pack(push, 8)
    class HealingSupplyUnitSphereData : public SupplyUnitSphereData
    {
    public:
        static __inline HealingSupplyUnitSphereData* DefaultInstance()
        {
            return (HealingSupplyUnitSphereData*)0x0000000068A2E740;
        }
        static __inline unsigned int ClassId()
        {
            return 2072;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A890;
        }
        float m_DistributeHealingOverTime; //0x0030
        char _0x0034[4];
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02071
    // RuntimeId: 09860
    // TypeInfo:  0x0000000142C8A830
#ifndef _AmmoSupplyUnitSphereData_
#define _AmmoSupplyUnitSphereData_
#pragma pack(push, 8)
    class AmmoSupplyUnitSphereData : public SupplyUnitSphereData
    {
    public:
        static __inline AmmoSupplyUnitSphereData* DefaultInstance()
        {
            return (AmmoSupplyUnitSphereData*)0x0000000068A2E6F0;
        }
        static __inline unsigned int ClassId()
        {
            return 2071;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A830;
        }
        Array<WeaponClassEnum> m_IgnoredWeaponClasses; //0x0030
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01466
    // RuntimeId: 09854
    // TypeInfo:  0x0000000142C8A950
#ifndef _WeaponAimingSimulationModifier_
#define _WeaponAimingSimulationModifier_
#pragma pack(push, 8)
    class WeaponAimingSimulationModifier : public WeaponModifierBase
    {
    public:
        static __inline WeaponAimingSimulationModifier* DefaultInstance()
        {
            return (WeaponAimingSimulationModifier*)0x0000000068A21600;
        }
        static __inline unsigned int ClassId()
        {
            return 1466;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A950;
        }
        SoldierAimingSimulationData* m_AimingController; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03224
    // RuntimeId: 09852
    // TypeInfo:  0x0000000142C8A9B0
#ifndef _SoldierAimingSimulationData_
#define _SoldierAimingSimulationData_
#pragma pack(push, 8)
    class SoldierAimingSimulationData : public GameDataContainer
    {
    public:
        static __inline SoldierAimingSimulationData* DefaultInstance()
        {
            return (SoldierAimingSimulationData*)0x0000000068A59660;
        }
        static __inline unsigned int ClassId()
        {
            return 3224;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A9B0;
        }
        Array<ZoomLevelData*> m_ZoomLevels; //0x0010
        SoldierAimAssistData* m_AimAssist; //0x0018
        AimingPoseData m_StandPose; //0x0020
        AimingPoseData m_CrouchPose; //0x0038
        AimingPoseData m_PronePose; //0x0050
        float m_ZoomTransitionTime; //0x0068
        char _0x006C[4];
        Array<ZoomLevelSpecificTransitionTime> m_ZoomTransitionTimeArray; //0x0070
        float m_FovDelayTime; //0x0078
        float m_FovTransitionTime; //0x007C
        float m_AimingRange; //0x0080
        float m_LockAimToTargetSpeed; //0x0084
        Array<AimerModifierData*> m_Modifiers; //0x0088
        bool m_ReturnToZoomAfterReload; //0x0090
        char _0x0091[7];
    };//Size=0x0098
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03325
    // RuntimeId: 09850
    // TypeInfo:  0x0000000142C8AA10
#ifndef _ZoomLevelData_
#define _ZoomLevelData_
#pragma pack(push, 8)
    class ZoomLevelData : public DataContainer
    {
    public:
        static __inline ZoomLevelData* DefaultInstance()
        {
            return (ZoomLevelData*)0x0000000068A5C070;
        }
        static __inline unsigned int ClassId()
        {
            return 3325;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AA10;
        }
        float m_FieldOfView; //0x0010
        float m_FieldOfViewSP; //0x0014
        FOVTransitionData* m_FieldOfViewTransition; //0x0018
        float m_LookSpeedMultiplier; //0x0020
        float m_SprintLookSpeedMultiplier; //0x0024
        float m_MoveSpeedMultiplier; //0x0028
        float m_SwayPitchMagnitude; //0x002C
        float m_SwayYawMagnitude; //0x0030
        float m_SupportedSwayPitchMagnitude; //0x0034
        float m_SupportedSwayYawMagnitude; //0x0038
        float m_SuppressedSwayPitchMagnitude; //0x003C
        float m_SuppressedSwayYawMagnitude; //0x0040
        float m_SuppressedSwayMinFactor; //0x0044
        float m_TimePitchMultiplier; //0x0048
        float m_TimeYawMultiplier; //0x004C
        float m_DispersionMultiplier; //0x0050
        float m_DispersionRotation; //0x0054
        float m_RecoilMultiplier; //0x0058
        float m_RecoilFovMultiplier; //0x005C
        float m_CameraImpulseMultiplier; //0x0060
        float m_StartFadeToBlackAtTime; //0x0064
        float m_FadeToBlackDuration; //0x0068
        float m_StartFadeFromBlackAtTime; //0x006C
        float m_FadeFromBlackDuration; //0x0070
        float m_ScreenExposureAreaScale; //0x0074
        ZoomLevelActivateEventType m_OnActivateEventType; //0x0078
        float m_AttractYawStrength; //0x007C
        float m_AttractPitchStrength; //0x0080
        bool m_AllowFieldOfViewScaling; //0x0084
        bool m_FadeToBlackInZoomTransition; //0x0085
        bool m_UseFovSpecialisation; //0x0086
        bool m_UseWeaponMeshZoom1p; //0x0087
    };//Size=0x0088
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02193
    // RuntimeId: 09844
    // TypeInfo:  0x0000000142C8AA70
#ifndef _SoldierAimAssistData_
#define _SoldierAimAssistData_
#pragma pack(push, 16)
    class SoldierAimAssistData : public GameDataContainer
    {
    public:
        static __inline SoldierAimAssistData* DefaultInstance()
        {
            return (SoldierAimAssistData*)0x0000000068A30FD0;
        }
        static __inline unsigned int ClassId()
        {
            return 2193;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AA70;
        }
        Array<float> m_InputPolynomial; //0x0010
        Array<float> m_ZoomedInputPolynomial; //0x0018
        Vec3 m_StickyBoxScale; //0x0020
        Vec3 m_StickyDistanceScale; //0x0030
        Vec3 m_SnapBoxScale; //0x0040
        Vec3 m_SnapDistanceScale; //0x0050
        Vec3 m_EyePosOffset; //0x0060
        float m_AccelerationInputThreshold; //0x0070
        float m_AccelerationMultiplier; //0x0074
        float m_AccelerationDamping; //0x0078
        float m_AccelerationTimeThreshold; //0x007C
        float m_SquaredAcceleration; //0x0080
        Vec2 m_MaxAcceleration; //0x0084
        float m_YawSpeedStrength; //0x008C
        float m_PitchSpeedStrength; //0x0090
        Vec2 m_AttractDistanceFallOffs; //0x0094
        float m_AttractSoftZone; //0x009C
        float m_AttractUserInputMultiplier; //0x00A0
        float m_AttractUserInputMultiplier_NoZoom; //0x00A4
        float m_AttractOwnSpeedInfluence; //0x00A8
        float m_AttractTargetSpeedInfluence; //0x00AC
        float m_AttractOwnRequiredMovementForMaximumAttract; //0x00B0
        float m_AttractStartInputThreshold; //0x00B4
        float m_AttractMoveInputCap; //0x00B8
        float m_AttractYawStrength; //0x00BC
        float m_AttractPitchStrength; //0x00C0
        float m_MaxToTargetAngle; //0x00C4
        float m_MaxToTargetXZAngle; //0x00C8
        float m_ViewObstructedKeepTime; //0x00CC
        float m_SnapZoomLateralSpeedLimit; //0x00D0
        float m_SnapZoomTime; //0x00D4
        float m_SnapZoomPostTimeNoInput; //0x00D8
        float m_SnapZoomPostTime; //0x00DC
        unsigned __int32 m_SnapZoomReticlePointPriority; //0x00E0
        float m_SnapZoomAutoEngageTime; //0x00E4
        float m_SnapZoomBreakTimeAtMaxInput; //0x00E8
        float m_SnapZoomBreakMaxInput; //0x00EC
        float m_SnapZoomBreakMinAngle; //0x00F0
        float m_SnapZoomSpamGuardTime; //0x00F4
        SkeletonCollisionData* m_SoldierBackupSkeletonCollisionData; //0x00F8
        float m_CheckBoneCenterOnlyDistance; //0x0100
        float m_DisableForcedTargetRecalcDistance; //0x0104
        float m_OverrideAimingRange; //0x0108
        float m_OverrideAimingRangeCrouch; //0x010C
        float m_OverrideAimingRangeProne; //0x0110
        bool m_UseYawAcceleration; //0x0114
        bool m_UsePitchAcceleration; //0x0115
        bool m_SnapZoomUserShorterWeaponTime; //0x0116
        bool m_SnapZoomPostTimeDynamicPoint; //0x0117
        bool m_ForceSoldierBackupSkeletonCollisionUse; //0x0118
        char _0x0119[7];
    };//Size=0x0120
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03505
    // RuntimeId: 09842
    // TypeInfo:  0x0000000142C8AAD0
#ifndef _ThrowAtTargetWeaponData_
#define _ThrowAtTargetWeaponData_
#pragma pack(push, 8)
    class ThrowAtTargetWeaponData : public WeaponData
    {
    public:
        static __inline ThrowAtTargetWeaponData* DefaultInstance()
        {
            return (ThrowAtTargetWeaponData*)0x0000000068A603D0;
        }
        static __inline unsigned int ClassId()
        {
            return 3505;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AAD0;
        }
        float m_DefaultPowerModifier; //0x0020
        float m_ThrowToSoldierDistance; //0x0024
        float m_MaxTravelTime; //0x0028
        float m_MinTravelTime; //0x002C
        float m_MaxQueryAngle; //0x0030
        float m_MaxAimAdjustmentAngle; //0x0034
        float m_WeightCurrentDistance; //0x0038
        float m_WeightTargetDistance; //0x003C
        float m_WeightCurrentAngle; //0x0040
        float m_WeightTargetAngle; //0x0044
        bool m_ClampMaximumVelocity; //0x0048
        char _0x0049[7];
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03507
    // RuntimeId: 09840
    // TypeInfo:  0x0000000142C8AB30
#ifndef _MeleeWeaponData_
#define _MeleeWeaponData_
#pragma pack(push, 8)
    class MeleeWeaponData : public WeaponData
    {
    public:
        static __inline MeleeWeaponData* DefaultInstance()
        {
            return (MeleeWeaponData*)0x0000000068A60490;
        }
        static __inline unsigned int ClassId()
        {
            return 3507;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AB30;
        }
        bool m_UseCannedAnimation; //0x0020
        bool m_UseSphereDamage; //0x0021
        char _0x0022[6];
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03511
    // RuntimeId: 09838
    // TypeInfo:  0x0000000142C8AB90
#ifndef _FlashlightWeaponData_
#define _FlashlightWeaponData_
#pragma pack(push, 8)
    class FlashlightWeaponData : public WeaponData
    {
    public:
        static __inline FlashlightWeaponData* DefaultInstance()
        {
            return (FlashlightWeaponData*)0x0000000068A605B0;
        }
        static __inline unsigned int ClassId()
        {
            return 3511;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AB90;
        }
        float m_UpdateFrequency; //0x0020
        float m_Range; //0x0024
        float m_Angle; //0x0028
        char _0x002C[4];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03503
    // RuntimeId: 09834
    // TypeInfo:  0x0000000142C8ABF0
#ifndef _DefibrillatorWeaponData_
#define _DefibrillatorWeaponData_
#pragma pack(push, 8)
    class DefibrillatorWeaponData : public WeaponData
    {
    public:
        static __inline DefibrillatorWeaponData* DefaultInstance()
        {
            return (DefibrillatorWeaponData*)0x0000000068A602B0;
        }
        static __inline unsigned int ClassId()
        {
            return 3503;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8ABF0;
        }
        float m_AttackTime; //0x0020
        float m_FullHealthTime; //0x0024
        float m_InitialStartHealth; //0x0028
        float m_MaxAngleToVictimXZ; //0x002C
        float m_DefibActionCooldownTime; //0x0030
        float m_MaxClientBodyDistance; //0x0034
        DefibrillatorUpgradeWeaponData m_UpgradeWeaponData; //0x0038
        bool m_ClientSideRevive; //0x0050
        bool m_ClientSideKillInVehicles; //0x0051
        char _0x0052[6];
    };//Size=0x0058
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03517
    // RuntimeId: 09828
    // TypeInfo:  0x0000000142C8ACB0
#ifndef _PowerToolWeaponData_
#define _PowerToolWeaponData_
#pragma pack(push, 8)
    class PowerToolWeaponData : public WeaponData
    {
    public:
        static __inline PowerToolWeaponData* DefaultInstance()
        {
            return (PowerToolWeaponData*)0x0000000068A60780;
        }
        static __inline unsigned int ClassId()
        {
            return 3517;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8ACB0;
        }
        SoundAsset* m_RepairSound; //0x0020
        SoundAsset* m_RepairCompletedSound; //0x0028
        SoundAsset* m_DamageSound; //0x0030
        MaterialDecl m_RepairMaterialPair; //0x0038
        bool m_PlayFireEffectOnRepairOnly; //0x003C
        char _0x003D[3];
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03518
    // RuntimeId: 09830
    // TypeInfo:  0x0000000142C8AC50
#ifndef _RepairToolWeaponData_
#define _RepairToolWeaponData_
#pragma pack(push, 8)
    class RepairToolWeaponData : public PowerToolWeaponData
    {
    public:
        static __inline RepairToolWeaponData* DefaultInstance()
        {
            return (RepairToolWeaponData*)0x0000000068A607E0;
        }
        static __inline unsigned int ClassId()
        {
            return 3518;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AC50;
        }
        float m_RechargeSpeed; //0x0040
        char _0x0044[4];
    };//Size=0x0048
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03506
    // RuntimeId: 09826
    // TypeInfo:  0x0000000142C8AD10
#ifndef _MedicBagHealingSphereWeaponData_
#define _MedicBagHealingSphereWeaponData_
#pragma pack(push, 8)
    class MedicBagHealingSphereWeaponData : public WeaponData
    {
    public:
        static __inline MedicBagHealingSphereWeaponData* DefaultInstance()
        {
            return (MedicBagHealingSphereWeaponData*)0x0000000068A60440;
        }
        static __inline unsigned int ClassId()
        {
            return 3506;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AD10;
        }
        HealingSphereData m_Healer; //0x0020
        float m_HealthPointsRefillSpeed; //0x0028
        float m_HealthPointsPerBag; //0x002C
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03508
    // RuntimeId: 09824
    // TypeInfo:  0x0000000142C8AD70
#ifndef _MedkitWeaponData_
#define _MedkitWeaponData_
#pragma pack(push, 8)
    class MedkitWeaponData : public WeaponData
    {
    public:
        static __inline MedkitWeaponData* DefaultInstance()
        {
            return (MedkitWeaponData*)0x0000000068A604D0;
        }
        static __inline unsigned int ClassId()
        {
            return 3508;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AD70;
        }
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03495
    // RuntimeId: 09822
    // TypeInfo:  0x0000000142C8ADD0
#ifndef _DetonatedWeaponData_
#define _DetonatedWeaponData_
#pragma pack(push, 8)
    class DetonatedWeaponData : public WeaponData
    {
    public:
        static __inline DetonatedWeaponData* DefaultInstance()
        {
            return (DetonatedWeaponData*)0x0000000068A5FED0;
        }
        static __inline unsigned int ClassId()
        {
            return 3495;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8ADD0;
        }
        LockingControllerData* m_LockingController; //0x0020
        float m_Range; //0x0028
        char _0x002C[4];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02479
    // RuntimeId: 07763
    // TypeInfo:  0x0000000142C5FE00
#ifndef _MeshProjectileEntityData_
#define _MeshProjectileEntityData_
#pragma pack(push, 16)
    class MeshProjectileEntityData : public ProjectileEntityData
    {
    public:
        static __inline MeshProjectileEntityData* DefaultInstance()
        {
            return (MeshProjectileEntityData*)0x0000000068A38D00;
        }
        static __inline unsigned int ClassId()
        {
            return 2479;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5FE00;
        }
        Vec3 m_InitialAngularVelocity; //0x00E0
        MeshAsset* m_Mesh; //0x00F0
        EffectBlueprint* m_TrailEffect; //0x00F8
        float m_InstantAttachableTestDistance; //0x0100
        float m_InstantAttachableVisualConvergenceDelay; //0x0104
        float m_InstantAttachableVisualConvergenceDuration; //0x0108
        float m_MaxAttachableInclination; //0x010C
        float m_UnspawnAfterDetonationDelay; //0x0110
        bool m_IsAttachable; //0x0114
        bool m_InstantAttachableTestUnderReticule; //0x0115
        bool m_ExtraDamping; //0x0116
        char _0x0117[9];
    };//Size=0x0120
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03038
    // RuntimeId: 08173
    // TypeInfo:  0x0000000142C65A30
#ifndef _HealthComponentData_
#define _HealthComponentData_
#pragma pack(push, 16)
    class HealthComponentData : public ComponentData
    {
    public:
        static __inline HealthComponentData* DefaultInstance()
        {
            return (HealthComponentData*)0x0000000068A4ED40;
        }
        static __inline unsigned int ClassId()
        {
            return 3038;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C65A30;
        }
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03018
    // RuntimeId: 08171
    // TypeInfo:  0x0000000142C65A90
#ifndef _PhysicsComponentData_
#define _PhysicsComponentData_
#pragma pack(push, 16)
    class PhysicsComponentData : public ComponentData
    {
    public:
        static __inline PhysicsComponentData* DefaultInstance()
        {
            return (PhysicsComponentData*)0x0000000068A4E0B0;
        }
        static __inline unsigned int ClassId()
        {
            return 3018;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C65A90;
        }
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02481
    // RuntimeId: 07765
    // TypeInfo:  0x0000000142C5FDA0
#ifndef _GhostedProjectileEntityData_
#define _GhostedProjectileEntityData_
#pragma pack(push, 16)
    class GhostedProjectileEntityData : public MeshProjectileEntityData
    {
    public:
        static __inline GhostedProjectileEntityData* DefaultInstance()
        {
            return (GhostedProjectileEntityData*)0x0000000068A38FD0;
        }
        static __inline unsigned int ClassId()
        {
            return 2481;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5FDA0;
        }
        float m_ProxyConvergenceDelay; //0x0120
        float m_ProxyConvergenceDuration; //0x0124
        bool m_ProxyConvergenceInstantOnAttach; //0x0128
        bool m_ForceProxyConvergence; //0x0129
        char _0x012A[6];
    };//Size=0x0130
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03791
    // RuntimeId: 09812
    // TypeInfo:  0x0000000142C8AFB0
#ifndef _ExplosionPackRemoteDetonatorTrigger_
#define _ExplosionPackRemoteDetonatorTrigger_
#pragma pack(push, 8)
    class ExplosionPackRemoteDetonatorTrigger : public ExplosionPackTrigger
    {
    public:
        static __inline ExplosionPackRemoteDetonatorTrigger* DefaultInstance()
        {
            return (ExplosionPackRemoteDetonatorTrigger*)0x0000000068A663F0;
        }
        static __inline unsigned int ClassId()
        {
            return 3791;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8AFB0;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03790
    // RuntimeId: 09810
    // TypeInfo:  0x0000000142C8B010
#ifndef _ExplosionPackInfantryTrigger_
#define _ExplosionPackInfantryTrigger_
#pragma pack(push, 8)
    class ExplosionPackInfantryTrigger : public ExplosionPackTrigger
    {
    public:
        static __inline ExplosionPackInfantryTrigger* DefaultInstance()
        {
            return (ExplosionPackInfantryTrigger*)0x0000000068A663C0;
        }
        static __inline unsigned int ClassId()
        {
            return 3790;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B010;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03794
    // RuntimeId: 09808
    // TypeInfo:  0x0000000142C8B070
#ifndef _ExplosionPackVehicleRayTrigger_
#define _ExplosionPackVehicleRayTrigger_
#pragma pack(push, 8)
    class ExplosionPackVehicleRayTrigger : public ExplosionPackTrigger
    {
    public:
        static __inline ExplosionPackVehicleRayTrigger* DefaultInstance()
        {
            return (ExplosionPackVehicleRayTrigger*)0x0000000068A66490;
        }
        static __inline unsigned int ClassId()
        {
            return 3794;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B070;
        }
        float m_ActivationDelay; //0x0010
        float m_Distance; //0x0014
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03793
    // RuntimeId: 09806
    // TypeInfo:  0x0000000142C8B0D0
#ifndef _ExplosionPackVehicleProximityTrigger_
#define _ExplosionPackVehicleProximityTrigger_
#pragma pack(push, 8)
    class ExplosionPackVehicleProximityTrigger : public ExplosionPackTrigger
    {
    public:
        static __inline ExplosionPackVehicleProximityTrigger* DefaultInstance()
        {
            return (ExplosionPackVehicleProximityTrigger*)0x0000000068A66450;
        }
        static __inline unsigned int ClassId()
        {
            return 3793;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B0D0;
        }
        float m_ActivationDelay; //0x0010
        float m_Radius; //0x0014
        bool m_UseDetailedCollisionCheck; //0x0018
        char _0x0019[7];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03792
    // RuntimeId: 09910
    // TypeInfo:  0x0000000142C8A0B0
#ifndef _ExplosionPackTripwireTrigger_
#define _ExplosionPackTripwireTrigger_
#pragma pack(push, 8)
    class ExplosionPackTripwireTrigger : public ExplosionPackTrigger
    {
    public:
        static __inline ExplosionPackTripwireTrigger* DefaultInstance()
        {
            return (ExplosionPackTripwireTrigger*)0x0000000068A66420;
        }
        static __inline unsigned int ClassId()
        {
            return 3792;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A0B0;
        }
        TripwireEntityData* m_Tripwire; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03039
    // RuntimeId: 07192
    // TypeInfo:  0x0000000142C51EF0
#ifndef _GameHealthComponentData_
#define _GameHealthComponentData_
#pragma pack(push, 16)
    class GameHealthComponentData : public HealthComponentData
    {
    public:
        static __inline GameHealthComponentData* DefaultInstance()
        {
            return (GameHealthComponentData*)0x0000000068A4EDD0;
        }
        static __inline unsigned int ClassId()
        {
            return 3039;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C51EF0;
        }
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03019
    // RuntimeId: 07186
    // TypeInfo:  0x0000000142C52010
#ifndef _GamePhysicsComponentData_
#define _GamePhysicsComponentData_
#pragma pack(push, 16)
    class GamePhysicsComponentData : public PhysicsComponentData
    {
    public:
        static __inline GamePhysicsComponentData* DefaultInstance()
        {
            return (GamePhysicsComponentData*)0x0000000068A4E140;
        }
        static __inline unsigned int ClassId()
        {
            return 3019;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C52010;
        }
        Realm m_Realm; //0x0070
        char _0x0074[4];
        Array<EffectParameter*> m_EffectParameters; //0x0078
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02472
    // RuntimeId: 09773
    // TypeInfo:  0x0000000142C8B370
#ifndef _WeaponEntityData_
#define _WeaponEntityData_
#pragma pack(push, 16)
    class WeaponEntityData : public GameComponentEntityData
    {
    public:
        static __inline WeaponEntityData* DefaultInstance()
        {
            return (WeaponEntityData*)0x0000000068A38520;
        }
        static __inline unsigned int ClassId()
        {
            return 2472;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B370;
        }
        WeaponClassEnum m_WeaponClass; //0x0080
        char _0x0084[4];
        Array<WeaponStateData> m_WeaponStates; //0x0088
        WeaponFiringData* m_WeaponFiring; //0x0090
        WeaponData* m_CustomWeaponType; //0x0098
        GameAIWeaponData* m_AIData; //0x00A0
        char _0x00A8[8];
    };//Size=0x00B0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03450
    // RuntimeId: 09787
    // TypeInfo:  0x0000000142C8B2B0
#ifndef _WeaponZoomLevelData_
#define _WeaponZoomLevelData_
#pragma pack(push, 8)
    class WeaponZoomLevelData : public DataContainer
    {
    public:
        static __inline WeaponZoomLevelData* DefaultInstance()
        {
            return (WeaponZoomLevelData*)0x0000000068A5ED20;
        }
        static __inline unsigned int ClassId()
        {
            return 3450;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B2B0;
        }
        float m_RenderFov; //0x0010
        char _0x0014[4];
        FOVTransitionData* m_RenderFovTransition; //0x0018
        Array<float> m_ZoomInOutMeshTransitionFactors; //0x0020
        float m_ZoomDisabledTransitionTimer; //0x0028
        SightType m_SightType; //0x002C
        WeaponAnimationSettingsData m_AnimationSettings; //0x0030
        char _0x004C[4];
    };//Size=0x0050
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03766
    // RuntimeId: 09781
    // TypeInfo:  0x0000000142C8B310
#ifndef _WeaponOverrideData_
#define _WeaponOverrideData_
#pragma pack(push, 8)
    class WeaponOverrideData : public DataContainer
    {
    public:
        static __inline WeaponOverrideData* DefaultInstance()
        {
            return (WeaponOverrideData*)0x0000000068A65D10;
        }
        static __inline unsigned int ClassId()
        {
            return 3766;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B310;
        }
        DataContainer* m_Data; //0x0010
        Array<WeaponOverrideValue> m_Values; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02473
    // RuntimeId: 09791
    // TypeInfo:  0x0000000142C8B250
#ifndef _SoldierWeaponData_
#define _SoldierWeaponData_
#pragma pack(push, 16)
    class SoldierWeaponData : public WeaponEntityData
    {
    public:
        static __inline SoldierWeaponData* DefaultInstance()
        {
            return (SoldierWeaponData*)0x0000000068A385F0;
        }
        static __inline unsigned int ClassId()
        {
            return 2473;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B250;
        }
        PickupSettingsData m_PickupSettings; //0x00B0
        Vec3 m_InteractionOffset; //0x00D0
        CustomizationAccessoryPivots m_CustomizationAccessoryPivots; //0x00E0
        char* m_DamageGiverName; //0x0130
        Array<WeaponZoomLevelData*> m_ZoomLevels; //0x0138
        Array<WeaponModifierData> m_WeaponModifierData; //0x0140
        SoldierAimingSimulationData* m_AimingController; //0x0148
        FirstPersonCameraData* m_FirstPersonCamera; //0x0150
        HudData m_Hud; //0x0158
        WeaponAnimBaseSetEnum m_AnimBaseSet; //0x01C8
        QuickThrowTypeEnum m_QuickThrowType; //0x01CC
        SoldierWeaponBlueprint* m_SoldierWeaponBlueprint; //0x01D0
        char* m_PersistenceId; //0x01D8
        __int32 m_SecondaryActionInputAction; //0x01E0
        char _0x01E4[4];
        EntityVoiceOverInfo* m_VoiceOverInfo; //0x01E8
        float m_WeaponFloatParam; //0x01F0
        float m_MaxRangeMeterDistance; //0x01F4
        Array<SocketData*> m_SocketsInWeapon; //0x01F8
        bool m_HideWhenOutOfAmmo; //0x0200
        bool m_AllowSwitchingToWeaponOutOfAmmo; //0x0201
        bool m_AllowSwitchingToWeaponReloading; //0x0202
        bool m_SwitchToPrimaryWhenOutOfAmmo; //0x0203
        bool m_WaitForFireBeforeSwitchToPrimaryWhenOutOfAmmo; //0x0204
        bool m_SwitchToSecondaryWhenPrimaryOutOfAmmo; //0x0205
        bool m_FireAndSwitchBackToPrevSupported; //0x0206
        bool m_AllowSwitchingToWeaponInVehicles; //0x0207
        bool m_AllowSwitchingToWeaponInWater; //0x0208
        bool m_LowerOnOwnTeam; //0x0209
        bool m_RedeployWhenSwitchingWeaponStates; //0x020A
        bool m_UseQuickThrowOnAutomaticSwitchback; //0x020B
        bool m_EnableBreathControl; //0x020C
        bool m_CanBeInSupportedShooting; //0x020D
        bool m_UseDetailedRangeMeterQuery; //0x020E
        bool m_IsSilenced; //0x020F
        bool m_SkipFirstZoomLevel; //0x0210
        char _0x0211[15];
    };//Size=0x0220
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03082
    // RuntimeId: 09771
    // TypeInfo:  0x0000000142C8B3D0
#ifndef _SoldierWeaponsComponentData_
#define _SoldierWeaponsComponentData_
#pragma pack(push, 16)
    class SoldierWeaponsComponentData : public GameComponentData
    {
    public:
        static __inline SoldierWeaponsComponentData* DefaultInstance()
        {
            return (SoldierWeaponsComponentData*)0x0000000068A50FE0;
        }
        static __inline unsigned int ClassId()
        {
            return 3082;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B3D0;
        }
        LinearTransform m_AimDir; //0x0070
        __int32 m_PrimaryWeaponId; //0x00B0
        __int32 m_SecondaryWeaponId; //0x00B4
        SoldierAimingSimulationData* m_DefaultAimingController; //0x00B8
        AnimatedWeaponBinding m_AnimatedWeaponBinding; //0x00C0
        Animated1pOnlyWeaponBinding m_Animated1pOnlyWeaponBinding; //0x0660
        Animated3pOnlyWeaponBinding m_Animated3pOnlyWeaponBinding; //0x06B0
        char _0x06EC[4];
        SkeletonAsset* m_WeaponSkeleton; //0x06F0
        float m_AmmoClipIncreaseMultiplier; //0x06F8
        __int32 m_GrenadeIncrease; //0x06FC
        __int32 m_UnderslungGrenadeIncrease; //0x0700
        float m_ExplosiveIncreaseMultiplier; //0x0704
        PickupEntityAsset* m_DropWeaponPickup; //0x0708
        bool m_UseExternalAimDir; //0x0710
        bool m_UnlimitedAmmo; //0x0711
        bool m_UnlimitedMags; //0x0712
        bool m_ForceZoom; //0x0713
        bool m_IsOwnedByAI; //0x0714
        char _0x0715[11];
    };//Size=0x0720
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02097
    // RuntimeId: 09753
    // TypeInfo:  0x0000000142C8B430
#ifndef _FirstPersonCameraData_
#define _FirstPersonCameraData_
#pragma pack(push, 16)
    class FirstPersonCameraData : public DataContainer
    {
    public:
        static __inline FirstPersonCameraData* DefaultInstance()
        {
            return (FirstPersonCameraData*)0x0000000068A2F020;
        }
        static __inline unsigned int ClassId()
        {
            return 2097;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B430;
        }
        WeaponLagSpringEffectData* m_WeaponSpringEffect; //0x0010
        WeaponLagSpringEffectData* m_CameraSpringEffect; //0x0018
        Vec3 m_Offset; //0x0020
        Vec3 m_WeaponBaseOffset; //0x0030
        Vec3 m_WeaponLagRotationOffset; //0x0040
        Vec3 m_Rotation; //0x0050
        float m_MoveStrafeModifier; //0x0060
        float m_MoveForwardModifier; //0x0064
        float m_RotateYawModifier; //0x0068
        float m_RotatePitchModifier; //0x006C
        float m_RotateRollModifier; //0x0070
        float m_ZoomMoveStrafeModifier; //0x0074
        float m_ZoomMoveForwardModifier; //0x0078
        float m_ZoomRotateYawModifier; //0x007C
        float m_ZoomRotatePitchModifier; //0x0080
        float m_ZoomRotateRollModifier; //0x0084
        float m_ReleaseModifier; //0x0088
        float m_ReleaseModifierPitch; //0x008C
        float m_ReleaseModifierYaw; //0x0090
        float m_ReleaseModifierRoll; //0x0094
        float m_OffsetReleaseModifier; //0x0098
        float m_ZoomReleaseModifierPitch; //0x009C
        float m_ZoomReleaseModifierYaw; //0x00A0
        float m_ZoomReleaseModifierRoll; //0x00A4
        float m_ZoomOffsetReleaseModifier; //0x00A8
        float m_RotationAdditionToOffset; //0x00AC
    };//Size=0x00B0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03733
    // RuntimeId: 09751
    // TypeInfo:  0x0000000142C8B490
#ifndef _WeaponLagSpringEffectData_
#define _WeaponLagSpringEffectData_
#pragma pack(push, 16)
    class WeaponLagSpringEffectData : public DataContainer
    {
    public:
        static __inline WeaponLagSpringEffectData* DefaultInstance()
        {
            return (WeaponLagSpringEffectData*)0x0000000068A65380;
        }
        static __inline unsigned int ClassId()
        {
            return 3733;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B490;
        }
        WeaponLagEffectSpringVector m_OffsetSprings; //0x0010
        char _0x0028[8];
        WeaponLagEffectForceData m_JumpForces; //0x0030
        WeaponLagEffectForceData m_LandForces; //0x0050
        WeaponLagEffectForceData m_PoseUpForces; //0x0070
        WeaponLagEffectForceData m_PoseDownForces; //0x0090
        WeaponLagEffectSpringVector m_RotationSprings; //0x00B0
        float m_ZoomForceModifier; //0x00C8
        char _0x00CC[4];
    };//Size=0x00D0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03593
    // RuntimeId: 09743
    // TypeInfo:  0x0000000142C8B4F0
#ifndef _WeaponSpeedData_
#define _WeaponSpeedData_
#pragma pack(push, 8)
    class WeaponSpeedData : public DataContainer
    {
    public:
        static __inline WeaponSpeedData* DefaultInstance()
        {
            return (WeaponSpeedData*)0x0000000068A62090;
        }
        static __inline unsigned int ClassId()
        {
            return 3593;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B4F0;
        }
        float m_ZoomOutSpeed; //0x0010
        float m_ZoomInSpeed; //0x0014
        float m_UnDeploySpeed; //0x0018
        float m_DeploySpeed; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   04008
    // RuntimeId: 09741
    // TypeInfo:  0x0000000142C8B550
#ifndef _WeaponOffsetData_
#define _WeaponOffsetData_
#pragma pack(push, 8)
    class WeaponOffsetData : public DataContainer
    {
    public:
        static __inline WeaponOffsetData* DefaultInstance()
        {
            return (WeaponOffsetData*)0x0000000068A6BB00;
        }
        static __inline unsigned int ClassId()
        {
            return 4008;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B550;
        }
        float m_WeaponOffsetX; //0x0010
        float m_WeaponOffsetY; //0x0014
        float m_WeaponOffsetZ; //0x0018
        float m_WeaponZoomedOffsetX; //0x001C
        float m_WeaponZoomedOffsetY; //0x0020
        float m_WeaponZoomedOffsetZ; //0x0024
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01814
    // RuntimeId: 09735
    // TypeInfo:  0x0000000142C8B5B0
#ifndef _AimerModifierData_
#define _AimerModifierData_
#pragma pack(push, 8)
    class AimerModifierData : public Asset
    {
    public:
        static __inline AimerModifierData* DefaultInstance()
        {
            return (AimerModifierData*)0x0000000068A28910;
        }
        static __inline unsigned int ClassId()
        {
            return 1814;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B5B0;
        }
        float m_LookSpeedMultiplier; //0x0018
        bool m_OnlyInSupportedShooting; //0x001C
        char _0x001D[3];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01841
    // RuntimeId: 09733
    // TypeInfo:  0x0000000142C8B610
#ifndef _SoldierWeaponCustomizationAsset_
#define _SoldierWeaponCustomizationAsset_
#pragma pack(push, 8)
    class SoldierWeaponCustomizationAsset : public DataContainerPolicyAsset
    {
    public:
        static __inline SoldierWeaponCustomizationAsset* DefaultInstance()
        {
            return (SoldierWeaponCustomizationAsset*)0x0000000068A29470;
        }
        static __inline unsigned int ClassId()
        {
            return 1841;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B610;
        }
        CustomizationTable* m_Customization; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01820
    // RuntimeId: 07589
    // TypeInfo:  0x0000000142C5AA10
#ifndef _UnlockAssetBase_
#define _UnlockAssetBase_
#pragma pack(push, 8)
    class UnlockAssetBase : public DataContainerPolicyAsset
    {
    public:
        static __inline UnlockAssetBase* DefaultInstance()
        {
            return (UnlockAssetBase*)0x0000000068A28AE0;
        }
        static __inline unsigned int ClassId()
        {
            return 1820;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5AA10;
        }
        UnlockUserDataBase* m_UnlockUserData; //0x0018
        char* m_DebugUnlockId; //0x0020
        unsigned __int32 m_Identifier; //0x0028
        unsigned __int32 m_UnlockScore; //0x002C
        UnlockAssetBase* m_NextLevelUnlockAsset; //0x0030
        char* m_PersistentStorageCode; //0x0038
        UnlockAvailability m_AvailableForPlayer; //0x0040
        bool m_AutoAvailable; //0x0044
        bool m_IgnoreAllUnlocked; //0x0045
        bool m_BypassLicenseCheckAllUnlocked; //0x0046
        bool m_HiddenInProgression; //0x0047
    };//Size=0x0048
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01836
    // RuntimeId: 07585
    // TypeInfo:  0x0000000142C5AA70
#ifndef _UnlockUserDataBase_
#define _UnlockUserDataBase_
#pragma pack(push, 8)
    class UnlockUserDataBase : public DataContainerPolicyAsset
    {
    public:
        static __inline UnlockUserDataBase* DefaultInstance()
        {
            return (UnlockUserDataBase*)0x0000000068A29310;
        }
        static __inline unsigned int ClassId()
        {
            return 1836;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5AA70;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02557
    // RuntimeId: 07399
    // TypeInfo:  0x0000000142C5C0F0
#ifndef _TriggerEntityData_
#define _TriggerEntityData_
#pragma pack(push, 16)
    class TriggerEntityData : public SpatialEntityData
    {
    public:
        static __inline TriggerEntityData* DefaultInstance()
        {
            return (TriggerEntityData*)0x0000000068A3D8D0;
        }
        static __inline unsigned int ClassId()
        {
            return 2557;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5C0F0;
        }
        float m_Delay; //0x0060
        bool m_RunOnce; //0x0064
        bool m_Enabled; //0x0065
        char _0x0066[10];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02559
    // RuntimeId: 07409
    // TypeInfo:  0x0000000142C5BF70
#ifndef _TriggerEventEntityData_
#define _TriggerEventEntityData_
#pragma pack(push, 16)
    class TriggerEventEntityData : public TriggerEntityData
    {
    public:
        static __inline TriggerEventEntityData* DefaultInstance()
        {
            return (TriggerEventEntityData*)0x0000000068A3DA10;
        }
        static __inline unsigned int ClassId()
        {
            return 2559;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5BF70;
        }
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02369
    // RuntimeId: 06497
    // TypeInfo:  0x0000000142C47050
#ifndef _CustomizeBaseEntityData_
#define _CustomizeBaseEntityData_
#pragma pack(push, 8)
    class CustomizeBaseEntityData : public EntityData
    {
    public:
        static __inline CustomizeBaseEntityData* DefaultInstance()
        {
            return (CustomizeBaseEntityData*)0x0000000068A35630;
        }
        static __inline unsigned int ClassId()
        {
            return 2369;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C47050;
        }
        Realm m_Realm; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01990
    // RuntimeId: 09715
    // TypeInfo:  0x0000000142C8B7F0
#ifndef _SoldierSpawnAppearanceTemplateData_
#define _SoldierSpawnAppearanceTemplateData_
#pragma pack(push, 8)
    class SoldierSpawnAppearanceTemplateData : public Asset
    {
    public:
        static __inline SoldierSpawnAppearanceTemplateData* DefaultInstance()
        {
            return (SoldierSpawnAppearanceTemplateData*)0x0000000068A2CD60;
        }
        static __inline unsigned int ClassId()
        {
            return 1990;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B7F0;
        }
        unsigned __int32 m_Body; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01903
    // RuntimeId: 09713
    // TypeInfo:  0x0000000142C8B850
#ifndef _SoldierSpawnKitTemplateData_
#define _SoldierSpawnKitTemplateData_
#pragma pack(push, 8)
    class SoldierSpawnKitTemplateData : public Asset
    {
    public:
        static __inline SoldierSpawnKitTemplateData* DefaultInstance()
        {
            return (SoldierSpawnKitTemplateData*)0x0000000068A2AC50;
        }
        static __inline unsigned int ClassId()
        {
            return 1903;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B850;
        }
        unsigned __int32 m_Kit; //0x0018
        unsigned __int32 m_MainGun; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01573
    // RuntimeId: 09711
    // TypeInfo:  0x0000000142C8B8B0
#ifndef _SoldierWeaponSwitchingData_
#define _SoldierWeaponSwitchingData_
#pragma pack(push, 8)
    class SoldierWeaponSwitchingData : public Asset
    {
    public:
        static __inline SoldierWeaponSwitchingData* DefaultInstance()
        {
            return (SoldierWeaponSwitchingData*)0x0000000068A23A30;
        }
        static __inline unsigned int ClassId()
        {
            return 1573;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8B8B0;
        }
        Array<WeaponSwitchingMapData> m_SwitchMap; //0x0018
        Array<DirectWeaponSwitchingMapData> m_DirectSwitchMap; //0x0020
        Array<WeaponSwitchingEnum> m_AutoDropSlots; //0x0028
        __int32 m_ToggleAction; //0x0030
        float m_ToggleMaxHoldTime; //0x0034
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03047
    // RuntimeId: 07194
    // TypeInfo:  0x0000000142C51E90
#ifndef _ControllableHealthComponentData_
#define _ControllableHealthComponentData_
#pragma pack(push, 16)
    class ControllableHealthComponentData : public GameHealthComponentData
    {
    public:
        static __inline ControllableHealthComponentData* DefaultInstance()
        {
            return (ControllableHealthComponentData*)0x0000000068A4F250;
        }
        static __inline unsigned int ClassId()
        {
            return 3047;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C51E90;
        }
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03028
    // RuntimeId: 07188
    // TypeInfo:  0x0000000142C51FB0
#ifndef _ControllablePhysicsComponentData_
#define _ControllablePhysicsComponentData_
#pragma pack(push, 16)
    class ControllablePhysicsComponentData : public GamePhysicsComponentData
    {
    public:
        static __inline ControllablePhysicsComponentData* DefaultInstance()
        {
            return (ControllablePhysicsComponentData*)0x0000000068A4E6F0;
        }
        static __inline unsigned int ClassId()
        {
            return 3028;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C51FB0;
        }
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01953
    // RuntimeId: 07252
    // TypeInfo:  0x0000000142C51710
#ifndef _CustomizeCharacterData_
#define _CustomizeCharacterData_
#pragma pack(push, 8)
    class CustomizeCharacterData : public Asset
    {
    public:
        static __inline CustomizeCharacterData* DefaultInstance()
        {
            return (CustomizeCharacterData*)0x0000000068A2BEB0;
        }
        static __inline unsigned int ClassId()
        {
            return 1953;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C51710;
        }
        Array<CustomizeVisual> m_VisualGroups; //0x0018
        Array<UnlockAssetBase*> m_Unlocks; //0x0020
        float m_OverrideMaxHealth; //0x0028
        float m_OverrideCriticalHealthThreshold; //0x002C
        bool m_RestoreToOriginalVisualState; //0x0030
        bool m_ClearVisualState; //0x0031
        char _0x0032[6];
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03877
    // RuntimeId: 09691
    // TypeInfo:  0x0000000142C8BA30
#ifndef _SoldierSettings_
#define _SoldierSettings_
#pragma pack(push, 8)
    class SoldierSettings : public SystemSettings
    {
    public:
        static __inline SoldierSettings* DefaultInstance()
        {
            return (SoldierSettings*)0x0000000068A68D80;
        }
        static __inline unsigned int ClassId()
        {
            return 3877;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BA30;
        }
        SoldierWeaponSwitchingData* m_SoldierWeaponSwitching; //0x0020
        unsigned __int32 m_MaxNumberDroppedPickups; //0x0028
        unsigned __int32 m_MaxVisiblePickupWeapons; //0x002C
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02499
    // RuntimeId: 06752
    // TypeInfo:  0x0000000142C4C920
#ifndef _ControllableEntityData_
#define _ControllableEntityData_
#pragma pack(push, 16)
    class ControllableEntityData : public GamePhysicsEntityData
    {
    public:
        static __inline ControllableEntityData* DefaultInstance()
        {
            return (ControllableEntityData*)0x0000000068A3A880;
        }
        static __inline unsigned int ClassId()
        {
            return 2499;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C4C920;
        }
        TeamId m_DefaultTeam; //0x0090
        float m_LowHealthThreshold; //0x0094
        MaterialDecl m_MaterialPair; //0x0098
        bool m_UsePrediction; //0x009C
        bool m_ResetTeamOnLastPlayerExits; //0x009D
        bool m_Immortal; //0x009E
        bool m_FakeImmortal; //0x009F
        bool m_ForceForegroundRendering; //0x00A0
        char _0x00A1[15];
    };//Size=0x00B0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02083
    // RuntimeId: 09680
    // TypeInfo:  0x0000000142C8BAF0
#ifndef _SoldierHealthModuleData_
#define _SoldierHealthModuleData_
#pragma pack(push, 8)
    class SoldierHealthModuleData : public DataContainer
    {
    public:
        static __inline SoldierHealthModuleData* DefaultInstance()
        {
            return (SoldierHealthModuleData*)0x0000000068A2EA90;
        }
        static __inline unsigned int ClassId()
        {
            return 2083;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BAF0;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   04005
    // RuntimeId: 09678
    // TypeInfo:  0x0000000142C8BB50
#ifndef _BreathControlData_
#define _BreathControlData_
#pragma pack(push, 8)
    class BreathControlData : public DataContainer
    {
    public:
        static __inline BreathControlData* DefaultInstance()
        {
            return (BreathControlData*)0x0000000068A6B9F0;
        }
        static __inline unsigned int ClassId()
        {
            return 4005;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BB50;
        }
        float m_BreathControlTime; //0x0010
        float m_BreathControlReleaseTime; //0x0014
        float m_BreathControlPenaltyMultiplier; //0x0018
        float m_BreathControlPenaltyTimeout; //0x001C
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03609
    // RuntimeId: 09676
    // TypeInfo:  0x0000000142C8BBB0
#ifndef _CollisionData_
#define _CollisionData_
#pragma pack(push, 8)
    class CollisionData : public DataContainer
    {
    public:
        static __inline CollisionData* DefaultInstance()
        {
            return (CollisionData*)0x0000000068A629A0;
        }
        static __inline unsigned int ClassId()
        {
            return 3609;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BBB0;
        }
        Array<ValueAtX> m_DamageAtVerticalVelocity; //0x0010
        Array<ValueAtX> m_DamageAtHorizVelocity; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03569
    // RuntimeId: 09672
    // TypeInfo:  0x0000000142C8BC10
#ifndef _SoldierWeaponOverrideData_
#define _SoldierWeaponOverrideData_
#pragma pack(push, 8)
    class SoldierWeaponOverrideData : public DataContainer
    {
    public:
        static __inline SoldierWeaponOverrideData* DefaultInstance()
        {
            return (SoldierWeaponOverrideData*)0x0000000068A617F0;
        }
        static __inline unsigned int ClassId()
        {
            return 3569;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BC10;
        }
        Array<WeaponOverrideData*> m_Overrides; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   04013
    // RuntimeId: 09670
    // TypeInfo:  0x0000000142C8BC70
#ifndef _SoldierSprintSettingsData_
#define _SoldierSprintSettingsData_
#pragma pack(push, 8)
    class SoldierSprintSettingsData : public DataContainer
    {
    public:
        static __inline SoldierSprintSettingsData* DefaultInstance()
        {
            return (SoldierSprintSettingsData*)0x0000000068A6BC50;
        }
        static __inline unsigned int ClassId()
        {
            return 4013;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BC70;
        }
        float m_Fov; //0x0010
        float m_FovInDelay; //0x0014
        float m_FovInTime; //0x0018
        float m_FovOutDelay; //0x001C
        float m_FovOutTime; //0x0020
        float m_RecoverTime; //0x0024
        float m_SprintToProneRecoverTime; //0x0028
        char _0x002C[4];
        Array<__int32> m_InterruptingActions; //0x0030
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03326
    // RuntimeId: 09664
    // TypeInfo:  0x0000000142C8BCD0
#ifndef _SoldierHeadCollisionData_
#define _SoldierHeadCollisionData_
#pragma pack(push, 8)
    class SoldierHeadCollisionData : public DataContainer
    {
    public:
        static __inline SoldierHeadCollisionData* DefaultInstance()
        {
            return (SoldierHeadCollisionData*)0x0000000068A5C110;
        }
        static __inline unsigned int ClassId()
        {
            return 3326;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BCD0;
        }
        float m_HeadRadius; //0x0010
        char _0x0014[4];
        Array<SoldierHeadCollisionPoseData> m_PoseStates; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03345
    // RuntimeId: 09660
    // TypeInfo:  0x0000000142C8BD30
#ifndef _SoldierAutoAimData_
#define _SoldierAutoAimData_
#pragma pack(push, 8)
    class SoldierAutoAimData : public DataContainer
    {
    public:
        static __inline SoldierAutoAimData* DefaultInstance()
        {
            return (SoldierAutoAimData*)0x0000000068A5C9C0;
        }
        static __inline unsigned int ClassId()
        {
            return 3345;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BD30;
        }
        Array<AutoAimData> m_Poses; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03898
    // RuntimeId: 07070
    // TypeInfo:  0x0000000142C52C10
#ifndef _CharacterSoundData_
#define _CharacterSoundData_
#pragma pack(push, 8)
    class CharacterSoundData : public DataContainer
    {
    public:
        static __inline CharacterSoundData* DefaultInstance()
        {
            return (CharacterSoundData*)0x0000000068A695C0;
        }
        static __inline unsigned int ClassId()
        {
            return 3898;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C52C10;
        }
        SoundAsset* m_Movement; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03343
    // RuntimeId: 09652
    // TypeInfo:  0x0000000142C8BDF0
#ifndef _SoldierAimingConstraintsData_
#define _SoldierAimingConstraintsData_
#pragma pack(push, 8)
    class SoldierAimingConstraintsData : public DataContainer
    {
    public:
        static __inline SoldierAimingConstraintsData* DefaultInstance()
        {
            return (SoldierAimingConstraintsData*)0x0000000068A5C940;
        }
        static __inline unsigned int ClassId()
        {
            return 3343;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BDF0;
        }
        AimingConstraintsData m_SwimmingConstraints; //0x0010
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03022
    // RuntimeId: 09650
    // TypeInfo:  0x0000000142C8BE50
#ifndef _PickupPhysicsComponentData_
#define _PickupPhysicsComponentData_
#pragma pack(push, 16)
    class PickupPhysicsComponentData : public GamePhysicsComponentData
    {
    public:
        static __inline PickupPhysicsComponentData* DefaultInstance()
        {
            return (PickupPhysicsComponentData*)0x0000000068A4E320;
        }
        static __inline unsigned int ClassId()
        {
            return 3022;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BE50;
        }
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02494
    // RuntimeId: 09635
    // TypeInfo:  0x0000000142C8C030
#ifndef _PickupEntityData_
#define _PickupEntityData_
#pragma pack(push, 16)
    class PickupEntityData : public GamePhysicsEntityData
    {
    public:
        static __inline PickupEntityData* DefaultInstance()
        {
            return (PickupEntityData*)0x0000000068A3A330;
        }
        static __inline unsigned int ClassId()
        {
            return 2494;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C030;
        }
        ObjectBlueprint* m_PhysicsBlueprint; //0x0090
        MeshAsset* m_Mesh; //0x0098
        float m_TimeToShowWeaponMesh; //0x00A0
        unsigned __int32 m_PreferredWeaponSlot; //0x00A4
        float m_TimeToLive; //0x00A8
        char _0x00AC[4];
        char* m_IconName; //0x00B0
        __int32 m_MinRandomSpareAmmoPercent; //0x00B8
        __int32 m_MaxRandomSpareAmmoPercent; //0x00BC
        __int32 m_MinRandomClipAmmoPercent; //0x00C0
        __int32 m_MaxRandomClipAmmoPercent; //0x00C4
        PickupPlayerEnum m_RandomizeAmmoOnDropForPlayer; //0x00C8
        float m_InteractionRadius; //0x00CC
        float m_DisplayWithinRadius; //0x00D0
        float m_TacticalRadius; //0x00D4
        bool m_UseWeaponMesh; //0x00D8
        bool m_UnspawnOnPickup; //0x00D9
        bool m_UnspawnOnAmmoPickup; //0x00DA
        bool m_ContentIsStatic; //0x00DB
        bool m_PositionIsStatic; //0x00DC
        bool m_AllowPickup; //0x00DD
        bool m_IgnoreNullWeaponSlots; //0x00DE
        bool m_ForceWeaponSlotSelection; //0x00DF
        bool m_DisplayInMiniMap; //0x00E0
        bool m_HasAutomaticAmmoPickup; //0x00E1
        bool m_ReplaceAllContent; //0x00E2
        bool m_RemoveWeaponOnDrop; //0x00E3
        bool m_UseDisplayWithinRadius; //0x00E4
        bool m_KeepAmmoState; //0x00E5
        char _0x00E6[10];
    };//Size=0x00F0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01852
    // RuntimeId: 09643
    // TypeInfo:  0x0000000142C8BF10
#ifndef _PickupEntityAsset_
#define _PickupEntityAsset_
#pragma pack(push, 8)
    class PickupEntityAsset : public DataContainerPolicyAsset
    {
    public:
        static __inline PickupEntityAsset* DefaultInstance()
        {
            return (PickupEntityAsset*)0x0000000068A29960;
        }
        static __inline unsigned int ClassId()
        {
            return 1852;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BF10;
        }
        PickupEntityData* m_Data; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02496
    // RuntimeId: 09641
    // TypeInfo:  0x0000000142C8BF70
#ifndef _KitPickupEntityData_
#define _KitPickupEntityData_
#pragma pack(push, 16)
    class KitPickupEntityData : public PickupEntityData
    {
    public:
        static __inline KitPickupEntityData* DefaultInstance()
        {
            return (KitPickupEntityData*)0x0000000068A3A560;
        }
        static __inline unsigned int ClassId()
        {
            return 2496;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BF70;
        }
        bool m_KeepAdditionalWeapons; //0x00F0
        char _0x00F1[15];
    };//Size=0x0100
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02497
    // RuntimeId: 09639
    // TypeInfo:  0x0000000142C8BFD0
#ifndef _WeaponUnlockPickupEntityData_
#define _WeaponUnlockPickupEntityData_
#pragma pack(push, 16)
    class WeaponUnlockPickupEntityData : public PickupEntityData
    {
    public:
        static __inline WeaponUnlockPickupEntityData* DefaultInstance()
        {
            return (WeaponUnlockPickupEntityData*)0x0000000068A3A680;
        }
        static __inline unsigned int ClassId()
        {
            return 2497;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BFD0;
        }
        Array<WeaponUnlockPickupData> m_Weapons; //0x00F0
        bool m_UseForPersistence; //0x00F8
        char _0x00F9[7];
    };//Size=0x0100
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02495
    // RuntimeId: 09647
    // TypeInfo:  0x0000000142C8BEB0
#ifndef _DynamicWeaponPickupEntityData_
#define _DynamicWeaponPickupEntityData_
#pragma pack(push, 16)
    class DynamicWeaponPickupEntityData : public PickupEntityData
    {
    public:
        static __inline DynamicWeaponPickupEntityData* DefaultInstance()
        {
            return (DynamicWeaponPickupEntityData*)0x0000000068A3A440;
        }
        static __inline unsigned int ClassId()
        {
            return 2495;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8BEB0;
        }
        Array<DynamicWeaponPickupSlotData> m_WeaponSlots; //0x00F0
        char _0x00F8[8];
    };//Size=0x0100
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02234
    // RuntimeId: 09631
    // TypeInfo:  0x0000000142C8C090
#ifndef _WeaponStateEntityData_
#define _WeaponStateEntityData_
#pragma pack(push, 8)
    class WeaponStateEntityData : public EntityData
    {
    public:
        static __inline WeaponStateEntityData* DefaultInstance()
        {
            return (WeaponStateEntityData*)0x0000000068A32740;
        }
        static __inline unsigned int ClassId()
        {
            return 2234;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C090;
        }
        Realm m_Realm; //0x0018
        __int32 m_WeaponSlot; //0x001C
        __int32 m_Ammo; //0x0020
        __int32 m_AmmoInMags; //0x0024
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02412
    // RuntimeId: 09629
    // TypeInfo:  0x0000000142C8C0F0
#ifndef _StateEventGateEntityData_
#define _StateEventGateEntityData_
#pragma pack(push, 8)
    class StateEventGateEntityData : public EntityData
    {
    public:
        static __inline StateEventGateEntityData* DefaultInstance()
        {
            return (StateEventGateEntityData*)0x0000000068A36550;
        }
        static __inline unsigned int ClassId()
        {
            return 2412;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C0F0;
        }
        EventGateState m_CheckedState; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02288
    // RuntimeId: 09625
    // TypeInfo:  0x0000000142C8C150
#ifndef _CoverPrepareFireEntityData_
#define _CoverPrepareFireEntityData_
#pragma pack(push, 8)
    class CoverPrepareFireEntityData : public EntityData
    {
    public:
        static __inline CoverPrepareFireEntityData* DefaultInstance()
        {
            return (CoverPrepareFireEntityData*)0x0000000068A339E0;
        }
        static __inline unsigned int ClassId()
        {
            return 2288;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C150;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02284
    // RuntimeId: 09623
    // TypeInfo:  0x0000000142C8C1B0
#ifndef _PlayerLookAtEntityData_
#define _PlayerLookAtEntityData_
#pragma pack(push, 16)
    class PlayerLookAtEntityData : public EntityData
    {
    public:
        static __inline PlayerLookAtEntityData* DefaultInstance()
        {
            return (PlayerLookAtEntityData*)0x0000000068A33860;
        }
        static __inline unsigned int ClassId()
        {
            return 2284;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C1B0;
        }
        char _0x0018[8];
        LinearTransform m_TargetTransform; //0x0020
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03181
    // RuntimeId: 09621
    // TypeInfo:  0x0000000142C8C210
#ifndef _HitReactionComponentData_
#define _HitReactionComponentData_
#pragma pack(push, 16)
    class HitReactionComponentData : public GameComponentData
    {
    public:
        static __inline HitReactionComponentData* DefaultInstance()
        {
            return (HitReactionComponentData*)0x0000000068A57090;
        }
        static __inline unsigned int ClassId()
        {
            return 3181;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C210;
        }
        HitReactionComponentBinding m_HitReactionBinding; //0x0070
        bool m_Enabled; //0x0124
        char _0x0125[11];
    };//Size=0x0130
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02590
    // RuntimeId: 09615
    // TypeInfo:  0x0000000142C8C270
#ifndef _BlockAimAssistEntityData_
#define _BlockAimAssistEntityData_
#pragma pack(push, 16)
    class BlockAimAssistEntityData : public SpatialEntityData
    {
    public:
        static __inline BlockAimAssistEntityData* DefaultInstance()
        {
            return (BlockAimAssistEntityData*)0x0000000068A3F1B0;
        }
        static __inline unsigned int ClassId()
        {
            return 2590;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C270;
        }
        BlockAimAssistData m_BlockData; //0x0060
        char _0x0068[8];
    };//Size=0x0070
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01848
    // RuntimeId: 07243
    // TypeInfo:  0x0000000142C513B0
#ifndef _CharacterCustomizationAsset_
#define _CharacterCustomizationAsset_
#pragma pack(push, 8)
    class CharacterCustomizationAsset : public DataContainerPolicyAsset
    {
    public:
        static __inline CharacterCustomizationAsset* DefaultInstance()
        {
            return (CharacterCustomizationAsset*)0x0000000068A29650;
        }
        static __inline unsigned int ClassId()
        {
            return 1848;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C513B0;
        }
        UIHudIcon m_UIHudIcon; //0x0018
        char _0x001C[4];
        char* m_UIKitIconName; //0x0020
        char* m_LabelSid; //0x0028
        CustomizationTable* m_VisualTable; //0x0030
        CustomizationTable* m_SpecializationTable; //0x0038
        Array<VoiceOverLabel*> m_VoiceOverLabels; //0x0040
    };//Size=0x0048
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03321
    // RuntimeId: 09609
    // TypeInfo:  0x0000000142C8C330
#ifndef _SoldierWeaponSocketObjectData_
#define _SoldierWeaponSocketObjectData_
#pragma pack(push, 16)
    class SoldierWeaponSocketObjectData : public SocketObjectDataBase
    {
    public:
        static __inline SoldierWeaponSocketObjectData* DefaultInstance()
        {
            return (SoldierWeaponSocketObjectData*)0x0000000068A5BF60;
        }
        static __inline unsigned int ClassId()
        {
            return 3321;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C330;
        }
        Guid m_SoldierWeaponGuid; //0x0010
        char _0x0010[16];
        LinearTransform m_Transform; //0x0020
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02379
    // RuntimeId: 09606
    // TypeInfo:  0x0000000142C8C390
#ifndef _CoverPeekEntityData_
#define _CoverPeekEntityData_
#pragma pack(push, 8)
    class CoverPeekEntityData : public EntityData
    {
    public:
        static __inline CoverPeekEntityData* DefaultInstance()
        {
            return (CoverPeekEntityData*)0x0000000068A35960;
        }
        static __inline unsigned int ClassId()
        {
            return 2379;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C390;
        }
        CoverPeekBinding m_Binding; //0x0018
        float m_DetectDistanceForward; //0x0090
        float m_DetectDistanceHorizontal; //0x0094
        bool m_OverEnabled; //0x0098
        bool m_HorizEnabled; //0x0099
        char _0x009A[6];
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03097
    // RuntimeId: 09602
    // TypeInfo:  0x0000000142C8C3F0
#ifndef _BlockAimAssistComponentData_
#define _BlockAimAssistComponentData_
#pragma pack(push, 16)
    class BlockAimAssistComponentData : public GameComponentData
    {
    public:
        static __inline BlockAimAssistComponentData* DefaultInstance()
        {
            return (BlockAimAssistComponentData*)0x0000000068A52640;
        }
        static __inline unsigned int ClassId()
        {
            return 3097;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C3F0;
        }
        BlockAimAssistData m_BlockData; //0x0070
        char _0x0078[8];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03072
    // RuntimeId: 09600
    // TypeInfo:  0x0000000142C8C450
#ifndef _EntryAimAssistTargetOptionsComponentData_
#define _EntryAimAssistTargetOptionsComponentData_
#pragma pack(push, 16)
    class EntryAimAssistTargetOptionsComponentData : public GameComponentData
    {
    public:
        static __inline EntryAimAssistTargetOptionsComponentData* DefaultInstance()
        {
            return (EntryAimAssistTargetOptionsComponentData*)0x0000000068A504F0;
        }
        static __inline unsigned int ClassId()
        {
            return 3072;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C450;
        }
        float m_NotSnapZoomTargetAngle; //0x0070
        bool m_AllowSoldierAsTarget; //0x0074
        char _0x0075[11];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03084
    // RuntimeId: 09598
    // TypeInfo:  0x0000000142C8C4B0
#ifndef _AimAssistNodeSnapPointComponentData_
#define _AimAssistNodeSnapPointComponentData_
#pragma pack(push, 16)
    class AimAssistNodeSnapPointComponentData : public GameComponentData
    {
    public:
        static __inline AimAssistNodeSnapPointComponentData* DefaultInstance()
        {
            return (AimAssistNodeSnapPointComponentData*)0x0000000068A51810;
        }
        static __inline unsigned int ClassId()
        {
            return 3084;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C4B0;
        }
        unsigned __int32 m_Priority; //0x0070
        float m_UnderReticleSphereRadius; //0x0074
        float m_UnderReticleCapsuleLength; //0x0078
        unsigned __int32 m_Priority_UnderReticle; //0x007C
        bool m_Enabled; //0x0080
        char _0x0081[15];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03075
    // RuntimeId: 09596
    // TypeInfo:  0x0000000142C8C510
#ifndef _AimAssistNodeComponentData_
#define _AimAssistNodeComponentData_
#pragma pack(push, 16)
    class AimAssistNodeComponentData : public GameComponentData
    {
    public:
        static __inline AimAssistNodeComponentData* DefaultInstance()
        {
            return (AimAssistNodeComponentData*)0x0000000068A506E0;
        }
        static __inline unsigned int ClassId()
        {
            return 3075;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C510;
        }
        Vec3 m_StickyCenterOffset; //0x0070
        TeamId m_Team; //0x0080
        bool m_Enabled; //0x0084
        bool m_GetTeamFromOwner; //0x0085
        bool m_ColorPlayerReticle; //0x0086
        char _0x0087[9];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03131
    // RuntimeId: 09594
    // TypeInfo:  0x0000000142C8C570
#ifndef _SoldierBreathControlComponentData_
#define _SoldierBreathControlComponentData_
#pragma pack(push, 16)
    class SoldierBreathControlComponentData : public GameComponentData
    {
    public:
        static __inline SoldierBreathControlComponentData* DefaultInstance()
        {
            return (SoldierBreathControlComponentData*)0x0000000068A53F90;
        }
        static __inline unsigned int ClassId()
        {
            return 3131;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C570;
        }
        float m_Time; //0x0070
        float m_TransitionTime; //0x0074
        float m_TransitionCurveShape; //0x0078
        float m_ReleaseTime; //0x007C
        float m_PenaltyMultiplier; //0x0080
        float m_PenaltyTimeout; //0x0084
        char _0x0088[8];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03128
    // RuntimeId: 07166
    // TypeInfo:  0x0000000142C52310
#ifndef _CharacterCustomizationComponentData_
#define _CharacterCustomizationComponentData_
#pragma pack(push, 16)
    class CharacterCustomizationComponentData : public GameComponentData
    {
    public:
        static __inline CharacterCustomizationComponentData* DefaultInstance()
        {
            return (CharacterCustomizationComponentData*)0x0000000068A53D60;
        }
        static __inline unsigned int ClassId()
        {
            return 3128;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C52310;
        }
        MeshLodGroup* m_SharedLodGroup; //0x0070
        char _0x0078[8];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01987
    // RuntimeId: 09590
    // TypeInfo:  0x0000000142C8C630
#ifndef _CharacterSocketListAsset_
#define _CharacterSocketListAsset_
#pragma pack(push, 8)
    class CharacterSocketListAsset : public Asset
    {
    public:
        static __inline CharacterSocketListAsset* DefaultInstance()
        {
            return (CharacterSocketListAsset*)0x0000000068A2CC90;
        }
        static __inline unsigned int ClassId()
        {
            return 1987;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C630;
        }
        Array<SocketData*> m_GameplaySockets; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02082
    // RuntimeId: 09588
    // TypeInfo:  0x0000000142C8C690
#ifndef _SocketData_
#define _SocketData_
#pragma pack(push, 16)
    class SocketData : public DataContainer
    {
    public:
        static __inline SocketData* DefaultInstance()
        {
            return (SocketData*)0x0000000068A2E990;
        }
        static __inline unsigned int ClassId()
        {
            return 2082;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C690;
        }
        Guid m_UnlockAssetGuid; //0x0010
        char _0x0010[16];
        Guid m_BelongsToUnlockAssetGuid; //0x0020
        char _0x0020[16];
        char* m_BoneName; //0x0030
        __int32 m_BoneId; //0x0038
        char _0x003C[4];
        LinearTransform m_BoneRigidTransform; //0x0040
        LinearTransform m_Transform; //0x0080
        Array<SocketObjectDataBase*> m_AvailableObjects; //0x00C0
        GearSlot m_GearSlot; //0x00C8
        SocketType m_SocketType; //0x00CC
        bool m_Excluded; //0x00D0
        bool m_UsesDefaultObject; //0x00D1
        bool m_DefaultEnableSocketEntities; //0x00D2
        bool m_ForceSocketEntitiesEnabled; //0x00D3
        bool m_HideByZoomTransition; //0x00D4
        bool m_HideByLightToggle; //0x00D5
        char _0x00D6[10];
    };//Size=0x00E0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03320
    // RuntimeId: 09902
    // TypeInfo:  0x0000000142C8A230
#ifndef _WeaponRegularSocketObjectData_
#define _WeaponRegularSocketObjectData_
#pragma pack(push, 16)
    class WeaponRegularSocketObjectData : public WeaponSocketObjectData
    {
    public:
        static __inline WeaponRegularSocketObjectData* DefaultInstance()
        {
            return (WeaponRegularSocketObjectData*)0x0000000068A5BEC0;
        }
        static __inline unsigned int ClassId()
        {
            return 3320;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8A230;
        }
        Array<LinearTransform> m_Mesh3pTransforms; //0x0030
        char _0x0038[8];
        LinearTransform m_Transform; //0x0040
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03188
    // RuntimeId: 09582
    // TypeInfo:  0x0000000142C8C750
#ifndef _MovementComponentData_
#define _MovementComponentData_
#pragma pack(push, 16)
    class MovementComponentData : public GameComponentData
    {
    public:
        static __inline MovementComponentData* DefaultInstance()
        {
            return (MovementComponentData*)0x0000000068A575D0;
        }
        static __inline unsigned int ClassId()
        {
            return 3188;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C750;
        }
        MovementComponentBinding m_MovementBinding; //0x0070
        bool m_ClientSidePhysicsControlled; //0x00D4
        char _0x00D5[11];
    };//Size=0x00E0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03093
    // RuntimeId: 07053
    // TypeInfo:  0x0000000142C52EB0
#ifndef _CharacterCameraComponentData_
#define _CharacterCameraComponentData_
#pragma pack(push, 16)
    class CharacterCameraComponentData : public GameComponentData
    {
    public:
        static __inline CharacterCameraComponentData* DefaultInstance()
        {
            return (CharacterCameraComponentData*)0x0000000068A52050;
        }
        static __inline unsigned int ClassId()
        {
            return 3093;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C52EB0;
        }
        Array<TargetCameraData*> m_Cameras; //0x0070
        CharacterCameraForwardAxis m_CameraForwardAxis; //0x0078
        char _0x007C[4];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03064
    // RuntimeId: 09572
    // TypeInfo:  0x0000000142C8C810
#ifndef _SoldierBodyComponentData_
#define _SoldierBodyComponentData_
#pragma pack(push, 16)
    class SoldierBodyComponentData : public GameComponentData
    {
    public:
        static __inline SoldierBodyComponentData* DefaultInstance()
        {
            return (SoldierBodyComponentData*)0x0000000068A4FEF0;
        }
        static __inline unsigned int ClassId()
        {
            return 3064;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C810;
        }
        float m_OverrideGravityValue; //0x0070
        float m_OverrideVelocityY; //0x0074
        float m_SprintMultiplier; //0x0078
        bool m_OverrideGravity; //0x007C
        bool m_OverrideVelocity; //0x007D
        bool m_DisableParachute; //0x007E
        char _0x007F[1];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03108
    // RuntimeId: 09570
    // TypeInfo:  0x0000000142C8C870
#ifndef _BoneCollisionComponentData_
#define _BoneCollisionComponentData_
#pragma pack(push, 16)
    class BoneCollisionComponentData : public GameComponentData
    {
    public:
        static __inline BoneCollisionComponentData* DefaultInstance()
        {
            return (BoneCollisionComponentData*)0x0000000068A52EF0;
        }
        static __inline unsigned int ClassId()
        {
            return 3108;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8C870;
        }
        SkeletonCollisionData* m_SkeletonCollisionData; //0x0070
        char _0x0078[8];
    };//Size=0x0080
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03162
    // RuntimeId: 07107
    // TypeInfo:  0x0000000142C52730
#ifndef _EntryComponentData_
#define _EntryComponentData_
#pragma pack(push, 16)
    class EntryComponentData : public GameComponentData
    {
    public:
        static __inline EntryComponentData* DefaultInstance()
        {
            return (EntryComponentData*)0x0000000068A55D60;
        }
        static __inline unsigned int ClassId()
        {
            return 3162;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C52730;
        }
        Vec3 m_SoldierOffset; //0x0070
        EntryClass m_EntryClass; //0x0080
        char _0x0084[4];
        GameAIEntryData* m_AIData; //0x0088
        EntryInputActionMapsData* m_InputConceptDefinition; //0x0090
        InputActionMappingsData* m_InputMapping; //0x0098
        Array<InputCurveData*> m_InputCurves; //0x00A0
        EntryComponentHudData m_HudData; //0x00A8
        __int32 m_EntryOrderNumber; //0x00B4
        float m_EnterImpulse; //0x00B8
        float m_EntryRadius; //0x00BC
        float m_SoldierTransitionInvisbleTime; //0x00C0
        __int32 m_NumberOfStances; //0x00C4
        EntrySpottingSettings m_EntrySpottingSettings; //0x00C8
        char _0x00CC[4];
        EntryComponentSoundData* m_EntryComponentSound; //0x00D0
        __int32 m_TriggerEventOnKey; //0x00D8
        bool m_ForbiddenForHuman; //0x00DC
        bool m_IsAllowedToExitInAir; //0x00DD
        bool m_IsShielded; //0x00DE
        bool m_LockSoldierAimingToEntry; //0x00DF
        bool m_ShowSoldierInEntry; //0x00E0
        bool m_Show1pSoldierInEntry; //0x00E1
        bool m_StancesEnabled; //0x00E2
        bool m_ShowSoldierWeaponInEntry; //0x00E3
        bool m_Show1pSoldierInEntryForPlayerOnly; //0x00E4
        bool m_Show3pSoldierWeaponInEntry; //0x00E5
        bool m_ShowSoldierGearInEntry; //0x00E6
        PoseConstraintsData m_PoseConstraints; //0x00E7
        bool m_AllowRagdollFromEntry; //0x00EA
        char _0x00EB[5];
    };//Size=0x00F0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01855
    // RuntimeId: 03815
    // TypeInfo:  0x0000000142BFF350
#ifndef _DataBusData_
#define _DataBusData_
#pragma pack(push, 8)
    class DataBusData : public Asset
    {
    public:
        static __inline DataBusData* DefaultInstance()
        {
            return (DataBusData*)0x0000000068A29B00;
        }
        static __inline unsigned int ClassId()
        {
            return 1855;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142BFF350;
        }
        Array<PropertyConnection> m_PropertyConnections; //0x0018
        Array<LinkConnection> m_LinkConnections; //0x0020
        DynamicDataContainer* m_Interface; //0x0028
        unsigned __int16 m_Flags; //0x0030
        char _0x0032[6];
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01856
    // RuntimeId: 05060
    // TypeInfo:  0x0000000142C207D0
#ifndef _EntityBusData_
#define _EntityBusData_
#pragma pack(push, 8)
    class EntityBusData : public DataBusData
    {
    public:
        static __inline EntityBusData* DefaultInstance()
        {
            return (EntityBusData*)0x0000000068A29B50;
        }
        static __inline unsigned int ClassId()
        {
            return 1856;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C207D0;
        }
        Array<EventConnection> m_EventConnections; //0x0038
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01857
    // RuntimeId: 05062
    // TypeInfo:  0x0000000142C20770
#ifndef _Blueprint_
#define _Blueprint_
#pragma pack(push, 8)
    class Blueprint : public EntityBusData
    {
    public:
        static __inline Blueprint* DefaultInstance()
        {
            return (Blueprint*)0x0000000068A29BB0;
        }
        static __inline unsigned int ClassId()
        {
            return 1857;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C20770;
        }
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01865
    // RuntimeId: 05064
    // TypeInfo:  0x0000000142C20710
#ifndef _ObjectBlueprint_
#define _ObjectBlueprint_
#pragma pack(push, 8)
    class ObjectBlueprint : public Blueprint
    {
    public:
        static __inline ObjectBlueprint* DefaultInstance()
        {
            return (ObjectBlueprint*)0x0000000068A29FF0;
        }
        static __inline unsigned int ClassId()
        {
            return 1865;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C20710;
        }
        GameObjectData* m_Object; //0x0040
    };//Size=0x0048
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00317
    // RuntimeId: 05839
    // TypeInfo:  0x0000000142C31020
#ifndef _ClientGameComponent_
#define _ClientGameComponent_
    class ClientGameComponent : public GameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 317;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C31020;
        }
        char _0x0030[8];
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   00542
    // RuntimeId: 05826
    // TypeInfo:  0x0000000142C30CD0
#ifndef _ClientGamePhysicsComponent_
#define _ClientGamePhysicsComponent_
    class ClientGamePhysicsComponent : public PhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 542;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C30CD0;
        }
        char _0x0028[32];
    };//Size=0x0048
#endif

    ////////////////////////////////////////
    // ClassId:   00577
    // RuntimeId: 08233
    // TypeInfo:  0x0000000142C678D0
#ifndef _HealthComponent_
#define _HealthComponent_
    class HealthComponent : public Component
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 577;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C678D0;
        }
        char _0x0020[8];
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00334
    // RuntimeId: 05740
    // TypeInfo:  0x0000000142C2DFC0
#ifndef _ClientCharacterCustomizationComponent_
#define _ClientCharacterCustomizationComponent_
    class ClientCharacterCustomizationComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 334;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C2DFC0;
        }
        char _0x0038[584];
    };//Size=0x0280
#endif

    ////////////////////////////////////////
    // ClassId:   00383
    // RuntimeId: 05739
    // TypeInfo:  0x0000000142C2E010
#ifndef _ClientCharacterCameraComponent_
#define _ClientCharacterCameraComponent_
    class ClientCharacterCameraComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 383;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C2E010;
        }
        char _0x0038[88];
    };//Size=0x0090
#endif

    ////////////////////////////////////////
    // ClassId:   00239
    // RuntimeId: 06069
    // TypeInfo:  0x0000000142C370F0
#ifndef _TargetCameraCallback_
#define _TargetCameraCallback_
    class TargetCameraCallback
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 239;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C370F0;
        }
        char _0x0000[8];
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00330
    // RuntimeId: 09538
    // TypeInfo:  0x0000000142C84C70
#ifndef _ClientSoldierBreathControlComponent_
#define _ClientSoldierBreathControlComponent_
    class ClientSoldierBreathControlComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 330;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84C70;
        }
        char _0x0038[144];
    };//Size=0x00C8
#endif

    ////////////////////////////////////////
    // ClassId:   00416
    // RuntimeId: 09537
    // TypeInfo:  0x0000000142C84CC0
#ifndef _ClientSoldierBodyComponent_
#define _ClientSoldierBodyComponent_
    class ClientSoldierBodyComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 416;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84CC0;
        }
        char _0x0038[232];
    };//Size=0x0120
#endif

    ////////////////////////////////////////
    // ClassId:   00425
    // RuntimeId: 09536
    // TypeInfo:  0x0000000142C84D10
#ifndef _ClientRagdollComponent_
#define _ClientRagdollComponent_
    class ClientRagdollComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 425;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84D10;
        }
        char _0x0038[536];
    };//Size=0x0250
#endif

    ////////////////////////////////////////
    // ClassId:   00544
    // RuntimeId: 09535
    // TypeInfo:  0x0000000142C84D60
#ifndef _ClientPickupPhysicsComponent_
#define _ClientPickupPhysicsComponent_
    class ClientPickupPhysicsComponent : public ClientGamePhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 544;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84D60;
        }
    };//Size=0x0048
#endif

    ////////////////////////////////////////
    // ClassId:   00419
    // RuntimeId: 09534
    // TypeInfo:  0x0000000142C84DB0
#ifndef _ClientPhantomComponent_
#define _ClientPhantomComponent_
    class ClientPhantomComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 419;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84DB0;
        }
        char _0x0038[1288];
    };//Size=0x0540
#endif

    ////////////////////////////////////////
    // ClassId:   00326
    // RuntimeId: 09533
    // TypeInfo:  0x0000000142C84E00
#ifndef _ClientMovementComponent_
#define _ClientMovementComponent_
    class ClientMovementComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 326;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84E00;
        }
        char _0x0038[168];
    };//Size=0x00E0
#endif

    ////////////////////////////////////////
    // ClassId:   00394
    // RuntimeId: 09532
    // TypeInfo:  0x0000000142C84E50
#ifndef _ClientHitReactionComponent_
#define _ClientHitReactionComponent_
    class ClientHitReactionComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 394;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84E50;
        }
        char _0x0038[120];
    };//Size=0x00B0
#endif

    ////////////////////////////////////////
    // ClassId:   00387
    // RuntimeId: 09531
    // TypeInfo:  0x0000000142C84EA0
#ifndef _ClientFaceposerComponent_
#define _ClientFaceposerComponent_
    class ClientFaceposerComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 387;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84EA0;
        }
        char _0x0038[312];
    };//Size=0x0170
#endif

    ////////////////////////////////////////
    // ClassId:   00410
    // RuntimeId: 09530
    // TypeInfo:  0x0000000142C84EF0
#ifndef _ClientBoneCollisionComponent_
#define _ClientBoneCollisionComponent_
    class ClientBoneCollisionComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 410;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84EF0;
        }
        char _0x0038[784];
    };//Size=0x0348
#endif

    ////////////////////////////////////////
    // ClassId:   00375
    // RuntimeId: 09529
    // TypeInfo:  0x0000000142C84F40
#ifndef _ClientBlockAimAssistComponent_
#define _ClientBlockAimAssistComponent_
    class ClientBlockAimAssistComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 375;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84F40;
        }
        char _0x0038[8];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   00445
    // RuntimeId: 09528
    // TypeInfo:  0x0000000142C84A40
#ifndef _ClientEntryAimAssistTargetOptionsComponent_
#define _ClientEntryAimAssistTargetOptionsComponent_
    class ClientEntryAimAssistTargetOptionsComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 445;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84A40;
        }
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   00411
    // RuntimeId: 09527
    // TypeInfo:  0x0000000142C84A90
#ifndef _ClientAimAssistNodeSnapPointComponent_
#define _ClientAimAssistNodeSnapPointComponent_
    class ClientAimAssistNodeSnapPointComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 411;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84A90;
        }
        char _0x0038[8];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   00444
    // RuntimeId: 09526
    // TypeInfo:  0x0000000142C84F90
#ifndef _ClientAimAssistNodeComponent_
#define _ClientAimAssistNodeComponent_
    class ClientAimAssistNodeComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 444;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84F90;
        }
        char _0x0038[1088];
    };//Size=0x0478
#endif

    ////////////////////////////////////////
    // ClassId:   01279
    // RuntimeId: 09525
    // TypeInfo:  0x0000000142C85030
#ifndef _ClientWeaponLagEntity_
#define _ClientWeaponLagEntity_
    class ClientWeaponLagEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1279;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C85030;
        }
        char _0x0020[72];
    };//Size=0x0068
#endif

    ////////////////////////////////////////
    // ClassId:   01345
    // RuntimeId: 09524
    // TypeInfo:  0x0000000142C850D0
#ifndef _ClientCoverPeekEntity_
#define _ClientCoverPeekEntity_
    class ClientCoverPeekEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1345;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C850D0;
        }
        char _0x0020[512];
    };//Size=0x0220
#endif

    ////////////////////////////////////////
    // ClassId:   00447
    // RuntimeId: 06300
    // TypeInfo:  0x0000000142C3D680
#ifndef _ServerGameComponent_
#define _ServerGameComponent_
    class ServerGameComponent : public GameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 447;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C3D680;
        }
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00519
    // RuntimeId: 06379
    // TypeInfo:  0x0000000142C40B30
#ifndef _ServerEntryComponent_
#define _ServerEntryComponent_
    class ServerEntryComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 519;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C40B30;
        }
        char _0x0030[320];
    };//Size=0x0170
#endif

    ////////////////////////////////////////
    // ClassId:   00524
    // RuntimeId: 09521
    // TypeInfo:  0x0000000142C841E0
#ifndef _ServerWeaponZeroingComponent_
#define _ServerWeaponZeroingComponent_
    class ServerWeaponZeroingComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 524;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C841E0;
        }
        char _0x0030[40];
    };//Size=0x0058
#endif

    ////////////////////////////////////////
    // ClassId:   00473
    // RuntimeId: 09520
    // TypeInfo:  0x0000000142C84230
#ifndef _ServerSoldierWeaponsComponent_
#define _ServerSoldierWeaponsComponent_
    class ServerSoldierWeaponsComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 473;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84230;
        }
        char _0x0030[2656];
    };//Size=0x0A90
#endif

    ////////////////////////////////////////
    // ClassId:   00560
    // RuntimeId: 06348
    // TypeInfo:  0x0000000142C3FE90
#ifndef _ServerGamePhysicsComponent_
#define _ServerGamePhysicsComponent_
    class ServerGamePhysicsComponent : public PhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 560;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C3FE90;
        }
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00578
    // RuntimeId: 06347
    // TypeInfo:  0x0000000142C3FEE0
#ifndef _ServerGameHealthComponent_
#define _ServerGameHealthComponent_
    class ServerGameHealthComponent : public HealthComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 578;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C3FEE0;
        }
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00493
    // RuntimeId: 06365
    // TypeInfo:  0x0000000142C40A40
#ifndef _ServerCharacterCustomizationComponent_
#define _ServerCharacterCustomizationComponent_
    class ServerCharacterCustomizationComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 493;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C40A40;
        }
        char _0x0030[648];
    };//Size=0x02B8
#endif

    ////////////////////////////////////////
    // ClassId:   00528
    // RuntimeId: 09516
    // TypeInfo:  0x0000000142C84370
#ifndef _ServerSoldierCameraComponent_
#define _ServerSoldierCameraComponent_
    class ServerSoldierCameraComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 528;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84370;
        }
        char _0x0030[112];
    };//Size=0x00A0
#endif

    ////////////////////////////////////////
    // ClassId:   00448
    // RuntimeId: 09515
    // TypeInfo:  0x0000000142C843C0
#ifndef _ServerSoldierBodyComponent_
#define _ServerSoldierBodyComponent_
    class ServerSoldierBodyComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 448;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C843C0;
        }
        char _0x0030[272];
    };//Size=0x0140
#endif

    ////////////////////////////////////////
    // ClassId:   00499
    // RuntimeId: 09514
    // TypeInfo:  0x0000000142C84410
#ifndef _ServerRagdollComponent_
#define _ServerRagdollComponent_
    class ServerRagdollComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 499;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84410;
        }
        char _0x0030[480];
    };//Size=0x0210
#endif

    ////////////////////////////////////////
    // ClassId:   00569
    // RuntimeId: 09513
    // TypeInfo:  0x0000000142C84460
#ifndef _ServerPickupPhysicsComponent_
#define _ServerPickupPhysicsComponent_
    class ServerPickupPhysicsComponent : public ServerGamePhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 569;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84460;
        }
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00485
    // RuntimeId: 09512
    // TypeInfo:  0x0000000142C844B0
#ifndef _ServerMovementComponent_
#define _ServerMovementComponent_
    class ServerMovementComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 485;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C844B0;
        }
        char _0x0030[24];
    };//Size=0x0048
#endif

    ////////////////////////////////////////
    // ClassId:   00510
    // RuntimeId: 09511
    // TypeInfo:  0x0000000142C84500
#ifndef _ServerHitReactionComponent_
#define _ServerHitReactionComponent_
    class ServerHitReactionComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 510;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84500;
        }
        char _0x0030[112];
    };//Size=0x00A0
#endif

    ////////////////////////////////////////
    // ClassId:   00509
    // RuntimeId: 09510
    // TypeInfo:  0x0000000142C84550
#ifndef _ServerBoneCollisionComponent_
#define _ServerBoneCollisionComponent_
    class ServerBoneCollisionComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 509;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C84550;
        }
        char _0x0030[784];
    };//Size=0x0340
#endif

    ////////////////////////////////////////
    // ClassId:   00637
    // RuntimeId: 09509
    // TypeInfo:  0x0000000142C83A70
#ifndef _ServerStateEventGateEntity_
#define _ServerStateEventGateEntity_
    class ServerStateEventGateEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 637;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83A70;
        }
        char _0x0020[16];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   01166
    // RuntimeId: 09508
    // TypeInfo:  0x0000000142C83B10
#ifndef _ServerCustomizeSoldierEntity_
#define _ServerCustomizeSoldierEntity_
    class ServerCustomizeSoldierEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1166;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83B10;
        }
        char _0x0020[1936];
    };//Size=0x07B0
#endif

    ////////////////////////////////////////
    // ClassId:   00676
    // RuntimeId: 05895
    // TypeInfo:  0x0000000142C33500
#ifndef _GameComponentEntity_
#define _GameComponentEntity_
    class GameComponentEntity : public ComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 676;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C33500;
        }
        char _0x0040[32];
    };//Size=0x0060
#endif

    ////////////////////////////////////////
    // ClassId:   00719
    // RuntimeId: 06303
    // TypeInfo:  0x0000000142C3DA90
#ifndef _ServerGameComponentEntity_
#define _ServerGameComponentEntity_
    class ServerGameComponentEntity : public GameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 719;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C3DA90;
        }
    };//Size=0x0060
#endif

    ////////////////////////////////////////
    // ClassId:   00721
    // RuntimeId: 09505
    // TypeInfo:  0x0000000142C83C50
#ifndef _ServerPickupEntity_
#define _ServerPickupEntity_
    class ServerPickupEntity : public ServerGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 721;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83C50;
        }
        char _0x0060[384];
    };//Size=0x01E0
#endif

    ////////////////////////////////////////
    // ClassId:   00187
    // RuntimeId: 06082
    // TypeInfo:  0x0000000142C37A10
#ifndef _Tool_
#define _Tool_
    class Tool
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 187;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C37A10;
        }
        char _0x0000[24];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00727
    // RuntimeId: 09503
    // TypeInfo:  0x0000000142C83CF0
#ifndef _ServerSoldierWeapon_
#define _ServerSoldierWeapon_
    class ServerSoldierWeapon : public ServerGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 727;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83CF0;
        }
        char _0x0060[448];
    };//Size=0x0220
#endif

    ////////////////////////////////////////
    // ClassId:   00472
    // RuntimeId: 09502
    // TypeInfo:  0x0000000142C83700
#ifndef _ServerSoldierGripComponent_
#define _ServerSoldierGripComponent_
    class ServerSoldierGripComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 472;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83700;
        }
        char _0x0030[104];
    };//Size=0x0098
#endif

    ////////////////////////////////////////
    // ClassId:   00506
    // RuntimeId: 09501
    // TypeInfo:  0x0000000142C83750
#ifndef _ServerAnimationTurretRotationComponent_
#define _ServerAnimationTurretRotationComponent_
    class ServerAnimationTurretRotationComponent : public ServerGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 506;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83750;
        }
        char _0x0030[80];
    };//Size=0x0080
#endif

    ////////////////////////////////////////
    // ClassId:   00728
    // RuntimeId: 06306
    // TypeInfo:  0x0000000142C3D6D0
#ifndef _ServerPhysicsEntity_
#define _ServerPhysicsEntity_
    class ServerPhysicsEntity : public ServerGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 728;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C3D6D0;
        }
        char _0x0060[8];
    };//Size=0x0068
#endif

    ////////////////////////////////////////
    // ClassId:   00739
    // RuntimeId: 06266
    // TypeInfo:  0x0000000142C3BA20
#ifndef _ServerProjectileEntity_
#define _ServerProjectileEntity_
    class ServerProjectileEntity : public ServerPhysicsEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 739;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C3BA20;
        }
        char _0x0068[232];
    };//Size=0x0150
#endif

    ////////////////////////////////////////
    // ClassId:   00570
    // RuntimeId: 09498
    // TypeInfo:  0x0000000142C837A0
#ifndef _ServerMissilePhysicsComponent_
#define _ServerMissilePhysicsComponent_
    class ServerMissilePhysicsComponent : public ServerGamePhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 570;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C837A0;
        }
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00585
    // RuntimeId: 09497
    // TypeInfo:  0x0000000142C837F0
#ifndef _ServerMissileHealthComponent_
#define _ServerMissileHealthComponent_
    class ServerMissileHealthComponent : public ServerGameHealthComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 585;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C837F0;
        }
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00566
    // RuntimeId: 09496
    // TypeInfo:  0x0000000142C83840
#ifndef _ServerExplosionPackPhysicsComponent_
#define _ServerExplosionPackPhysicsComponent_
    class ServerExplosionPackPhysicsComponent : public ServerGamePhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 566;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83840;
        }
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00579
    // RuntimeId: 09495
    // TypeInfo:  0x0000000142C83890
#ifndef _ServerExplosionPackHealthComponent_
#define _ServerExplosionPackHealthComponent_
    class ServerExplosionPackHealthComponent : public ServerGameHealthComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 579;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83890;
        }
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00188
    // RuntimeId: 06083
    // TypeInfo:  0x0000000142C379C0
#ifndef _Weapon_
#define _Weapon_
    class Weapon : public Tool
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 188;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C379C0;
        }
        char _0x0018[328];
    };//Size=0x0160
#endif

    ////////////////////////////////////////
    // ClassId:   00677
    // RuntimeId: 05841
    // TypeInfo:  0x0000000142C311B0
#ifndef _ClientGameComponentEntity_
#define _ClientGameComponentEntity_
    class ClientGameComponentEntity : public GameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 677;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C311B0;
        }
    };//Size=0x0060
#endif

    ////////////////////////////////////////
    // ClassId:   00430
    // RuntimeId: 09492
    // TypeInfo:  0x0000000142C82C80
#ifndef _ClientSoldierGripComponent_
#define _ClientSoldierGripComponent_
    class ClientSoldierGripComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 430;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82C80;
        }
        char _0x0038[168];
    };//Size=0x00E0
#endif

    ////////////////////////////////////////
    // ClassId:   00377
    // RuntimeId: 09491
    // TypeInfo:  0x0000000142C82CD0
#ifndef _ClientAnimationTurretRotationComponent_
#define _ClientAnimationTurretRotationComponent_
    class ClientAnimationTurretRotationComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 377;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82CD0;
        }
        char _0x0038[88];
    };//Size=0x0090
#endif

    ////////////////////////////////////////
    // ClassId:   00679
    // RuntimeId: 05843
    // TypeInfo:  0x0000000142C31070
#ifndef _ClientPhysicsEntity_
#define _ClientPhysicsEntity_
    class ClientPhysicsEntity : public ClientGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 679;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C31070;
        }
        char _0x0060[8];
    };//Size=0x0068
#endif

    ////////////////////////////////////////
    // ClassId:   00691
    // RuntimeId: 05670
    // TypeInfo:  0x0000000142C2A6D0
#ifndef _ClientProjectileEntity_
#define _ClientProjectileEntity_
    class ClientProjectileEntity : public ClientPhysicsEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 691;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C2A6D0;
        }
        char _0x0068[136];
    };//Size=0x00F0
#endif

    ////////////////////////////////////////
    // ClassId:   00692
    // RuntimeId: 05870
    // TypeInfo:  0x0000000142C32D70
#ifndef _ClientProxyProjectileEntity_
#define _ClientProxyProjectileEntity_
    class ClientProxyProjectileEntity : public ClientProjectileEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 692;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C32D70;
        }
        char _0x00F0[368];
    };//Size=0x0260
#endif

    ////////////////////////////////////////
    // ClassId:   00696
    // RuntimeId: 05668
    // TypeInfo:  0x0000000142C2A950
#ifndef _ClientGhostProjectileEntity_
#define _ClientGhostProjectileEntity_
    class ClientGhostProjectileEntity : public ClientProjectileEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 696;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C2A950;
        }
        char _0x00F0[496];
    };//Size=0x02E0
#endif

    ////////////////////////////////////////
    // ClassId:   00699
    // RuntimeId: 09486
    // TypeInfo:  0x0000000142C831D0
#ifndef _ClientGrenadeEntity_
#define _ClientGrenadeEntity_
    class ClientGrenadeEntity : public ClientGhostProjectileEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 699;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C831D0;
        }
        char _0x02E0[224];
    };//Size=0x03C0
#endif

    ////////////////////////////////////////
    // ClassId:   00700
    // RuntimeId: 09485
    // TypeInfo:  0x0000000142C83270
#ifndef _ClientFlareEntity_
#define _ClientFlareEntity_
    class ClientFlareEntity : public ClientGrenadeEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 700;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83270;
        }
    };//Size=0x03C0
#endif

    ////////////////////////////////////////
    // ClassId:   00701
    // RuntimeId: 09484
    // TypeInfo:  0x0000000142C83310
#ifndef _ClientExplosionPackEntity_
#define _ClientExplosionPackEntity_
    class ClientExplosionPackEntity : public ClientGhostProjectileEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 701;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C83310;
        }
        char _0x02E0[208];
    };//Size=0x03B0
#endif

    ////////////////////////////////////////
    // ClassId:   00551
    // RuntimeId: 09483
    // TypeInfo:  0x0000000142C82D20
#ifndef _ClientMissilePhysicsComponent_
#define _ClientMissilePhysicsComponent_
    class ClientMissilePhysicsComponent : public ClientGamePhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 551;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82D20;
        }
    };//Size=0x0048
#endif

    ////////////////////////////////////////
    // ClassId:   00546
    // RuntimeId: 09482
    // TypeInfo:  0x0000000142C82D70
#ifndef _ClientExplosionPackPhysicsComponent_
#define _ClientExplosionPackPhysicsComponent_
    class ClientExplosionPackPhysicsComponent : public ClientGamePhysicsComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 546;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82D70;
        }
    };//Size=0x0048
#endif

    ////////////////////////////////////////
    // ClassId:   00359
    // RuntimeId: 05751
    // TypeInfo:  0x0000000142C2E380
#ifndef _ClientEntryComponent_
#define _ClientEntryComponent_
    class ClientEntryComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 359;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C2E380;
        }
        char _0x0038[680];
    };//Size=0x02E0
#endif

    ////////////////////////////////////////
    // ClassId:   00360
    // RuntimeId: 09480
    // TypeInfo:  0x0000000142C82DC0
#ifndef _ClientRemoteEntryComponent_
#define _ClientRemoteEntryComponent_
    class ClientRemoteEntryComponent : public ClientEntryComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 360;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82DC0;
        }
        char _0x02E0[16];
    };//Size=0x02F0
#endif

    ////////////////////////////////////////
    // ClassId:   00389
    // RuntimeId: 09479
    // TypeInfo:  0x0000000142C82E10
#ifndef _ClientWeaponZeroingComponent_
#define _ClientWeaponZeroingComponent_
    class ClientWeaponZeroingComponent : public ClientGameComponent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 389;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82E10;
        }
        char _0x0038[40];
    };//Size=0x0060
#endif

    ////////////////////////////////////////
    // ClassId:   00863
    // RuntimeId: 09478
    // TypeInfo:  0x0000000142C82590
#ifndef _ClientWeaponStateEntity_
#define _ClientWeaponStateEntity_
    class ClientWeaponStateEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 863;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82590;
        }
        char _0x0020[56];
    };//Size=0x0058
#endif

    ////////////////////////////////////////
    // ClassId:   01388
    // RuntimeId: 09477
    // TypeInfo:  0x0000000142C82630
#ifndef _ClientPlayerLookAtEntity_
#define _ClientPlayerLookAtEntity_
    class ClientPlayerLookAtEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1388;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82630;
        }
        char _0x0020[16];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00715
    // RuntimeId: 09476
    // TypeInfo:  0x0000000142C826D0
#ifndef _ClientTripwireEntity_
#define _ClientTripwireEntity_
    class ClientTripwireEntity : public ClientGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 715;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C826D0;
        }
        char _0x0060[288];
    };//Size=0x0180
#endif

    ////////////////////////////////////////
    // ClassId:   00706
    // RuntimeId: 05661
    // TypeInfo:  0x0000000142C2A8B0
#ifndef _ClientControllableEntity_
#define _ClientControllableEntity_
    class ClientControllableEntity : public ClientPhysicsEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 706;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C2A8B0;
        }
        char _0x0068[288];
    };//Size=0x0188
#endif

    ////////////////////////////////////////
    // ClassId:   00678
    // RuntimeId: 09474
    // TypeInfo:  0x0000000142C82770
#ifndef _ClientPickupEntity_
#define _ClientPickupEntity_
    class ClientPickupEntity : public ClientGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 678;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82770;
        }
        char _0x0060[1008];
    };//Size=0x0450
#endif

    ////////////////////////////////////////
    // ClassId:   00667
    // RuntimeId: 09473
    // TypeInfo:  0x0000000142C82810
#ifndef _ClientBlockAimAssistEntity_
#define _ClientBlockAimAssistEntity_
    class ClientBlockAimAssistEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 667;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82810;
        }
        char _0x0028[120];
    };//Size=0x00A0
#endif

    ////////////////////////////////////////
    // ClassId:   01223
    // RuntimeId: 06277
    // TypeInfo:  0x0000000142C3C0F0
#ifndef _ServerTriggerEntity_
#define _ServerTriggerEntity_
    class ServerTriggerEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1223;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C3C0F0;
        }
        char _0x0020[72];
    };//Size=0x0068
#endif

    ////////////////////////////////////////
    // ClassId:   01236
    // RuntimeId: 09460
    // TypeInfo:  0x0000000142C82260
#ifndef _ServerCharacterStateTriggerEntity_
#define _ServerCharacterStateTriggerEntity_
    class ServerCharacterStateTriggerEntity : public ServerTriggerEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1236;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82260;
        }
        char _0x0068[32];
    };//Size=0x0088
#endif

    ////////////////////////////////////////
    // ClassId:   01357
    // RuntimeId: 09459
    // TypeInfo:  0x0000000142C82300
#ifndef _ServerWeaponStateEntity_
#define _ServerWeaponStateEntity_
    class ServerWeaponStateEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1357;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C82300;
        }
        char _0x0020[48];
    };//Size=0x0050
#endif

    ////////////////////////////////////////
    // ClassId:   03482
    // RuntimeId: 07749
    // TypeInfo:  0x0000000142C5FFE0
#ifndef _WaypointData_
#define _WaypointData_
#pragma pack(push, 8)
    class WaypointData : public DataContainer
    {
    public:
        static __inline WaypointData* DefaultInstance()
        {
            return (WaypointData*)0x0000000068A5F8F0;
        }
        static __inline unsigned int ClassId()
        {
            return 3482;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C5FFE0;
        }
        __int32 m_SchematicsNameHash; //0x0010
        unsigned __int32 m_WaypointId; //0x0014
        bool m_UseClientsPosition; //0x0018
        char _0x0019[7];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02396
    // RuntimeId: 09456
    // TypeInfo:  0x0000000142C81AA0
#ifndef _RailRideHeliSegmentData_
#define _RailRideHeliSegmentData_
#pragma pack(push, 16)
    class RailRideHeliSegmentData : public EntityData
    {
    public:
        static __inline RailRideHeliSegmentData* DefaultInstance()
        {
            return (RailRideHeliSegmentData*)0x0000000068A35EB0;
        }
        static __inline unsigned int ClassId()
        {
            return 2396;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81AA0;
        }
        __int32 m_StartIndex; //0x0018
        char _0x001C[4];
        Vec4 m_EditorColor; //0x0020
        __int32 m_EndIndex; //0x0030
        __int32 m_NodeIndex1; //0x0034
        __int32 m_NodeIndex2; //0x0038
        __int32 m_NodeIndex3; //0x003C
        float m_ExternalTime; //0x0040
        float m_StartDelay; //0x0044
        float m_WaypointsSpeedScale; //0x0048
        bool m_Looping; //0x004C
        bool m_TeleportOnActivate; //0x004D
        bool m_ForceSpeedOnActivate; //0x004E
        bool m_ForceDirectionOnActivate; //0x004F
        bool m_TeleportOnLoop; //0x0050
        bool m_OldRailCompatibility; //0x0051
        char _0x0052[14];
    };//Size=0x0060
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02468
    // RuntimeId: 09454
    // TypeInfo:  0x0000000142C81B00
#ifndef _RailRideNodeHeliData_
#define _RailRideNodeHeliData_
#pragma pack(push, 16)
    class RailRideNodeHeliData : public GameComponentEntityData
    {
    public:
        static __inline RailRideNodeHeliData* DefaultInstance()
        {
            return (RailRideNodeHeliData*)0x0000000068A38200;
        }
        static __inline unsigned int ClassId()
        {
            return 2468;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81B00;
        }
        float m_WindNoise; //0x0080
        float m_Speed; //0x0084
        float m_PointToDistance; //0x0088
        float m_Curvature; //0x008C
        float m_Constraint; //0x0090
        float m_ForcePitch; //0x0094
        float m_BankingScale; //0x0098
        bool m_LimitWindToHorizontal; //0x009C
        bool m_UseVelocityDirection; //0x009D
        bool m_PointForward; //0x009E
        bool m_WingMode; //0x009F
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02509
    // RuntimeId: 09452
    // TypeInfo:  0x0000000142C81B60
#ifndef _RailRideNodePointToData_
#define _RailRideNodePointToData_
#pragma pack(push, 16)
    class RailRideNodePointToData : public GameComponentEntityData
    {
    public:
        static __inline RailRideNodePointToData* DefaultInstance()
        {
            return (RailRideNodePointToData*)0x0000000068A3B4E0;
        }
        static __inline unsigned int ClassId()
        {
            return 2509;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81B60;
        }
        RailRideHeliPointToSide m_Side; //0x0080
        char _0x0084[12];
    };//Size=0x0090
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02511
    // RuntimeId: 09448
    // TypeInfo:  0x0000000142C819E0
#ifndef _RailRideHeliData_
#define _RailRideHeliData_
#pragma pack(push, 16)
    class RailRideHeliData : public GameComponentEntityData
    {
    public:
        static __inline RailRideHeliData* DefaultInstance()
        {
            return (RailRideHeliData*)0x0000000068A3B6B0;
        }
        static __inline unsigned int ClassId()
        {
            return 2511;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C819E0;
        }
        LinearTransform m_RootTransform; //0x0080
        LinearTransform m_ReferenceTransform; //0x00C0
        LinearTransform m_BlendTransform; //0x0100
        Vec3 m_PointToOverride; //0x0140
        float m_AngularApproachSlow; //0x0150
        float m_AngularApproachFast; //0x0154
        float m_TiltMax; //0x0158
        float m_TiltAccelMult; //0x015C
        float m_TiltSpeedMult; //0x0160
        float m_VeerDurationMin; //0x0164
        float m_VeerDurationMax; //0x0168
        float m_VeerPositionOffsetMin; //0x016C
        float m_VeerPositionOffsetMax; //0x0170
        float m_VeerHeadingOffsetMin; //0x0174
        float m_VeerHeadingOffsetMax; //0x0178
        __int32 m_SimulationStepsPerFrame; //0x017C
        float m_SoundAccelToThrottleMult; //0x0180
        float m_SoundSpeedToThrottleMult; //0x0184
        float m_Blend; //0x0188
        float m_SpeedMultiplier; //0x018C
        bool m_EnablePointToOverride; //0x0190
        bool m_UseSegmentExternalTime; //0x0191
        bool m_Braking; //0x0192
        bool m_TransformWaypoints; //0x0193
        bool m_ApplySpeedFix; //0x0194
        char _0x0195[11];
    };//Size=0x01A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01358
    // RuntimeId: 09446
    // TypeInfo:  0x0000000142C81BC0
#ifndef _RailRideHeliSegment_
#define _RailRideHeliSegment_
    class RailRideHeliSegment : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1358;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81BC0;
        }
        char _0x0020[16];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00724
    // RuntimeId: 09445
    // TypeInfo:  0x0000000142C81C60
#ifndef _ServerRailRideHeliEntity_
#define _ServerRailRideHeliEntity_
    class ServerRailRideHeliEntity : public ServerGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 724;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81C60;
        }
        char _0x0060[1280];
    };//Size=0x0560
#endif

    ////////////////////////////////////////
    // ClassId:   00716
    // RuntimeId: 09444
    // TypeInfo:  0x0000000142C81D00
#ifndef _ClientRailRideHeliEntity_
#define _ClientRailRideHeliEntity_
    class ClientRailRideHeliEntity : public ClientGameComponentEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 716;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81D00;
        }
        char _0x0060[1216];
    };//Size=0x0520
#endif

    ////////////////////////////////////////
    // ClassId:   03841
    // RuntimeId: 09443
    // TypeInfo:  0x0000000142C81680
#ifndef _OriginSettings_
#define _OriginSettings_
#pragma pack(push, 8)
    class OriginSettings : public SystemSettings
    {
    public:
        static __inline OriginSettings* DefaultInstance()
        {
            return (OriginSettings*)0x0000000068A67110;
        }
        static __inline unsigned int ClassId()
        {
            return 3841;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81680;
        }
        char* m_ContentId; //0x0020
        char* m_Title; //0x0028
        char* m_MultiplayerId; //0x0030
        char* m_Language; //0x0038
        OriginTokenType m_TokenType; //0x0040
        char _0x0044[4];
        char* m_AuthCodeClientId; //0x0048
        bool m_Enabled; //0x0050
        bool m_Log; //0x0051
        bool m_AllowProductionEnvironment; //0x0052
        char _0x0053[5];
    };//Size=0x0058
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00096
    // RuntimeId: 09436
    // TypeInfo:  0x0000000142C81470
#ifndef _OriginPresenceBackend_
#define _OriginPresenceBackend_
    class OriginPresenceBackend : public PresenceBackend
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 96;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81470;
        }
        char _0x0020[320];
    };//Size=0x0160
#endif

    ////////////////////////////////////////
    // ClassId:   00004
    // RuntimeId: 09388
    // TypeInfo:  0x0000000142C7FB10
#ifndef _PresenceRequestParameters_
#define _PresenceRequestParameters_
    class PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 4;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FB10;
        }
        char _0x0000[8];
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00046
    // RuntimeId: 09434
    // TypeInfo:  0x0000000142C808F0
#ifndef _PresenceGetAuthTokenRequestParameters_
#define _PresenceGetAuthTokenRequestParameters_
    class PresenceGetAuthTokenRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 46;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C808F0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00063
    // RuntimeId: 09433
    // TypeInfo:  0x0000000142C80940
#ifndef _PresenceLeavePartyRequestParameters_
#define _PresenceLeavePartyRequestParameters_
    class PresenceLeavePartyRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 63;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80940;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00068
    // RuntimeId: 09432
    // TypeInfo:  0x0000000142C80990
#ifndef _PresenceAcceptPartyInviteRequestParameters_
#define _PresenceAcceptPartyInviteRequestParameters_
    class PresenceAcceptPartyInviteRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 68;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80990;
        }
        char _0x0008[24];
    };//Size=0x0020
#endif

    ////////////////////////////////////////
    // ClassId:   00056
    // RuntimeId: 09431
    // TypeInfo:  0x0000000142C809E0
#ifndef _PresenceSendPartyInvitesRequestParameters_
#define _PresenceSendPartyInvitesRequestParameters_
    class PresenceSendPartyInvitesRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 56;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C809E0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00065
    // RuntimeId: 09430
    // TypeInfo:  0x0000000142C80A30
#ifndef _PresenceCreatePartyRequestParameters_
#define _PresenceCreatePartyRequestParameters_
    class PresenceCreatePartyRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 65;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80A30;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00076
    // RuntimeId: 09429
    // TypeInfo:  0x0000000142C80A80
#ifndef _PresenceGetUserProfilesRequestParameters_
#define _PresenceGetUserProfilesRequestParameters_
    class PresenceGetUserProfilesRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 76;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80A80;
        }
        char _0x0008[24];
    };//Size=0x0020
#endif

    ////////////////////////////////////////
    // ClassId:   00079
    // RuntimeId: 09428
    // TypeInfo:  0x0000000142C80AD0
#ifndef _PresenceDownloadUpdateRequestParameters_
#define _PresenceDownloadUpdateRequestParameters_
    class PresenceDownloadUpdateRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 79;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80AD0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00017
    // RuntimeId: 09427
    // TypeInfo:  0x0000000142C80B20
#ifndef _PresenceGetNativeDataByInviteTokenRequestParameters_
#define _PresenceGetNativeDataByInviteTokenRequestParameters_
    class PresenceGetNativeDataByInviteTokenRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 17;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80B20;
        }
        char _0x0008[112];
    };//Size=0x0078
#endif

    ////////////////////////////////////////
    // ClassId:   00072
    // RuntimeId: 09426
    // TypeInfo:  0x0000000142C80B70
#ifndef _PresenceGetUserIdRequestParameters_
#define _PresenceGetUserIdRequestParameters_
    class PresenceGetUserIdRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 72;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80B70;
        }
        char _0x0008[56];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   00021
    // RuntimeId: 09425
    // TypeInfo:  0x0000000142C80BC0
#ifndef _PresenceSetPlaygroupMemberAttributesRequestParameters_
#define _PresenceSetPlaygroupMemberAttributesRequestParameters_
    class PresenceSetPlaygroupMemberAttributesRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 21;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80BC0;
        }
        char _0x0008[56];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   00054
    // RuntimeId: 09424
    // TypeInfo:  0x0000000142C80C10
#ifndef _PresenceLookupPlaygroupsByIdRequestParameters_
#define _PresenceLookupPlaygroupsByIdRequestParameters_
    class PresenceLookupPlaygroupsByIdRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 54;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80C10;
        }
        char _0x0008[40];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00071
    // RuntimeId: 09423
    // TypeInfo:  0x0000000142C80C60
#ifndef _PresenceViewInviteRequestParameters_
#define _PresenceViewInviteRequestParameters_
    class PresenceViewInviteRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 71;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80C60;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00018
    // RuntimeId: 09422
    // TypeInfo:  0x0000000142C80CB0
#ifndef _PresenceKickFromPlaygroupRequestParameters_
#define _PresenceKickFromPlaygroupRequestParameters_
    class PresenceKickFromPlaygroupRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 18;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80CB0;
        }
        char _0x0008[80];
    };//Size=0x0058
#endif

    ////////////////////////////////////////
    // ClassId:   00048
    // RuntimeId: 09421
    // TypeInfo:  0x0000000142C80D00
#ifndef _PresenceSendInviteRequestParameters_
#define _PresenceSendInviteRequestParameters_
    class PresenceSendInviteRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 48;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80D00;
        }
        char _0x0008[464];
    };//Size=0x01D8
#endif

    ////////////////////////////////////////
    // ClassId:   00070
    // RuntimeId: 09420
    // TypeInfo:  0x0000000142C80D50
#ifndef _PresenceJoinGameByOnlineNativeDataRequestParameters_
#define _PresenceJoinGameByOnlineNativeDataRequestParameters_
    class PresenceJoinGameByOnlineNativeDataRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 70;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80D50;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00028
    // RuntimeId: 09419
    // TypeInfo:  0x0000000142C80DA0
#ifndef _PresenceGetLeaderboardRequestParameters_
#define _PresenceGetLeaderboardRequestParameters_
    class PresenceGetLeaderboardRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 28;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80DA0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00042
    // RuntimeId: 09418
    // TypeInfo:  0x0000000142C80DF0
#ifndef _PresenceDownloadStatisticsRequestParameters_
#define _PresenceDownloadStatisticsRequestParameters_
    class PresenceDownloadStatisticsRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 42;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80DF0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00009
    // RuntimeId: 09417
    // TypeInfo:  0x0000000142C80E40
#ifndef _PresenceSetPlaygroupJoinabilityRequestParameters_
#define _PresenceSetPlaygroupJoinabilityRequestParameters_
    class PresenceSetPlaygroupJoinabilityRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 9;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80E40;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00035
    // RuntimeId: 09416
    // TypeInfo:  0x0000000142C80E90
#ifndef _PresenceSetPlaygroupAttributeRequestParameters_
#define _PresenceSetPlaygroupAttributeRequestParameters_
    class PresenceSetPlaygroupAttributeRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 35;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80E90;
        }
        char _0x0008[72];
    };//Size=0x0050
#endif

    ////////////////////////////////////////
    // ClassId:   00077
    // RuntimeId: 09415
    // TypeInfo:  0x0000000142C80EE0
#ifndef _PresenceDisbandPlaygroupRequestParameters_
#define _PresenceDisbandPlaygroupRequestParameters_
    class PresenceDisbandPlaygroupRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 77;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80EE0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00067
    // RuntimeId: 09414
    // TypeInfo:  0x0000000142C80F30
#ifndef _PresenceLeavePlaygroupRequestParameters_
#define _PresenceLeavePlaygroupRequestParameters_
    class PresenceLeavePlaygroupRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 67;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80F30;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00055
    // RuntimeId: 09413
    // TypeInfo:  0x0000000142C80F80
#ifndef _PresenceJoinPlaygroupByInviteTokenRequestParameters_
#define _PresenceJoinPlaygroupByInviteTokenRequestParameters_
    class PresenceJoinPlaygroupByInviteTokenRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 55;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80F80;
        }
        char _0x0008[104];
    };//Size=0x0070
#endif

    ////////////////////////////////////////
    // ClassId:   00069
    // RuntimeId: 09412
    // TypeInfo:  0x0000000142C80FD0
#ifndef _PresenceJoinPlaygroupByOnlineNativeDataRequestParameters_
#define _PresenceJoinPlaygroupByOnlineNativeDataRequestParameters_
    class PresenceJoinPlaygroupByOnlineNativeDataRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 69;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80FD0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00008
    // RuntimeId: 09411
    // TypeInfo:  0x0000000142C81020
#ifndef _PresenceJoinPlaygroupByUsernameRequestParameters_
#define _PresenceJoinPlaygroupByUsernameRequestParameters_
    class PresenceJoinPlaygroupByUsernameRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 8;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81020;
        }
        char _0x0008[40];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00011
    // RuntimeId: 09410
    // TypeInfo:  0x0000000142C81070
#ifndef _PresenceCreateOrJoinPlaygroupRequestParameters_
#define _PresenceCreateOrJoinPlaygroupRequestParameters_
    class PresenceCreateOrJoinPlaygroupRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 11;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81070;
        }
        char _0x0008[24];
    };//Size=0x0020
#endif

    ////////////////////////////////////////
    // ClassId:   00059
    // RuntimeId: 09409
    // TypeInfo:  0x0000000142C810C0
#ifndef _PresenceJoinPlaygroupRequestParameters_
#define _PresenceJoinPlaygroupRequestParameters_
    class PresenceJoinPlaygroupRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 59;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C810C0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00037
    // RuntimeId: 09408
    // TypeInfo:  0x0000000142C81110
#ifndef _PresenceCreatePlaygroupRequestParameters_
#define _PresenceCreatePlaygroupRequestParameters_
    class PresenceCreatePlaygroupRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 37;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81110;
        }
        char _0x0008[64];
    };//Size=0x0048
#endif

    ////////////////////////////////////////
    // ClassId:   00058
    // RuntimeId: 09407
    // TypeInfo:  0x0000000142C81160
#ifndef _PresenceHttpPostRequestParameters_
#define _PresenceHttpPostRequestParameters_
    class PresenceHttpPostRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 58;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81160;
        }
        char _0x0008[40];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00032
    // RuntimeId: 09406
    // TypeInfo:  0x0000000142C811B0
#ifndef _PresenceHttpGetRequestParameters_
#define _PresenceHttpGetRequestParameters_
    class PresenceHttpGetRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 32;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C811B0;
        }
        char _0x0008[40];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00019
    // RuntimeId: 09405
    // TypeInfo:  0x0000000142C81200
#ifndef _PresenceGetBlockListRequestParameters_
#define _PresenceGetBlockListRequestParameters_
    class PresenceGetBlockListRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 19;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81200;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00006
    // RuntimeId: 09404
    // TypeInfo:  0x0000000142C81250
#ifndef _PresenceRemoveFriendRequestParameters_
#define _PresenceRemoveFriendRequestParameters_
    class PresenceRemoveFriendRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 6;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81250;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00005
    // RuntimeId: 09403
    // TypeInfo:  0x0000000142C812A0
#ifndef _PresenceAcceptFriendRequestParameters_
#define _PresenceAcceptFriendRequestParameters_
    class PresenceAcceptFriendRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 5;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C812A0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00057
    // RuntimeId: 09402
    // TypeInfo:  0x0000000142C812F0
#ifndef _PresenceInviteFriendRequestParameters_
#define _PresenceInviteFriendRequestParameters_
    class PresenceInviteFriendRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 57;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C812F0;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00013
    // RuntimeId: 09401
    // TypeInfo:  0x0000000142C81340
#ifndef _PresenceDownloadBlobRequestParameters_
#define _PresenceDownloadBlobRequestParameters_
    class PresenceDownloadBlobRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 13;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81340;
        }
        char _0x0008[24];
    };//Size=0x0020
#endif

    ////////////////////////////////////////
    // ClassId:   00033
    // RuntimeId: 09400
    // TypeInfo:  0x0000000142C81390
#ifndef _PresenceUpdateAchievementsRequestParameters_
#define _PresenceUpdateAchievementsRequestParameters_
    class PresenceUpdateAchievementsRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 33;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C81390;
        }
        char _0x0008[48];
    };//Size=0x0038
#endif

    ////////////////////////////////////////
    // ClassId:   00014
    // RuntimeId: 09399
    // TypeInfo:  0x0000000142C813E0
#ifndef _PresenceUnlockAchievementsRequestParameters_
#define _PresenceUnlockAchievementsRequestParameters_
    class PresenceUnlockAchievementsRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 14;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C813E0;
        }
        char _0x0008[32];
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00080
    // RuntimeId: 09387
    // TypeInfo:  0x0000000142C7FB60
#ifndef _PresenceEvent_
#define _PresenceEvent_
    class PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 80;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FB60;
        }
        char _0x0000[8];
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00089
    // RuntimeId: 09397
    // TypeInfo:  0x0000000142C7FDB0
#ifndef _BlockListEvent_
#define _BlockListEvent_
    class BlockListEvent : public PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 89;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FDB0;
        }
        char _0x0008[12952];
    };//Size=0x32A0
#endif

    ////////////////////////////////////////
    // ClassId:   00082
    // RuntimeId: 09396
    // TypeInfo:  0x0000000142C7FF90
#ifndef _OnlineStatusEvent_
#define _OnlineStatusEvent_
    class OnlineStatusEvent : public PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 82;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FF90;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00081
    // RuntimeId: 09395
    // TypeInfo:  0x0000000142C7FFE0
#ifndef _FirstPartyNetworkStatusEvent_
#define _FirstPartyNetworkStatusEvent_
    class FirstPartyNetworkStatusEvent : public PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 81;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FFE0;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00087
    // RuntimeId: 09394
    // TypeInfo:  0x0000000142C80030
#ifndef _ActiveControllerUpdatedEvent_
#define _ActiveControllerUpdatedEvent_
    class ActiveControllerUpdatedEvent : public PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 87;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C80030;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00088
    // RuntimeId: 09393
    // TypeInfo:  0x0000000142C7FE00
#ifndef _PlaygroupUpdatedEvent_
#define _PlaygroupUpdatedEvent_
    class PlaygroupUpdatedEvent : public PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 88;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FE00;
        }
        char _0x0008[56];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   00083
    // RuntimeId: 09392
    // TypeInfo:  0x0000000142C7FE50
#ifndef _FriendUpdatedEvent_
#define _FriendUpdatedEvent_
    class FriendUpdatedEvent : public PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 83;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FE50;
        }
        char _0x0008[16];
    };//Size=0x0018
#endif

    ////////////////////////////////////////
    // ClassId:   00091
    // RuntimeId: 09391
    // TypeInfo:  0x0000000142C7FEA0
#ifndef _DirtySockPresenceBackend_
#define _DirtySockPresenceBackend_
    class DirtySockPresenceBackend : public PresenceBackend
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 91;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FEA0;
        }
        char _0x0020[168];
    };//Size=0x00C8
#endif

    ////////////////////////////////////////
    // ClassId:   00093
    // RuntimeId: 09390
    // TypeInfo:  0x0000000142C7FEF0
#ifndef _BlazePresenceBackend_
#define _BlazePresenceBackend_
    class BlazePresenceBackend : public PresenceBackend
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 93;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FEF0;
        }
        char _0x0020[176];
    };//Size=0x00D0
#endif

    ////////////////////////////////////////
    // ClassId:   00002
    // RuntimeId: 09389
    // TypeInfo:  0x0000000142C7FAC0
#ifndef _GameParameters_
#define _GameParameters_
    class GameParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 2;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FAC0;
        }
        char _0x0000[960];
    };//Size=0x03C0
#endif

    ////////////////////////////////////////
    // ClassId:   00060
    // RuntimeId: 09435
    // TypeInfo:  0x0000000142C808A0
#ifndef _PresenceGetAuthCodeRequestParameters_
#define _PresenceGetAuthCodeRequestParameters_
    class PresenceGetAuthCodeRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 60;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C808A0;
        }
        char _0x0008[80];
    };//Size=0x0058
#endif

    ////////////////////////////////////////
    // ClassId:   00085
    // RuntimeId: 09398
    // TypeInfo:  0x0000000142C7FF40
#ifndef _PartyEvent_
#define _PartyEvent_
    class PartyEvent : public PresenceEvent
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 85;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7FF40;
        }
        char _0x0008[88];
    };//Size=0x0060
#endif

    ////////////////////////////////////////
    // ClassId:   03854
    // RuntimeId: 09386
    // TypeInfo:  0x0000000142C7EF90
#ifndef _OnlineSettings_
#define _OnlineSettings_
#pragma pack(push, 8)
    class OnlineSettings : public SystemSettings
    {
    public:
        static __inline OnlineSettings* DefaultInstance()
        {
            return (OnlineSettings*)0x0000000068A67C10;
        }
        static __inline unsigned int ClassId()
        {
            return 3854;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7EF90;
        }
        BackendType m_Backend; //0x0020
        BackendType m_PeerBackend; //0x0024
        OnlineEnvironment m_Environment; //0x0028
        OnlineEnvironment m_ResolvedEnvironment; //0x002C
        OnlineProviderAsset* m_Provider; //0x0030
        Array<OnlinePlatformConfiguration> m_Platforms; //0x0038
        char* m_ServiceNameOverride; //0x0040
        __int32 m_BlazeLogLevel; //0x0048
        __int32 m_DirtySockLogLevel; //0x004C
        RichPresenceData* m_RichPresence; //0x0050
        LicenseConfiguration* m_LicenseConfig; //0x0058
        char* m_MatchmakingOptions; //0x0060
        char* m_MatchmakingMode; //0x0068
        char* m_Region; //0x0070
        char* m_Country; //0x0078
        char* m_PingSite; //0x0080
        char* m_MatchmakingToken; //0x0088
        unsigned __int32 m_NegativeUserCacheRefreshPeriod; //0x0090
        char _0x0094[4];
        char* m_ServerLoginEmail; //0x0098
        char* m_ServerLoginPassword; //0x00A0
        char* m_ServerLoginPersonaName; //0x00A8
        __int32 m_BlazeServerConnectionTimeout; //0x00B0
        __int32 m_BlazeServerTimeout; //0x00B4
        __int32 m_BlazeClientConnectionTimeout; //0x00B8
        __int32 m_BlazeClientTimeout; //0x00BC
        __int32 m_DirtySockServerPacketQueueCapacity; //0x00C0
        bool m_ClientIsPresenceEnabled; //0x00C4
        bool m_ServerIsPresenceEnabled; //0x00C5
        bool m_UseExternalLoginFlow; //0x00C6
        bool m_IsSecure; //0x00C7
        bool m_EnableQoS; //0x00C8
        bool m_MatchmakeImmediately; //0x00C9
        bool m_ServerIsReconfigurable; //0x00CA
        bool m_SupportHostMigration; //0x00CB
        bool m_ServerAllowAnyReputation; //0x00CC
        char _0x00CD[3];
    };//Size=0x00D0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01975
    // RuntimeId: 09382
    // TypeInfo:  0x0000000142C7EFF0
#ifndef _OnlineServicesAsset_
#define _OnlineServicesAsset_
#pragma pack(push, 8)
    class OnlineServicesAsset : public Asset
    {
    public:
        static __inline OnlineServicesAsset* DefaultInstance()
        {
            return (OnlineServicesAsset*)0x0000000068A2C860;
        }
        static __inline unsigned int ClassId()
        {
            return 1975;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7EFF0;
        }
        Array<PresenceServiceData*> m_OnlineServices; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01635
    // RuntimeId: 09362
    // TypeInfo:  0x0000000142C7F3B0
#ifndef _PresenceServiceData_
#define _PresenceServiceData_
#pragma pack(push, 8)
    class PresenceServiceData : public Asset
    {
    public:
        static __inline PresenceServiceData* DefaultInstance()
        {
            return (PresenceServiceData*)0x0000000068A24DD0;
        }
        static __inline unsigned int ClassId()
        {
            return 1635;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F3B0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01659
    // RuntimeId: 09378
    // TypeInfo:  0x0000000142C7F0B0
#ifndef _PresenceUserProfileServiceData_
#define _PresenceUserProfileServiceData_
#pragma pack(push, 8)
    class PresenceUserProfileServiceData : public PresenceServiceData
    {
    public:
        static __inline PresenceUserProfileServiceData* DefaultInstance()
        {
            return (PresenceUserProfileServiceData*)0x0000000068A25300;
        }
        static __inline unsigned int ClassId()
        {
            return 1659;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F0B0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01656
    // RuntimeId: 09376
    // TypeInfo:  0x0000000142C7F110
#ifndef _PresenceUserIdServiceData_
#define _PresenceUserIdServiceData_
#pragma pack(push, 8)
    class PresenceUserIdServiceData : public PresenceServiceData
    {
    public:
        static __inline PresenceUserIdServiceData* DefaultInstance()
        {
            return (PresenceUserIdServiceData*)0x0000000068A25270;
        }
        static __inline unsigned int ClassId()
        {
            return 1656;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F110;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01652
    // RuntimeId: 09374
    // TypeInfo:  0x0000000142C7F170
#ifndef _PresenceStatisticsServiceData_
#define _PresenceStatisticsServiceData_
#pragma pack(push, 8)
    class PresenceStatisticsServiceData : public PresenceServiceData
    {
    public:
        static __inline PresenceStatisticsServiceData* DefaultInstance()
        {
            return (PresenceStatisticsServiceData*)0x0000000068A25110;
        }
        static __inline unsigned int ClassId()
        {
            return 1652;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F170;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01636
    // RuntimeId: 09372
    // TypeInfo:  0x0000000142C7F1D0
#ifndef _PresencePlaygroupServiceData_
#define _PresencePlaygroupServiceData_
#pragma pack(push, 8)
    class PresencePlaygroupServiceData : public PresenceServiceData
    {
    public:
        static __inline PresencePlaygroupServiceData* DefaultInstance()
        {
            return (PresencePlaygroupServiceData*)0x0000000068A24E00;
        }
        static __inline unsigned int ClassId()
        {
            return 1636;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F1D0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01658
    // RuntimeId: 09370
    // TypeInfo:  0x0000000142C7F230
#ifndef _PresenceLeaderboardServiceData_
#define _PresenceLeaderboardServiceData_
#pragma pack(push, 8)
    class PresenceLeaderboardServiceData : public PresenceServiceData
    {
    public:
        static __inline PresenceLeaderboardServiceData* DefaultInstance()
        {
            return (PresenceLeaderboardServiceData*)0x0000000068A252D0;
        }
        static __inline unsigned int ClassId()
        {
            return 1658;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F230;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01649
    // RuntimeId: 09368
    // TypeInfo:  0x0000000142C7F290
#ifndef _PresenceFriendsServiceData_
#define _PresenceFriendsServiceData_
#pragma pack(push, 8)
    class PresenceFriendsServiceData : public PresenceServiceData
    {
    public:
        static __inline PresenceFriendsServiceData* DefaultInstance()
        {
            return (PresenceFriendsServiceData*)0x0000000068A25080;
        }
        static __inline unsigned int ClassId()
        {
            return 1649;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F290;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01655
    // RuntimeId: 09366
    // TypeInfo:  0x0000000142C7F2F0
#ifndef _PresenceAuthenticationServiceData_
#define _PresenceAuthenticationServiceData_
#pragma pack(push, 8)
    class PresenceAuthenticationServiceData : public PresenceServiceData
    {
    public:
        static __inline PresenceAuthenticationServiceData* DefaultInstance()
        {
            return (PresenceAuthenticationServiceData*)0x0000000068A25240;
        }
        static __inline unsigned int ClassId()
        {
            return 1655;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F2F0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01643
    // RuntimeId: 09364
    // TypeInfo:  0x0000000142C7F350
#ifndef _PresenceAchievementServiceData_
#define _PresenceAchievementServiceData_
#pragma pack(push, 8)
    class PresenceAchievementServiceData : public PresenceServiceData
    {
    public:
        static __inline PresenceAchievementServiceData* DefaultInstance()
        {
            return (PresenceAchievementServiceData*)0x0000000068A24F60;
        }
        static __inline unsigned int ClassId()
        {
            return 1643;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F350;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01646
    // RuntimeId: 09380
    // TypeInfo:  0x0000000142C7F050
#ifndef _PresencePrivilegeServiceData_
#define _PresencePrivilegeServiceData_
#pragma pack(push, 8)
    class PresencePrivilegeServiceData : public PresenceServiceData
    {
    public:
        static __inline PresencePrivilegeServiceData* DefaultInstance()
        {
            return (PresencePrivilegeServiceData*)0x0000000068A24FF0;
        }
        static __inline unsigned int ClassId()
        {
            return 1646;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F050;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01531
    // RuntimeId: 09360
    // TypeInfo:  0x0000000142C7F410
#ifndef _OnlineProviderAsset_
#define _OnlineProviderAsset_
#pragma pack(push, 8)
    class OnlineProviderAsset : public Asset
    {
    public:
        static __inline OnlineProviderAsset* DefaultInstance()
        {
            return (OnlineProviderAsset*)0x0000000068A22AC0;
        }
        static __inline unsigned int ClassId()
        {
            return 1531;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F410;
        }
        Array<OnlineProviderConfiguration> m_Configurations; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03260
    // RuntimeId: 09354
    // TypeInfo:  0x0000000142C7F470
#ifndef _OnlineRichPresenceLevelDescriptionComponent_
#define _OnlineRichPresenceLevelDescriptionComponent_
#pragma pack(push, 8)
    class OnlineRichPresenceLevelDescriptionComponent : public LevelDescriptionComponent
    {
    public:
        static __inline OnlineRichPresenceLevelDescriptionComponent* DefaultInstance()
        {
            return (OnlineRichPresenceLevelDescriptionComponent*)0x0000000068A5A560;
        }
        static __inline unsigned int ClassId()
        {
            return 3260;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F470;
        }
        RichPresencePresenceString* m_PresenceMode; //0x0010
        Array<RichPresenceContextSetting> m_ContextValues; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01612
    // RuntimeId: 09342
    // TypeInfo:  0x0000000142C7F4D0
#ifndef _OriginPresenceBackendData_
#define _OriginPresenceBackendData_
#pragma pack(push, 8)
    class OriginPresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline OriginPresenceBackendData* DefaultInstance()
        {
            return (OriginPresenceBackendData*)0x0000000068A245E0;
        }
        static __inline unsigned int ClassId()
        {
            return 1612;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F4D0;
        }
        Array<char*> m_CommerceCategories; //0x0018
        __int32 m_Timeout; //0x0020
        OriginPartyType m_PartyType; //0x0024
        bool m_PartySupportEnabled; //0x0028
        char _0x0029[7];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01956
    // RuntimeId: 09330
    // TypeInfo:  0x0000000142C7F650
#ifndef _ServerBackendData_
#define _ServerBackendData_
#pragma pack(push, 8)
    class ServerBackendData : public Asset
    {
    public:
        static __inline ServerBackendData* DefaultInstance()
        {
            return (ServerBackendData*)0x0000000068A2BFC0;
        }
        static __inline unsigned int ClassId()
        {
            return 1956;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F650;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01959
    // RuntimeId: 09334
    // TypeInfo:  0x0000000142C7F590
#ifndef _LanServerBackendData_
#define _LanServerBackendData_
#pragma pack(push, 8)
    class LanServerBackendData : public ServerBackendData
    {
    public:
        static __inline LanServerBackendData* DefaultInstance()
        {
            return (LanServerBackendData*)0x0000000068A2C050;
        }
        static __inline unsigned int ClassId()
        {
            return 1959;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F590;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01957
    // RuntimeId: 09332
    // TypeInfo:  0x0000000142C7F5F0
#ifndef _LocalServerBackendData_
#define _LocalServerBackendData_
#pragma pack(push, 8)
    class LocalServerBackendData : public ServerBackendData
    {
    public:
        static __inline LocalServerBackendData* DefaultInstance()
        {
            return (LocalServerBackendData*)0x0000000068A2BFF0;
        }
        static __inline unsigned int ClassId()
        {
            return 1957;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F5F0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01961
    // RuntimeId: 09338
    // TypeInfo:  0x0000000142C7F530
#ifndef _BlazeServerBackendData_
#define _BlazeServerBackendData_
#pragma pack(push, 8)
    class BlazeServerBackendData : public ServerBackendData
    {
    public:
        static __inline BlazeServerBackendData* DefaultInstance()
        {
            return (BlazeServerBackendData*)0x0000000068A2C0C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1961;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F530;
        }
        BlazeCreateGameParameters m_CreateParameters; //0x0018
        OnlineEnvironmentConsoleUrl m_ConfigUrl; //0x0020
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01605
    // RuntimeId: 09328
    // TypeInfo:  0x0000000142C7F6B0
#ifndef _DurangoPresenceBackendData_
#define _DurangoPresenceBackendData_
#pragma pack(push, 8)
    class DurangoPresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline DurangoPresenceBackendData* DefaultInstance()
        {
            return (DurangoPresenceBackendData*)0x0000000068A243F0;
        }
        static __inline unsigned int ClassId()
        {
            return 1605;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F6B0;
        }
        unsigned __int32 m_TitleId; //0x0018
        char _0x001C[4];
        char* m_ServiceConfigId; //0x0020
    };//Size=0x0028
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01610
    // RuntimeId: 09326
    // TypeInfo:  0x0000000142C7F710
#ifndef _Ps4PresenceBackendData_
#define _Ps4PresenceBackendData_
#pragma pack(push, 8)
    class Ps4PresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline Ps4PresenceBackendData* DefaultInstance()
        {
            return (Ps4PresenceBackendData*)0x0000000068A24540;
        }
        static __inline unsigned int ClassId()
        {
            return 1610;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F710;
        }
        Ps4TitleData m_DefaultTitleData; //0x0018
        Array<Ps4TitleData> m_TitleData; //0x0028
        Ps4AgeSettings m_AgeSettings; //0x0030
    };//Size=0x0040
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01611
    // RuntimeId: 09318
    // TypeInfo:  0x0000000142C7F770
#ifndef _XenonPresenceBackendData_
#define _XenonPresenceBackendData_
#pragma pack(push, 8)
    class XenonPresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline XenonPresenceBackendData* DefaultInstance()
        {
            return (XenonPresenceBackendData*)0x0000000068A245A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1611;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F770;
        }
        unsigned __int32 m_TitleId; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01607
    // RuntimeId: 09316
    // TypeInfo:  0x0000000142C7F7D0
#ifndef _Ps3PresenceBackendData_
#define _Ps3PresenceBackendData_
#pragma pack(push, 8)
    class Ps3PresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline Ps3PresenceBackendData* DefaultInstance()
        {
            return (Ps3PresenceBackendData*)0x0000000068A24460;
        }
        static __inline unsigned int ClassId()
        {
            return 1607;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F7D0;
        }
        char* m_CommunicationId; //0x0018
        char* m_CommunicationSignature; //0x0020
        Array<Ps3ParentalLockAgeSettings> m_ParentalLockAgeSettings; //0x0028
        Array<Ps3ServiceSettings> m_ServiceSettings; //0x0030
    };//Size=0x0038
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03693
    // RuntimeId: 09308
    // TypeInfo:  0x0000000142C7F830
#ifndef _Ps3ParentalLockAgeSettingsOverrides_
#define _Ps3ParentalLockAgeSettingsOverrides_
#pragma pack(push, 8)
    class Ps3ParentalLockAgeSettingsOverrides : public DataContainer
    {
    public:
        static __inline Ps3ParentalLockAgeSettingsOverrides* DefaultInstance()
        {
            return (Ps3ParentalLockAgeSettingsOverrides*)0x0000000068A64430;
        }
        static __inline unsigned int ClassId()
        {
            return 3693;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F830;
        }
        Array<Ps3ParentalLockAgeSettingsForCountry> m_Overrides; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01604
    // RuntimeId: 09302
    // TypeInfo:  0x0000000142C7F890
#ifndef _LanPresenceBackendData_
#define _LanPresenceBackendData_
#pragma pack(push, 8)
    class LanPresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline LanPresenceBackendData* DefaultInstance()
        {
            return (LanPresenceBackendData*)0x0000000068A243C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1604;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F890;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01603
    // RuntimeId: 09300
    // TypeInfo:  0x0000000142C7F8F0
#ifndef _DirtySockPresenceBackendData_
#define _DirtySockPresenceBackendData_
#pragma pack(push, 8)
    class DirtySockPresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline DirtySockPresenceBackendData* DefaultInstance()
        {
            return (DirtySockPresenceBackendData*)0x0000000068A24390;
        }
        static __inline unsigned int ClassId()
        {
            return 1603;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F8F0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01608
    // RuntimeId: 09298
    // TypeInfo:  0x0000000142C7F950
#ifndef _BlazePresenceBackendData_
#define _BlazePresenceBackendData_
#pragma pack(push, 8)
    class BlazePresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline BlazePresenceBackendData* DefaultInstance()
        {
            return (BlazePresenceBackendData*)0x0000000068A244B0;
        }
        static __inline unsigned int ClassId()
        {
            return 1608;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7F950;
        }
        char* m_DefaultRoleName; //0x0018
        Array<MatchmakingSession*> m_MatchmakingSessions; //0x0020
        bool m_UseDemanglerService; //0x0028
        char _0x0029[7];
    };//Size=0x0030
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01609
    // RuntimeId: 09981
    // TypeInfo:  0x0000000142C8FFC0
#ifndef _SpartaPresenceBackendData_
#define _SpartaPresenceBackendData_
#pragma pack(push, 8)
    class SpartaPresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline SpartaPresenceBackendData* DefaultInstance()
        {
            return (SpartaPresenceBackendData*)0x0000000068A24500;
        }
        static __inline unsigned int ClassId()
        {
            return 1609;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8FFC0;
        }
        Array<SpartaPs4Service> m_Services; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03547
    // RuntimeId: 09294
    // TypeInfo:  0x0000000142C7DA20
#ifndef _MatchmakingSession_
#define _MatchmakingSession_
#pragma pack(push, 8)
    class MatchmakingSession : public DataContainer
    {
    public:
        static __inline MatchmakingSession* DefaultInstance()
        {
            return (MatchmakingSession*)0x0000000068A61180;
        }
        static __inline unsigned int ClassId()
        {
            return 3547;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7DA20;
        }
        MatchmakingSessionMode m_Mode; //0x0010
        unsigned __int32 m_DurationMs; //0x0014
        MatchmakingCriteria m_Criteria; //0x0018
        GameParametersData* m_CreateGameParams; //0x0088
        MatchmakingSession* m_OnNotFound; //0x0090
        Array<MatchmakingModifier*> m_Modifiers; //0x0098
    };//Size=0x00A0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03550
    // RuntimeId: 09290
    // TypeInfo:  0x0000000142C7DAE0
#ifndef _MatchmakingModifier_
#define _MatchmakingModifier_
#pragma pack(push, 8)
    class MatchmakingModifier : public DataContainer
    {
    public:
        static __inline MatchmakingModifier* DefaultInstance()
        {
            return (MatchmakingModifier*)0x0000000068A612D0;
        }
        static __inline unsigned int ClassId()
        {
            return 3550;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7DAE0;
        }
    };//Size=0x0010
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03551
    // RuntimeId: 09292
    // TypeInfo:  0x0000000142C7DA80
#ifndef _MatchmakingPlayerCapacityModifier_
#define _MatchmakingPlayerCapacityModifier_
#pragma pack(push, 8)
    class MatchmakingPlayerCapacityModifier : public MatchmakingModifier
    {
    public:
        static __inline MatchmakingPlayerCapacityModifier* DefaultInstance()
        {
            return (MatchmakingPlayerCapacityModifier*)0x0000000068A61300;
        }
        static __inline unsigned int ClassId()
        {
            return 3551;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7DA80;
        }
        char* m_Attribute; //0x0010
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01792
    // RuntimeId: 09228
    // TypeInfo:  0x0000000142C7DB40
#ifndef _LicenseConfiguration_
#define _LicenseConfiguration_
#pragma pack(push, 8)
    class LicenseConfiguration : public Asset
    {
    public:
        static __inline LicenseConfiguration* DefaultInstance()
        {
            return (LicenseConfiguration*)0x0000000068A280C0;
        }
        static __inline unsigned int ClassId()
        {
            return 1792;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7DB40;
        }
        Array<LicenseInfo> m_Licenses; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01998
    // RuntimeId: 09220
    // TypeInfo:  0x0000000142C7DBA0
#ifndef _GameParametersData_
#define _GameParametersData_
#pragma pack(push, 8)
    class GameParametersData : public Asset
    {
    public:
        static __inline GameParametersData* DefaultInstance()
        {
            return (GameParametersData*)0x0000000068A2CFB0;
        }
        static __inline unsigned int ClassId()
        {
            return 1998;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7DBA0;
        }
        char* m_ServerName; //0x0018
        PersistenceGameType m_GameType; //0x0020
        unsigned __int32 m_QueueCapacity; //0x0024
        unsigned __int32 m_Mod; //0x0028
        unsigned __int32 m_MaxSpectators; //0x002C
        GameNetworkTopology m_GameTopology; //0x0030
        GamePeer2PeerMode m_PeerMode; //0x0034
        GameNetworkTopology m_VoipTopology; //0x0038
        char _0x003C[4];
        Array<GameAttributeData> m_Attributes; //0x0040
        Array<GameRoleInformation*> m_RoleConfiguration; //0x0048
        bool m_OpenToInvites; //0x0050
        bool m_OpenToMatchmaking; //0x0051
        bool m_OpenToJoinByPlayer; //0x0052
        bool m_OpenToBrowsing; //0x0053
        bool m_Ranked; //0x0054
        bool m_JoinInProgressSupported; //0x0055
        char _0x0056[2];
    };//Size=0x0058
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03570
    // RuntimeId: 09218
    // TypeInfo:  0x0000000142C7DC00
#ifndef _GameRoleInformation_
#define _GameRoleInformation_
#pragma pack(push, 8)
    class GameRoleInformation : public DataContainer
    {
    public:
        static __inline GameRoleInformation* DefaultInstance()
        {
            return (GameRoleInformation*)0x0000000068A61820;
        }
        static __inline unsigned int ClassId()
        {
            return 3570;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7DC00;
        }
        char* m_RoleName; //0x0010
        unsigned __int32 m_Capacity; //0x0018
        char _0x001C[4];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00092
    // RuntimeId: 09963
    // TypeInfo:  0x0000000142C8D670
#ifndef _SpartaOriginPresenceBackend_
#define _SpartaOriginPresenceBackend_
    class SpartaOriginPresenceBackend : public PresenceBackend
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 92;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C8D670;
        }
        char _0x0020[32];
    };//Size=0x0040
#endif

    ////////////////////////////////////////
    // ClassId:   01657
    // RuntimeId: 09170
    // TypeInfo:  0x0000000142C7B5E0
#ifndef _NickelServiceData_
#define _NickelServiceData_
#pragma pack(push, 8)
    class NickelServiceData : public PresenceServiceData
    {
    public:
        static __inline NickelServiceData* DefaultInstance()
        {
            return (NickelServiceData*)0x0000000068A252A0;
        }
        static __inline unsigned int ClassId()
        {
            return 1657;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B5E0;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01606
    // RuntimeId: 09166
    // TypeInfo:  0x0000000142C7B640
#ifndef _NickelPresenceBackendData_
#define _NickelPresenceBackendData_
#pragma pack(push, 8)
    class NickelPresenceBackendData : public PresenceBackendData
    {
    public:
        static __inline NickelPresenceBackendData* DefaultInstance()
        {
            return (NickelPresenceBackendData*)0x0000000068A24430;
        }
        static __inline unsigned int ClassId()
        {
            return 1606;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B640;
        }
    };//Size=0x0018
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00053
    // RuntimeId: 09164
    // TypeInfo:  0x0000000142C7B6A0
#ifndef _PresenceOfferPlayStationPlusRequestParameters_
#define _PresenceOfferPlayStationPlusRequestParameters_
    class PresenceOfferPlayStationPlusRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 53;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B6A0;
        }
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00043
    // RuntimeId: 09163
    // TypeInfo:  0x0000000142C7B6F0
#ifndef _PresenceRedeemCodeRequestParameters_
#define _PresenceRedeemCodeRequestParameters_
    class PresenceRedeemCodeRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 43;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B6F0;
        }
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00012
    // RuntimeId: 09162
    // TypeInfo:  0x0000000142C7B740
#ifndef _PresenceConsumeRequestParameters_
#define _PresenceConsumeRequestParameters_
    class PresenceConsumeRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 12;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B740;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00044
    // RuntimeId: 09161
    // TypeInfo:  0x0000000142C7B790
#ifndef _PresenceCheckoutRequestParameters_
#define _PresenceCheckoutRequestParameters_
    class PresenceCheckoutRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 44;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B790;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00041
    // RuntimeId: 09160
    // TypeInfo:  0x0000000142C7B7E0
#ifndef _PresenceGetDetailedDescriptionRequestParameters_
#define _PresenceGetDetailedDescriptionRequestParameters_
    class PresenceGetDetailedDescriptionRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 41;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B7E0;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00050
    // RuntimeId: 09159
    // TypeInfo:  0x0000000142C7B830
#ifndef _PresenceGetBasicDescriptionRequestParameters_
#define _PresenceGetBasicDescriptionRequestParameters_
    class PresenceGetBasicDescriptionRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 50;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B830;
        }
        char _0x0008[8];
    };//Size=0x0010
#endif

    ////////////////////////////////////////
    // ClassId:   00038
    // RuntimeId: 09158
    // TypeInfo:  0x0000000142C7B880
#ifndef _PresenceLoadConfigurationFileRequestParameters_
#define _PresenceLoadConfigurationFileRequestParameters_
    class PresenceLoadConfigurationFileRequestParameters : public PresenceRequestParameters
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 38;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B880;
        }
        char _0x0008[32];
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00098
    // RuntimeId: 09157
    // TypeInfo:  0x0000000142C7B590
#ifndef _NickelPresenceBackend_
#define _NickelPresenceBackend_
    class NickelPresenceBackend : public PresenceBackend
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 98;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B590;
        }
        char _0x0020[416];
    };//Size=0x01C0
#endif

    ////////////////////////////////////////
    // ClassId:   01183
    // RuntimeId: 09156
    // TypeInfo:  0x0000000142C7B130
#ifndef _LuaRunnerSharedVarsEntity_
#define _LuaRunnerSharedVarsEntity_
    class LuaRunnerSharedVarsEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1183;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B130;
        }
        char _0x0020[160];
    };//Size=0x00C0
#endif

    ////////////////////////////////////////
    // ClassId:   00915
    // RuntimeId: 09155
    // TypeInfo:  0x0000000142C7B1D0
#ifndef _LuaRunnerScriptEntity_
#define _LuaRunnerScriptEntity_
    class LuaRunnerScriptEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 915;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B1D0;
        }
        char _0x0020[11392];
    };//Size=0x2CA0
#endif

    ////////////////////////////////////////
    // ClassId:   00099
    // RuntimeId: 09154
    // TypeInfo:  0x0000000142C7B0E0
#ifndef _CompiledLuaResource_
#define _CompiledLuaResource_
    class CompiledLuaResource
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 99;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7B0E0;
        }
        char _0x0000[88];
    };//Size=0x0058
#endif

    ////////////////////////////////////////
    // ClassId:   02930
    // RuntimeId: 09153
    // TypeInfo:  0x0000000142C7AF10
#ifndef _LuaRunnerSharedVarsEntityData_
#define _LuaRunnerSharedVarsEntityData_
#pragma pack(push, 8)
    class LuaRunnerSharedVarsEntityData : public EntityData
    {
    public:
        static __inline LuaRunnerSharedVarsEntityData* DefaultInstance()
        {
            return (LuaRunnerSharedVarsEntityData*)0x0000000068A4C0E0;
        }
        static __inline unsigned int ClassId()
        {
            return 2930;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7AF10;
        }
        Realm m_Realm; //0x0018
        bool m_AddToDebugDisplay; //0x001C
        char _0x001D[3];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   02279
    // RuntimeId: 09151
    // TypeInfo:  0x0000000142C7AF70
#ifndef _LuaRunnerScriptEntityData_
#define _LuaRunnerScriptEntityData_
#pragma pack(push, 8)
    class LuaRunnerScriptEntityData : public EntityData
    {
    public:
        static __inline LuaRunnerScriptEntityData* DefaultInstance()
        {
            return (LuaRunnerScriptEntityData*)0x0000000068A33600;
        }
        static __inline unsigned int ClassId()
        {
            return 2279;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7AF70;
        }
        char* m_Script; //0x0018
        Array<char*> m_InputEvents; //0x0020
        Array<char*> m_OutputEvents; //0x0028
        Array<char*> m_InputFloatProperties; //0x0030
        Array<char*> m_OutputFloatProperties; //0x0038
        Array<char*> m_InputIntProperties; //0x0040
        Array<char*> m_OutputIntProperties; //0x0048
        Array<char*> m_InputBoolProperties; //0x0050
        Array<char*> m_OutputBoolProperties; //0x0058
        Array<char*> m_InputStringProperties; //0x0060
        Array<char*> m_OutputStringProperties; //0x0068
        Array<char*> m_InputTransformProperties; //0x0070
        Array<char*> m_OutputTransformProperties; //0x0078
        Array<char*> m_InputVec3Properties; //0x0080
        Array<char*> m_OutputVec3Properties; //0x0088
        ExecuteOnPropertyChangeType m_ExecuteOnPropertyChange; //0x0090
        __int32 m_PriorityForExecutingPerFrame; //0x0094
        Realm m_Realm; //0x0098
        char _0x009C[4];
        LuaRunnerCompiledLua* m_CompiledLua; //0x00A0
        bool m_AutoStartExecutingPerFrame; //0x00A8
        bool m_AutoStartForInitialization; //0x00A9
        bool m_RunOnPropertyChange; //0x00AA
        bool m_AddToDebugDisplay; //0x00AB
        char _0x00AC[4];
    };//Size=0x00B0
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01586
    // RuntimeId: 09147
    // TypeInfo:  0x0000000142C7AFD0
#ifndef _LuaRunnerCompiledLua_
#define _LuaRunnerCompiledLua_
#pragma pack(push, 8)
    class LuaRunnerCompiledLua : public Asset
    {
    public:
        static __inline LuaRunnerCompiledLua* DefaultInstance()
        {
            return (LuaRunnerCompiledLua*)0x0000000068A23E80;
        }
        static __inline unsigned int ClassId()
        {
            return 1586;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7AFD0;
        }
        // unhandled basic type ResourceRef m_CompiledLuaResource; //0x0018
        char _0x0018[8];
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01538
    // RuntimeId: 08749
    // TypeInfo:  0x0000000142C75BC0
#ifndef _UITextDatabase_
#define _UITextDatabase_
#pragma pack(push, 8)
    class UITextDatabase : public Asset
    {
    public:
        static __inline UITextDatabase* DefaultInstance()
        {
            return (UITextDatabase*)0x0000000068A22CA0;
        }
        static __inline unsigned int ClassId()
        {
            return 1538;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C75BC0;
        }
        LanguageFormat m_Language; //0x0018
        Guid m_BinaryChunk; //0x001C
        char _0x001C[16];
        unsigned __int32 m_BinaryChunkSize; //0x002C
        Guid m_HistogramChunk; //0x0030
        char _0x0030[16];
        unsigned __int32 m_HistogramChunkSize; //0x0040
        char _0x0044[4];
    };//Size=0x0048
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   01547
    // RuntimeId: 08751
    // TypeInfo:  0x0000000142C75B60
#ifndef _LocalizationAsset_
#define _LocalizationAsset_
#pragma pack(push, 8)
    class LocalizationAsset : public Asset
    {
    public:
        static __inline LocalizationAsset* DefaultInstance()
        {
            return (LocalizationAsset*)0x0000000068A23000;
        }
        static __inline unsigned int ClassId()
        {
            return 1547;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C75B60;
        }
        Array<UITextDatabase*> m_LocalizedTexts; //0x0018
    };//Size=0x0020
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   00612
    // RuntimeId: 09141
    // TypeInfo:  0x0000000142C7A980
#ifndef _GroundHeightEntity_
#define _GroundHeightEntity_
    class GroundHeightEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 612;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7A980;
        }
        char _0x0020[8240];
    };//Size=0x2050
#endif

    ////////////////////////////////////////
    // ClassId:   01182
    // RuntimeId: 09140
    // TypeInfo:  0x0000000142C7AA20
#ifndef _DynamicEnvmapEntity_
#define _DynamicEnvmapEntity_
    class DynamicEnvmapEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 1182;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7AA20;
        }
        char _0x0020[96];
    };//Size=0x0080
#endif

    ////////////////////////////////////////
    // ClassId:   00646
    // RuntimeId: 09139
    // TypeInfo:  0x0000000142C7AAC0
#ifndef _DynamicEnlightenEntity_
#define _DynamicEnlightenEntity_
    class DynamicEnlightenEntity : public Entity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 646;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7AAC0;
        }
        char _0x0020[128];
    };//Size=0x00A0
#endif

    ////////////////////////////////////////
    // ClassId:   00105
    // RuntimeId: 08986
    // TypeInfo:  0x0000000142C76980
#ifndef _MeshEntityBase_
#define _MeshEntityBase_
    class MeshEntityBase
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 105;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C76980;
        }
        char _0x0000[8];
    };//Size=0x0008
#endif

    ////////////////////////////////////////
    // ClassId:   00662
    // RuntimeId: 05413
    // TypeInfo:  0x0000000142C23DC0
#ifndef _LocalWindForceEntity_
#define _LocalWindForceEntity_
    class LocalWindForceEntity : public SpatialEntity
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 662;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C23DC0;
        }
        char _0x0028[152];
    };//Size=0x00C0
#endif

    ////////////////////////////////////////
    // ClassId:   00100
    // RuntimeId: 09136
    // TypeInfo:  0x0000000142C7A8E0
#ifndef _EnlightenProbeSet_
#define _EnlightenProbeSet_
    class EnlightenProbeSet
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 100;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7A8E0;
        }
        char _0x0000[176];
    };//Size=0x00B0
#endif

    ////////////////////////////////////////
    // ClassId:   00101
    // RuntimeId: 09135
    // TypeInfo:  0x0000000142C7A7F0
#ifndef _EnlightenStaticDatabase_
#define _EnlightenStaticDatabase_
    class EnlightenStaticDatabase
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 101;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7A7F0;
        }
        char _0x0000[40];
    };//Size=0x0028
#endif

    ////////////////////////////////////////
    // ClassId:   00102
    // RuntimeId: 09134
    // TypeInfo:  0x0000000142C7A840
#ifndef _EnlightenShaderDatabase_
#define _EnlightenShaderDatabase_
    class EnlightenShaderDatabase
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 102;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7A840;
        }
        char _0x0000[48];
    };//Size=0x0030
#endif

    ////////////////////////////////////////
    // ClassId:   00103
    // RuntimeId: 09133
    // TypeInfo:  0x0000000142C7A890
#ifndef _EnlightenDatabase_
#define _EnlightenDatabase_
    class EnlightenDatabase
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 103;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7A890;
        }
        char _0x0000[128];
    };//Size=0x0080
#endif

    ////////////////////////////////////////
    // ClassId:   00104
    // RuntimeId: 09132
    // TypeInfo:  0x0000000142C7A930
#ifndef _EnlightenCubeMap_
#define _EnlightenCubeMap_
    class EnlightenCubeMap
    {
    public:
        static __inline unsigned int ClassId()
        {
            return 104;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C7A930;
        }
        char _0x0000[592];
    };//Size=0x0250
#endif

    ////////////////////////////////////////
    // ClassId:   03465
    // RuntimeId: 09129
    // TypeInfo:  0x0000000142C79070
#ifndef _WorldRenderSettingsBase_
#define _WorldRenderSettingsBase_
#pragma pack(push, 16)
    class WorldRenderSettingsBase : public DataContainer
    {
    public:
        static __inline WorldRenderSettingsBase* DefaultInstance()
        {
            return (WorldRenderSettingsBase*)0x0000000068A5F0C0;
        }
        static __inline unsigned int ClassId()
        {
            return 3465;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C79070;
        }
        float m_CullScreenAreaScale; //0x0010
        float m_ViewportScale; //0x0014
        char _0x0018[8];
        Vec3 m_MotionBlurClearColor; //0x0020
        Vec3 m_DynamicEnvmapDefaultPosition; //0x0030
        float m_ShadowViewportScale; //0x0040
        float m_ShadowmapMinFov; //0x0044
        float m_ShadowmapSizeZScale; //0x0048
        unsigned __int32 m_ShadowmapResolution; //0x004C
        unsigned __int32 m_ShadowmapQuality; //0x0050
        float m_ShadowmapPoissonFilterScale; //0x0054
        unsigned __int32 m_ShadowmapSliceCount; //0x0058
        float m_ShadowmapSliceSchemeWeight; //0x005C
        float m_ShadowmapFirstSliceScale; //0x0060
        float m_ShadowmapViewDistance; //0x0064
        float m_ShadowmapExtrusionLength; //0x0068
        float m_ShadowmapTransitionBlendAmount; //0x006C
        float m_MotionBlurScale; //0x0070
        float m_MotionBlurFixedShutterTime; //0x0074
        float m_MotionBlurMax; //0x0078
        float m_MotionBlurRadialBlurMax; //0x007C
        float m_MotionBlurNoiseScale; //0x0080
        unsigned __int32 m_MotionBlurQuality; //0x0084
        unsigned __int32 m_MotionBlurDebugMode; //0x0088
        unsigned __int32 m_MotionBlurMaxSampleCount; //0x008C
        float m_ForceMotionBlurDepthCutoff; //0x0090
        float m_ForceMotionBlurCutoffGradientScale; //0x0094
        float m_MotionBlurDepthCheckThreshold; //0x0098
        float m_MotionBlurDepthCheckMaxDistance; //0x009C
        unsigned __int32 m_MultisampleCount; //0x00A0
        float m_MultisampleThreshold; //0x00A4
        __int32 m_OnlyShadowmapSlice; //0x00A8
        WorldViewMode m_ViewMode; //0x00AC
        float m_XenonHdrColorScale; //0x00B0
        float m_XenonHdrColorScaleFactor; //0x00B4
        float m_SkyEnvmapFilterWidth; //0x00B8
        unsigned __int32 m_SkyEnvmapResolution; //0x00BC
        __int32 m_DrawDebugSkyEnvmapMipLevel; //0x00C0
        MipmapFilterMode m_SkyEnvmapFilterMode; //0x00C4
        unsigned __int32 m_SkyEnvmapSidesPerFrameCount; //0x00C8
        float m_DynamicEnvmapFilterWidth; //0x00CC
        unsigned __int32 m_DynamicEnvmapResolution; //0x00D0
        __int32 m_DrawDebugDynamicEnvmapMipLevel; //0x00D4
        MipmapFilterMode m_DynamicEnvmapFilterMode; //0x00D8
        unsigned __int32 m_HudTextureWidth; //0x00DC
        unsigned __int32 m_HudTextureHeight; //0x00E0
        bool m_ShadowmapsEnable; //0x00E4
        bool m_TransparencyShadowmapsEnable; //0x00E5
        bool m_TransparencyShadowmapsHalfRes; //0x00E6
        bool m_ShadowmapFixedMovementEnable; //0x00E7
        bool m_ShadowmapFixedDepthEnable; //0x00E8
        bool m_ShadowmapViewDistanceScaleEnable; //0x00E9
        bool m_ShadowmapCullVolumeEnable; //0x00EA
        bool m_ShadowmapAccumEnable; //0x00EB
        bool m_ShadowmapAccumBilinearEnable; //0x00EC
        bool m_ShadowmapTransitionBlendEnable; //0x00ED
        bool m_Ps3ShadowmapTilingEnable; //0x00EE
        bool m_Ps3Shadowmap16BitEnable; //0x00EF
        bool m_Ps3SpotLightShadowmap16BitEnable; //0x00F0
        bool m_DxShadowmap16BitEnable; //0x00F1
        bool m_DxSpotLightShadowmap16BitEnable; //0x00F2
        bool m_ApplyShadowmapsEnable; //0x00F3
        bool m_GenerateShadowmapsEnable; //0x00F4
        bool m_SimpleShadowmapsEnable; //0x00F5
        bool m_EmitterShadowingBlendToggle; //0x00F6
        bool m_EmitterShadowingManySamplesToggle; //0x00F7
        bool m_DxLinearDepth32BitFormatEnable; //0x00F8
        bool m_DxDepthBuffer32BitEnable; //0x00F9
        bool m_MotionBlurEnable; //0x00FA
        bool m_MotionBlurForceOn; //0x00FB
        bool m_MotionBlurOptimalStableVelocityFormula; //0x00FC
        bool m_MotionBlurStencilPassEnable; //0x00FD
        bool m_MotionBlurGeometryPassEnable; //0x00FE
        bool m_MotionBlurBackgroundPassEnable; //0x00FF
        bool m_MotionBlurCenteredEnable; //0x0100
        bool m_DrawDebugMultisampleClassify; //0x0101
        bool m_DrawTransparent; //0x0102
        bool m_DrawTransparentDecal; //0x0103
        bool m_Enable; //0x0104
        bool m_HdrEnable; //0x0105
        bool m_ReadOnlyDepthEnable; //0x0106
        bool m_ConsoleRenderTargetPoolSharingEnable; //0x0107
        bool m_Ps3RenderTargetPoolGBufferOffsetEnable; //0x0108
        bool m_FastHdrEnable; //0x0109
        bool m_XenonFloatDepthBufferEnable; //0x010A
        bool m_Ps3HdrClearEnable; //0x010B
        bool m_Ps3TilingEnable; //0x010C
        bool m_Ps3ZCullEnable; //0x010D
        bool m_Ps3SCullEnable; //0x010E
        bool m_Ps3ColorCompressionEnable; //0x010F
        bool m_Ps3TiledHalfTargetEnable; //0x0110
        bool m_Ps3TiledSSAOTargetsEnable; //0x0111
        bool m_FinalPostEnable; //0x0112
        bool m_OutputGammaCorrectionEnable; //0x0113
        bool m_ScreenEffectEnable; //0x0114
        bool m_DrawLightSources; //0x0115
        bool m_DrawSolidBoundingBoxes; //0x0116
        bool m_DrawLineBoundingBoxes; //0x0117
        bool m_DrawBoundingSpheres; //0x0118
        bool m_DrawFrustums; //0x0119
        bool m_DrawDebugShadowmaps; //0x011A
        bool m_DrawDebugSpotLightShadowmaps; //0x011B
        bool m_DrawDebugSkyEnvmap; //0x011C
        bool m_DrawDebugVelocityBuffer; //0x011D
        bool m_DrawDebugZBufferEnable; //0x011E
        bool m_DrawDebugHalfResEnvironment; //0x011F
        bool m_DrawDebugDistortion; //0x0120
        bool m_DrawDebugVisibleEntityTypes; //0x0121
        bool m_DrawDebugSkyTextures; //0x0122
        bool m_DrawDebugMarschnerTextures; //0x0123
        bool m_DrawDebugDof; //0x0124
        bool m_DrawDebugDofFullscreen; //0x0125
        bool m_DrawDebugHalfResHdrTargets; //0x0126
        bool m_WireframeEnable; //0x0127
        bool m_ZPassEnable; //0x0128
        bool m_OccluderMeshZPrepassEnable; //0x0129
        bool m_OccluderMeshZPrepassDebugEnable; //0x012A
        bool m_HalfResEnable; //0x012B
        bool m_ForceFullResEnable; //0x012C
        bool m_HalfResLensFlaresEnable; //0x012D
        bool m_ForegroundEnable; //0x012E
        bool m_ForegroundDepthClearEnable; //0x012F
        bool m_ForegroundZPassEnable; //0x0130
        bool m_ForegroundTransparentEnable; //0x0131
        bool m_BilateralHalfResCompositeEnable; //0x0132
        bool m_TiledHalfResCompositeEnable; //0x0133
        bool m_TiledHalfResStencilOccludersEnable; //0x0134
        bool m_SkyEnable; //0x0135
        bool m_SkyFogEnable; //0x0136
        bool m_SkyHeightFogEnable; //0x0137
        bool m_SkyForwardScatteringEnable; //0x0138
        bool m_DistortionEnable; //0x0139
        bool m_DistortionHalfResEnable; //0x013A
        bool m_Distortion8BitEnable; //0x013B
        bool m_DistortionTilingEnable; //0x013C
        bool m_StaticEnvmapEnable; //0x013D
        bool m_CustomEnvmapEnable; //0x013E
        bool m_CustomEnvmapMipmapClampEnable; //0x013F
        bool m_SkyEnvmapEnable; //0x0140
        bool m_SkyEnvmapMipmapGenEnable; //0x0141
        bool m_SkyEnvmapUpdateEnable; //0x0142
        bool m_SkyEnvmapForceUpdateEnable; //0x0143
        bool m_SkyEnvmapUse8BitTexture; //0x0144
        bool m_DynamicEnvmapEnable; //0x0145
        bool m_DynamicEnvmapMipmapGenEnable; //0x0146
        bool m_DrawDebugDynamicEnvmap; //0x0147
        bool m_HairCoverageEnable; //0x0148
        bool m_SetupJobEnable; //0x0149
        bool m_FinishSyncJobsFirstEnable; //0x014A
        bool m_PrepareDispatchListJobEnable; //0x014B
        char _0x014C[4];
    };//Size=0x0150
#pragma pack(pop)
#endif

    ////////////////////////////////////////
    // ClassId:   03466
    // RuntimeId: 09131
    // TypeInfo:  0x0000000142C79010
#ifndef _WorldRenderSettings_
#define _WorldRenderSettings_
#pragma pack(push, 16)
    class WorldRenderSettings : public WorldRenderSettingsBase
    {
    public:
        static __inline WorldRenderSettings* DefaultInstance()
        {
            return (WorldRenderSettings*)0x0000000068A5F230;
        }
        static __inline unsigned int ClassId()
        {
            return 3466;
        }
        static __inline uintptr_t ClassInfoPtr()
        {
            return 0x0000000142C79010;
        }
        Vec4 m_OverlayColor; //0x0150
        unsigned __int32 m_GenericEntityMaxVisibleEntityCount; //0x0160
        unsigned __int32 m_DrawDebugGroundHeight; //0x0164
        float m_DecalVolumeScale; //0x0168
        unsigned __int32 m_GBufferLayout; //0x016C
        unsigned __int32 m_GBufferTestCount; //0x0170
        float m_GBufferAlphaTestSimpleSmoothness; //0x0174
        float m_GBufferForceSmoothness; //0x0178
        float m_GBufferForceSpecularAlbedo; //0x017C
        QualityLevel m_SpotLightsAsConeLightsLevel; //0x0180
        float m_LightTileMinArea; //0x0184
        float m_LightStencilMinArea; //0x0188
        float m_LightNarrowAngleThreshold; //0x018C
        unsigned __int32 m_OutdoorLightTileBatchCount; //0x0190
        unsigned __int32 m_XenonDrawDebugLightTileGridMode; //0x0194
        unsigned __int32 m_XenonLightTileConstantBufferSize; //0x0198
        unsigned __int32 m_XenonLightTileMaxPointLightCount; //0x019C
        unsigned __int32 m_XenonLightTileMaxLineLightCount; //0x01A0
        unsigned __int32 m_XenonLightTileMaxSpotLightCount; //0x01A4
        unsigned __int32 m_Ps3LightTileMethod; //0x01A8
        unsigned __int32 m_Ps3LightTileJobCount; //0x01AC
        unsigned __int32 m_Ps3LightTileJobPriority; //0x01B0
        float m_Ps3LightTileJobYieldGranularity; //0x01B4
        float m_Ps3LightTileJobYieldAggressiveGranularity; //0x01B8
        unsigned __int32 m_Ps3LightTileJobMaxFbTileCount; //0x01BC
        __int32 m_OnlyLightTileIndex; //0x01C0
        unsigned __int32 m_SpotLightShadowmapResolution; //0x01C4
        unsigned __int32 m_SpotLightShadowmapQuality; //0x01C8
        float m_SpotLightShadowmapPoissonFilterScale; //0x01CC
        QualityLevel m_SpotLightShadowmapLevel; //0x01D0
        unsigned __int32 m_MaxPointLightCount; //0x01D4
        unsigned __int32 m_MaxSpotLightCount; //0x01D8
        unsigned __int32 m_MaxSpotLightShadowCount; //0x01DC
        unsigned __int32 m_MaxDestructionVolumeCount; //0x01E0
        unsigned __int32 m_MaxDecalVolumeCount; //0x01E4
        float m_SpotLightNearPlane; //0x01E8
        unsigned __int32 m_LightTileCsAvgLightCountPerTile; //0x01EC
        float m_LightLodFadeArea; //0x01F0
        float m_LightLodMinArea; //0x01F4
        float m_LightLodRadiusFactor; //0x01F8
        float m_LightLodSpecularFadeAreaStart; //0x01FC
        float m_LightLodSpecularFadeAreaEnd; //0x0200
        float m_LightForceIntensity; //0x0204
        float m_LightIntensityScale; //0x0208
        float m_LightRadiusScale; //0x020C
        float m_LightAttenuationThreshold; //0x0210
        unsigned __int32 m_ShadowOcclusionCullingWidth; //0x0214
        unsigned __int32 m_ShadowOcclusionCullingHeight; //0x0218
        unsigned __int32 m_ShadowOcclusionTriangleCount; //0x021C
        float m_FrustumSilhouetteCullingPadding; //0x0220
        __int32 m_OnlyTileIndex; //0x0224
        float m_PlanarReflectionViewScale; //0x0228
        float m_PlanarReflectionCullFOV; //0x022C
        float m_PlanarReflectionFarPlane; //0x0230
        unsigned __int32 m_DrawDebugPlanarReflectionMode; //0x0234
        float m_ReflectionLodScale; //0x0238
        PostProcessAAMode m_PostProcessAntialiasingMode; //0x023C
        __int32 m_FxaaForceVendor; //0x0240
        ScaleResampleMode m_RenderScaleResampleMode; //0x0244
        float m_LightCubeMapStencilMinArea; //0x0248
        unsigned __int32 m_DrawDebugIndirectCubeMapMipLevel; //0x024C
        unsigned __int32 m_DrawDebugIndirectCubeMapIndex; //0x0250
        bool m_SimpleRenderingEnable; //0x0254
        bool m_GenericEntityRendererEnable; //0x0255
        bool m_ZBufferShadowTestEnable; //0x0256
        bool m_DecalVolumeEnable; //0x0257
        bool m_DrawDebugDecalVolumes; //0x0258
        bool m_DrawDebugDestructionVolumes; //0x0259
        bool m_LensFlaresEnable; //0x025A
        bool m_DrawDebugLensFlareOccluders; //0x025B
